{"title":"Thalia - Estoy Enamorado (2nafish)","uid":5803151,"size":170803204,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:011b1e999b70ef150288f8eb358d49e9bb41c403&amp;dn=Thalia+-+Estoy+Enamorado+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1283341715,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video is in Spanish.\n\n\n&quot;Estoy Enamorado&quot; (English: I'm in Love) is the third single of the live album Primera Fila by Mexican singer ThalÃƒÂ­a and is a duet with new Puerto Rican musician Pedro CapÃƒÂ³. &quot;Estoy Enamorado&quot; was released as third official single in the United States, Mexico and Puerto Rico while in Argentina, Spain and Europe released &quot;EnsÃƒÂ©ÃƒÂ±ame a Vivir&quot; as third single. According to Sony, Con la duda was set to be released as the third Single, Thalia Promoted it at the 2010 Billboard Awards Show, After no Confirmation By Thalia neither Sony, The Song was not Officially released. Thalia Confirmed on her twitter That she was working on the video for Ensename a Vivir, This news was happily accepted by her fans, but then it was cancelled and released Estoy Enamorado Intead. Rumors Affirm that sony released Estoy Enamorado only to promote Pedro Capo in USA.\n\nThe song marks another radio hit, becoming top 10 in the USA Latin Pop Song, with no Promotion By Thalia or Sony. Before the release of the album, Estoy Enamorado had the Highest Peak in the USA itunes, Reaching #5, Beating Equivocada, The official single at that time which peak was #6.\n\nPrimera fila (English: [In] Front Row) is the first Live CD/DVD album by the Mexican singer-songwriter ThalÃƒÂ­a. This album was recorded in Miami, Florida at the BankUnited Center on July 29 and 30, 2009, with a selected audience to attend the concert. Primera Fila is her first project under her new label Sony Music. The album was released on December 1, 2009. It includes duets with five-time Latin Grammy Award winning-Mexican singer and songwriter Joan Sebastian and the new Puerto Rican musician Pedro CapÃƒÂ³. It also contains new songs and a medley of 4 of her hit songs.\n\nAriadna ThalÃƒÂ­a Sodi Miranda (born August 26, 1971), known simply as ThalÃƒÂ­a, is a Mexican singer and actress. Her name is linked to soap operas  which made her famous worldwide. ThalÃƒÂ­a began her music career at the age of 9. Her soap operas have been watched by over 2 billion people in 180 countries. She is known globally as &quot;the queen of soap operas&quot; for being the biggest TV phenomenon in the decade of the 90s. ThalÃƒÂ­a has the keys of more than 50 cities in the world, and has toured in five continents, making her one of the most internationally famous Latin singers ever. ThalÃƒÂ­a has received more than 2000 awards throughout her career for both singing and acting and has sold over 25 million albums worldwide.She is also known among english speakers for her song I Want You from her crossover album in 2003 which went to #22 on the Billboard Hot 100.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:011b1e999b70ef150288f8eb358d49e9bb41c403","amp;dn":"Thalia+-+Estoy+Enamorado+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"011b1e999b70ef150288f8eb358d49e9bb41c403","infoHashBuffer":{"type":"Buffer","data":[1,27,30,153,155,112,239,21,2,136,248,235,53,141,73,233,187,65,196,3]},"announce":[],"urlList":[]}}