{"title":"Eve Ensler - The Vagina Monologues [2001]","uid":8656528,"size":176302321,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:01f62f578ef104cc6b398686f239ac4de5d61c1a&amp;dn=Eve+Ensler+-+The+Vagina+Monologues+%5B2001%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pizzaslice","files":-1,"time":1373228962,"description":"Eve Ensler / Eve Ensler - The Vagina Monologues / The Vagina Monologues [Eve Ensler, 2001]\n\n\n\nYear : 2001 Author : Eve Ensler / Eve Ensler Artist : Eve Ensler / Eve Ensler Genre : Social Science - Women's Studies Publisher : Random House Audio Type : the audiobook Audio codec : MP3 Bitrate : 224 kbps \n\n\n\nDescription : &quot;I was worried about vaginas. I was worried about what we think about vaginas, and even more worried that we don't think about them .... So I decided to talk to women about their vaginas, to do vagina interviews, which became vagina monologues. I talked with over two hundred women. I talked to old women, young women, married women, single women, lesbians, college professors, actors, corporate professionals, sex workers, African American women, Hispanic women, Asian American women , Native American Women, Caucasian Women, Jewish Women. At first Women Were Reluctant to Talk. They Were A Little Shy. But once They Got going, you could not stop Them. &quot; So Begins Eve Ensler's hilarious, eye-Opening Tour into the last frontier, the forbidden zone at the heart of every woman. Adapted from the award-winning one-woman show that's rocked audiences around the world, this groundbreaking book gives voice to a chorus of lusty, outrageous, poignant, and thoroughly human stories, transforming the question mark hovering over the female anatomy into a permanent victory sign. With laughter and compassion, Ensler transports her audiences to a world we've never dared to know, guaranteeing that no one who reads The Vagina Monologues will ever look at a woman's body the same way again. book &quot;The Vagina Monologues&quot; was born out of conversations Eve Entsler with women - younger, older, mature, married, divorced, lonely, heterosexual, lesbian, bisexual, white, black - very diverse. The same was the only topic of the interview, taboo, taboo, shameful. Conversations that begin with the optional questions like, &quot;If your vagina dress that she wore?&quot; Or &quot;If your vagina could talk, what would she say?&quot; Ended with piercing revelations and surprising discoveries of which has grown and this legendary book. &quot;The Vagina Monologues&quot; provocative, but precisely because of its provocative they are helping women all over the world for the first time to establish a unique relationship with his amazing body.\t\n","torrent":{"xt":"urn:btih:01f62f578ef104cc6b398686f239ac4de5d61c1a","amp;dn":"Eve+Ensler+-+The+Vagina+Monologues+%5B2001%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01f62f578ef104cc6b398686f239ac4de5d61c1a","infoHashBuffer":{"type":"Buffer","data":[1,246,47,87,142,241,4,204,107,57,134,134,242,57,172,77,229,214,28,26]},"announce":[],"urlList":[]}}