{"title":"In For A Quick Garden (Led Zeppelin live 1973) [MP4 x264 AAC] RU","uid":11768719,"size":2398535254,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:02025b96e50800be84fcca649c51df21d6b85b66&amp;dn=In+For+A+Quick+Garden+%28Led+Zeppelin+live+1973%29+%5BMP4+x264+AAC%5D+RU&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eckoes","files":3,"time":1426971006,"description":"In For a Quick Garden - Led Zeppelin live 1973\nThe Song Remains The Same fan-edit by eckoes\nMade for FanEdit\n\n\nCategory: FanFix\n\n\n*Title: In For a Quick Garden\n*Faneditor Name: eckoes\nTagline: In Concert Only\n\n\n*Original Movie Title: The Song Remains the Same \n*Genre: Concert film\nFranchise: none\n*Fanedit Type: FanFix\n\n\n*Original Release Date: October 1976\n*Original Running Time: 137 min.\n*Fanedit Release Date: February 2014\n*Fanedit Running Time: 137 min.\nTime Cut: 25-30 min. approx.\nTime Added: 25-30 min. approx.\n\n\nAvailable in HD? No.\n\n\n*Additional Link:   &lt;a href=&quot;\nhttp://www.fanedit.org/forums/showthread.php?11297-The-Song-Remains-the-Same-Led-Zeppelin-live&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fanedit.org/forums/showthread.php?11297-The-Song-Remains-the-Same-Led-Zeppelin-live&lt;/a&gt;\n\n\n*Amazon.\nB0013K1ALE\n\n\n*IMDB Link.\ntt0075244\n\n\n*Brief Synopsis:\nDespite some great live music captured in the movie, the concert is constantly interrupted by something either fairly uninteresting (dull documentary footage that seems staged) or seriously drowned in vanity (the band home movies, or fantasy sequences). \nThis edit shows one complete uninterrupted concert out of all official footage available.\n\n\n*Intention:\nThe official soundtrack LP is a must-have live album, and I always wondered how the movie would look like if it followed the LP more closely. \nPrevious attempts made by others are available, but they felt a bit crude so I decided to try doing the assembly myself.\n\n\nAdditional Notes:\nBe aware that this movie is infamous for having been badly edited at the time. Especially regarding the sound/visual synchro. \nWhen preparing the restored DVD/Blu-Ray in 2007, Jimmy Page was not allowed to modify any footage of the film due to copyrights issues, but he did modify the soundtrack heavily to make it more in sync with the visuals. \nWhile being a huge improvement, many out-of-sync moment remains.\n\n\nOther Sources:\n-The 2007 double DVD bonus disc: Celebration Day (Cutting Copy), Over The Hills and Far Away, The Ocean, Misty Mountain Hop\n-The Led Zeppelin 2003 double DVD: Black Dog, Since I've Been Loving You, various crowd shots and backstage footage (from menu)\n-8mm footage from the concerts released by the band on Youtube: dialogues, performance gap in Dazed and Confused\n-An old VHS called &quot;The First Cuts&quot;: alternative live concert shots for Rain Song and The Song Remains The Same\n-The remixed soundtrack from 2007 (double CD): Heartbreaker, dialogues, crowd\n-The official soundtrack from 1976 (Cd from the nineties): dialogues\n\n\nSpecial Thanks:\nAlain Le Roux, for whom this edit is dedicated,\nPaul Currie, from Yeeshkul!, for his kindness in providing rare footage across the Atlantic free-of-charge,\nEddie Edwards, author of The Garden Tapes, for his deep research into this concert recording,\nNeglify, from the FanEdit forum, for being patient while guiding me through the approval process,\nAnd of course the guys from the Led Zeppelin forum. Keep on rocking!\n\n\n*Release Information:\nNTSC DVD-9\nAVI/MKV\nMOV/MP4/M4V\n\n\nSpecial Features:\nVimeo\n\n\nEditing Details:\n-Jimmy Page used voluntarily 8mm and VHS footage for the LZ DVD 2003 footage. And for great artistic effect. I used the same technique: additive transitions, aspect ratio preserved, color correction, and syncing with the soundtrack.\n-The soundtrack is entirely made of the Kevin Shirley fantastic stereo mix. That is the glue that holds the movie together: while the visuals can be rough sometimes, the soundtrack quality kicks ass.\n\n\nCuts and Additions:\n\n\nADDITIONS:\n-4 new songs included: Celebration Day, Over The Hills and Far Away, The Ocean, and Misty Mountain Hop.\n-Added a few dialogues between songs using a combination of 8mm footage and the album sountrack.\n-Heartbreaker is included! Fully! This was made possible by using every backstage footage cut from the movie, and the 2007 CD, to create a brand new documentary/fantasy sequence,.\n-Black Dog is now complete, thanks to the alternate edit from LZ DVD 2003.\n\n\nALTERATIONS:\n-The concert plays with the songs in their original playing order, and the music plays without any interruption.\n-The credits are now at the end of the movie.\n-Since I've Been Loving You use an alternate edit made for the Led Zeppelin 2003 DVD for the sole reason of being much more in sync then it's original counterpart.\n-A random backstage shot inserted in Dazed and Confused is now replaced by real concert footage.\n-The Song Remains The Same and Rain Song are entirely re-edited to include more actual performance footage, and less of Robert Plant fantasy sequence.\n\n\nDELETIONS:\n-Backstage dialogues are gone.\n-Documentary parts are also gone.\n-The robbery sequence is cut. Any allusions to it is gone.\n-The band &quot;home movies&quot; introduction is cut, as well as Peter Grant and Richard Cole fantasy sequence. The concert starts right away.\n\n\nTECHNICAL FIXES:\n-LZ 2003 DVD footage have their original aspect ratio corrected (using frames from the movie as reference), and level-adjusted (the blacks were crushed).\n-&quot;First Cuts&quot; footage have been corrected in many aspects: colors, speed, sync and aspect ratio (using frames from the movie as reference).\n-Black levels and contrats should remian consistent through the movie despite the varying footage quality.\n\n\nNOT FOR PROFIT\nIf you post it to Youtube or else, please at least credit the author. I worked hard on this edit","torrent":{"xt":"urn:btih:02025b96e50800be84fcca649c51df21d6b85b66","amp;dn":"In+For+A+Quick+Garden+%28Led+Zeppelin+live+1973%29+%5BMP4+x264+AAC%5D+RU","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02025b96e50800be84fcca649c51df21d6b85b66","infoHashBuffer":{"type":"Buffer","data":[2,2,91,150,229,8,0,190,132,252,202,100,156,81,223,33,214,184,91,102]},"announce":[],"urlList":[]}}