{"title":"Dead Prez - Information Age 2012 VBR V0","uid":9829521,"size":77213576,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:028e9ac7c75a7e03b8476d68ec2efa5e0ba75c88&amp;dn=Dead+Prez+-+Information+Age+2012+VBR+V0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xplicitly","files":-1,"time":1395818236,"description":"Dead Prez\n\n01. Upload (Begin Within) (0:44)\n02. A New Beginning (3:09)\n03. What If The Lights Go Out (2:41)\n04. GHN: Global Hood News (1:19)\n05. Dirty White Girl (3:57)\n06. No Way As The Way (3:54)\n07. Learning Growing Changing (4:20)\n08. Time Travel (4:40)\n09. Take Me To The Future (4:42)\n10. GHN: Elections &amp; Crisis (1:05)\n11. The Awakening (4:50)\n12. Download (Expand Beyond) (Bonus Track) (6:51)\n\n\nDead Prez is an American underground political hip hop duo composed of stic.man and M-1. They are known for their confrontational style combined with socialist and pan-Africanist lyrics. These lyrics tend to focus on social justice, critical pedagogy, institutional racism, police, capitalism, education, prison systems, religion, activism against political repression, and corporate control over the media, especially hip-hop record labels. Dead Prez made their stance clear on their first album, declaring on the lead song, &quot;I'm a African&quot; that the group is &quot;somewhere between N.W.A. and P.E..&quot;\n\nIn 1990, M-1 headed to Tallahassee to attend FAMU (Florida Agricultural and Mechanical University) where he and stic.man met and connected due to their mutual love of music and similar political ideology. There, their views solidified, M-1 becoming particularly interested in the Black Panther Party.\n\nM-1 joined the International People's Democratic Uhuru Movement in Chicago for three years while stic.man remained behind in Florida and started getting into trouble. Burned out by the arduous labor of Uhuru, M-1 decided it was time to focus on music and stic.man agreed.\n\nDead prez transcribed the political education they acquired into lyrical poetry. Brand Nubian's Lord Jamar discovered them in New York and helped them sign a deal with Loud Records, but being new on a famous label like Loud (home to the Wu-Tang Clan and Mobb Deep) was not easy. Although Dead Prez was not always Loud's top priority, they built a fan base thanks to their over-the-top performances (they've been known to ignite dollar bills and toss apples into the audiences, declaring that they must eat healthily). They also made an early appearance on Big Pun's Capital Punishment in 1998.","torrent":{"xt":"urn:btih:028e9ac7c75a7e03b8476d68ec2efa5e0ba75c88","amp;dn":"Dead+Prez+-+Information+Age+2012+VBR+V0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"028e9ac7c75a7e03b8476d68ec2efa5e0ba75c88","infoHashBuffer":{"type":"Buffer","data":[2,142,154,199,199,90,126,3,184,71,109,104,236,46,250,94,11,167,92,136]},"announce":[],"urlList":[]}}