{"title":"THE DEVIL WEARS PRADA DISCOGRAPHY [FUDGESOCIETY]","uid":5471634,"size":257153070,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:03a58d44af34452a344448eb8953f7b0d71459a4&amp;dn=THE+DEVIL+WEARS+PRADA+DISCOGRAPHY+%5BFUDGESOCIETY%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"FudgeSociety","files":33,"time":1269918397,"description":"I got a little lazy for this one, I really don't feel like typing the info on this torrent out. Just click download torrent and see for yourself, not satisfied, comment me on what to improove on. If you are happily satisfies with this torrent comment on how awesome it was. Whatever it is, tell me about it.\n\nThe Devil Wears Prada Studio Discography, I'm personally not a fan of Live albums, and greatest hits. Because it's honestly redundant. Why have more than what you need unless you're a die hard fan. And if you're a die hard fan of a band, you wouldn't be torrenting their music. You would be supporting and buying, which I still support for every band album I upload. I promote torrenting, seeing if the band is good, then going out and buying the album. In no way do I promote the soul use of my torrents without intent to buy the album. Don't ruin the internet for us, these torrents are just a way to see how a band sounds, and find any missing tracks that you might not have.\n\nThank you and please seed. The support of my torrents, will greatly increase the amount of uploading I do. More seeds, more torrents, more smileys! :D","torrent":{"xt":"urn:btih:03a58d44af34452a344448eb8953f7b0d71459a4","amp;dn":"THE+DEVIL+WEARS+PRADA+DISCOGRAPHY+%5BFUDGESOCIETY%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03a58d44af34452a344448eb8953f7b0d71459a4","infoHashBuffer":{"type":"Buffer","data":[3,165,141,68,175,52,69,42,52,68,72,235,137,83,247,176,215,20,89,164]},"announce":[],"urlList":[]}}