{"title":"Ximo Tebar - Goes Blue - With Lou Donaldson and Lonnie Smith","uid":11748757,"size":132467437,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:046356b4b58e6a324e73955e37bc25467037ebf3&amp;dn=Ximo+Tebar+-+Goes+Blue+-+With+Lou+Donaldson+and+Lonnie+Smith&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"L_Hammond","files":12,"time":1426118861,"description":"Ximo Tebar - Goes Blue - With Lou Donaldson and Lonnie Smith\n\nFans of mid-'60s soul-jazz organ dates will find much to enjoy here!\n\n\nTracklisting:\n01. Goes Blue (6:04)\n02. I Love You (6:01)\n03. Laura (5:53)\n04. Days of Wine and Roses (7:56)\n05. Invitation (8:22)\n06. Midnight Creeper (6:31)\n07. Come to Me (7:35)\n08. Blues Walk (6:41)\n\nTotal Time: 54:53\n\n\nPersonnel:\n- Ximo Tebar - guitar\n- Dr. Lonnie Smith - Hammond B-3 organ\n- Idris Muhammad - drums\n- Lou Donaldson - alto saxophone (tracks 3, 6 and 8)\n\nYear of release: 2005\nLabel: Sunnyside Records\n\nFormat: MP3 320 kbit/s. All songs are tagged by the book.\n\n--------\n\nReview by Scott Yanow\nThis is an easy set to enjoy. Guitarist Ximo Tebar has a style in the tradition of Grant Green, Wes Montgomery, and early George Benson without copying his predecessors. Teaming up with organist Dr. Lonnie Smith and drummer Idris Muhammad, Tebar performs standards and basic originals in a relaxed, bluish, and swinging fashion. Veteran altoist Lou Donaldson comes close to stealing the show during his three appearances (&quot;Laura,&quot; &quot;Midnight Creeper,&quot; and &quot;Blues Walk&quot;), but Tebar remains confident and rises to the occasion. Fans of mid-'60s soul-jazz organ dates will find much to enjoy here.\n\n\nReview by Stephen Latessa\nGoes Blue is the third entry in Ximo Tebar's Jazz Guitar Trio series, which has featured the Spanish guitarist playing with such luminaries as Idris Muhammad and Joey DeFrancesco. On this entry, Tebar and Muhammad are joined by Dr. Lonnie Smith and, on three tracks, Lou Donaldson. Listeners will not find anything too challenging or surprising, but the performances are always accomplished and solid, as should be expected from the quality of the players involved.\n\nThe three numbers featuring Donaldson are obvious highlights. His opening wail on a slow burn version of &quot;Laura is suitably dramatic, paving the way for his smooth, sensitive solo. Donaldson also appears on a fun version of &quot;Midnight Creeper, which he first performed with Muhammad and Smith back in 1968 with George Benson on guitar. Tebar fits in nicely with a tart, exuberant solo. As always, Smith flashes deep soul with every note and Muhammad cultivates a rock-solid beat.\n\nTebar deviates from the soul-jazz underpinnings of most of the numbers with a lush, delicate take on Mancini's &quot;Days Of Wine And Roses. His introduction is quite lyrical and contrasts nicely with the choppy rhythm the rest of the band creates when it enters. Smith applies some lovely dark colors throughout.\n\nGoes Blue is a relaxed outing that features some great players in a casual frame of mind. It is far from essential, but still highly enjoyable.\n\n--------\n\nL Hammond, The Pirate Bay, where you'll find more jazz organ","torrent":{"xt":"urn:btih:046356b4b58e6a324e73955e37bc25467037ebf3","amp;dn":"Ximo+Tebar+-+Goes+Blue+-+With+Lou+Donaldson+and+Lonnie+Smith","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"046356b4b58e6a324e73955e37bc25467037ebf3","infoHashBuffer":{"type":"Buffer","data":[4,99,86,180,181,142,106,50,78,115,149,94,55,188,37,70,112,55,235,243]},"announce":[],"urlList":[]}}