{"title":"Stargate.Universe.S01E01.iTALiAN.SATRip.XviD-MC68CM72.avi.[evolu","uid":5276562,"size":369082368,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:054faf121f8d8683c87fd2698eaec6ab67640aaa&amp;dn=Stargate.Universe.S01E01.iTALiAN.SATRip.XviD-MC68CM72.avi.%5Bevolu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"OverNight","files":1,"time":1263398035,"description":"Trama \n\nGrazie alla scoperta dell'uso del nono Chevron dello Stargate un team di esploratori raggiunge una nave disabitata chiamata Destiny, lanciata dagli Antichi milioni di anni prima in un viaggio esplorativo attraverso le galassie. Frutto di un esperimento iniziato ma mai completato, la Destiny ha il compito di seguire le tracce delle navi che l'hanno preceduta di un milione di anni, &quot;seminando&quot; gli Stargate nei pianeti di numerose galassie. Il gruppo di civili e scienziati raggiungono la Destiny per sfuggire da un attacco alla base segreta in cui si trovano. Molti di loro non sono addestrati per affrontare la situazione, a partire dal giovane Eli Wallace fino al giorno prima genio della matematica disoccupato e videogiocatore incallito che viveva a casa della madre. A complicare le cose l'impossibilitÃƒÂ  di tornare sulla Terra e di controllare l'astronave, guidata da una sorta di pilota automatico molto avanzato. Fin dai primi episodi le necessitÃƒÂ  del team sono molto concrete: filtri per l'anidride carbonica, energia, acqua. La nave sembra identificare di volta in volta le necessitÃƒÂ  e agire di conseguenza e ciÃƒÂ² talvolta richiede un certo spirito di adattamento ed intraprendenza ai componenti del team. Una caratteristica peculiare della Destiny ÃƒÂ¨ di fermarsi vicino a pianeti a portata di Stargate per un tempo ben preciso, scandito da un conto alla rovescia, trascorso il quale riparte indipendentemente dal fatto che tutti i componenti del team siano riusciti a tornare a bordo. L'astronave si sposta piÃƒÂ¹ velocemente della luce ma non tramite l'iperspazio come invece fanno le altre navi degli Antichi, di milioni di anni piÃƒÂ¹ recenti.\n\nBuona visione!\n\nX Info: evolutionit co cc","torrent":{"xt":"urn:btih:054faf121f8d8683c87fd2698eaec6ab67640aaa","amp;dn":"Stargate.Universe.S01E01.iTALiAN.SATRip.XviD-MC68CM72.avi.%5Bevolu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"054faf121f8d8683c87fd2698eaec6ab67640aaa","infoHashBuffer":{"type":"Buffer","data":[5,79,175,18,31,141,134,131,200,127,210,105,142,174,198,171,103,100,10,170]},"announce":[],"urlList":[]}}