{"title":"Inbred Rednecks.mkv","uid":12426892,"size":2541540198,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:06c9f0704690bcaa03fcb6b1fbd121ba49f83dda&amp;dn=Inbred+Rednecks.mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"sknowman","files":1,"time":1442394110,"description":" Beautiful chicks! Bar fights! Car chases! And genuine rooster fightin'!\nWhat more could you ask for?\n\nThis zany comedy is the winner of FIVE international awards, including\nHollywood Online's Top Underground Film of 1998 and the\n1999 Stoner Classic of the Year Award!\n\n&quot;One must applaud something as funny, revolting, politically incorrect and\noutright disgusting as director Joshua P. Warren's new southern epic\nInbred Rednecks.&quot; ~Jim Bartoo, Hollywood Online\n\n&quot;Get this video NOW!&quot;~Screaming Stoner Video\n\n&quot;This is a damn good movie.&quot;~Chip Lamey, Video Crypt\n\n&quot;At times it had me in tears.&quot;~Allen Richards, B-Film Digest\n\n&quot;Drive-In Academy Award nominations . . . Joe Bob says check it out.&quot;\n~Joe Bob Briggs, &quot;Joe Bob Goes to the Drive-In&quot;\n\nINBRED REDNECKS is the rip-roarin', butt-whoopin', downhome comedy\nby director Joshua P. Warren. The adventure centers around four country\nboys, Billy Bob, Joe Bob, Clovis, and Bubba (not to mention an array of\nunique backwoods characters like Mad Dog, Long John, and Sweetmeat\nthe Midget).\n\nWhen Billy Bob (Brent Ponder) breeds a giant rooster (cleverly named\n&quot;Bigass Rooster&quot;) he feels confident he'll beat Monty (Steve Lewis), the local\nchicken fighting champion, in the upcoming bouts. However, after Monty's\ndefeat, the enraged redneck and his bumbling thugs break into Billy Bob's\nfarmhouse and steal the rooster, setting into motion a hilarious journey that\nexplores the intellectual depths of redneck wit and philosophy.\n\nWritten, produced, and directed by Joshua P. Warren, the film was shot in\nWestern North Carolina using a cast and crew largely composed of local talent. Sponsored by Highland Brewery, Carolina Sub &amp; Deli, Circle-C Western Wear, and the Red-Dot Food Store (and utilizing the skills of talented 99.9 Kiss Radio personalities) the film was primarily generated by the people of the region. Even a great deal of music for the movie was composed and performed by bands and musicians from Western North Carolina. The first feature in a plethora of films planned by Warren's production company, Shadowbox Enterprises, INBRED REDNECKS is a film that locals and Hollywood-folk alike will never forget!\n &lt;a href=&quot;\nhttp://www.inbredrednecks.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.inbredrednecks.com/&lt;/a&gt;","torrent":{"xt":"urn:btih:06c9f0704690bcaa03fcb6b1fbd121ba49f83dda","amp;dn":"Inbred+Rednecks.mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06c9f0704690bcaa03fcb6b1fbd121ba49f83dda","infoHashBuffer":{"type":"Buffer","data":[6,201,240,112,70,144,188,170,3,252,182,177,251,209,33,186,73,248,61,218]},"announce":[],"urlList":[]}}