{"title":"1996 - Doctor Who, The Movie","uid":9217933,"size":733961918,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0755be0478869ac9e6ac6b383e09c078d80c4d9e&amp;dn=1996+-+Doctor+Who%2C+The+Movie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bnaron","files":1,"time":1384890832,"description":"The Eighth Doctor was portrayed by Paul McGann. This 1996 movie is the only appearance of this Doctor during his tenure. The only production title held by this story was Doctor Who. However, producer Philip Segal later suggested 'Enemy Within' as an alternative title. Lacking any other specific name, many fans have adopted this to refer to the movie. Fan groups have also used other informal titles. The DVD release is titled 'Doctor Who: The Movie'. In 2013, Paul McGann returned for the second television appearance of the Eighth Doctor in the minisode titled, 'The Night of the Doctor'.\n\nSynopsis: New Years Eve 1999. Earth is about to run out of time... Returning home to\n          Gallifrey with the remains of his arch enemy, the Master, the TARDIS is\n          forced off course, returning the Doctor into the middle of a street gang's\n          gun battle in downtown San Francisco. Critically wounded in the shoot out,\n          the Doctor has to regenerate to save his own life. And he's not the only\n          one - the Master too has a new body with which to wreak havoc, and his\n          ultimate goal is to take the Doctor's own existence. As the clock counts\n          down to the start of a new millennium, the Doctor has to stop the Master\n          destroying all life on Earth. But at what cost...? ","torrent":{"xt":"urn:btih:0755be0478869ac9e6ac6b383e09c078d80c4d9e","amp;dn":"1996+-+Doctor+Who%2C+The+Movie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0755be0478869ac9e6ac6b383e09c078d80c4d9e","infoHashBuffer":{"type":"Buffer","data":[7,85,190,4,120,134,154,201,230,172,107,56,62,9,192,120,216,12,77,158]},"announce":[],"urlList":[]}}