{"title":"Create Your First Android Game Step By Step ","uid":8845716,"size":788072,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:08919e046e9a225d47fe7285e0fb5869f02487ae&amp;dn=Create+Your+First+Android+Game+Step+By+Step+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"livhre","files":-1,"time":1377376383,"description":"This book is geared towards those who are complete beginners at game creation, and will take you step-by-step through the whole illustrated process of making your first Android game without using code. Using the free MIT App Inventor the book will take you step-by-step through the process of completing a fully working space invader type game from start to finish. No previous knowledge has been assumed, and I will take you step-by-step through the whole game creation process. By the end of the book you will have a completely functioning game on your phone that you will be able to play yourself or share with your friends. Not only that, but you will have picked up enough knowledge on the way to create many more Android games of your own.\n\nThe book takes you through the whole process from start to finish including installing the software, creating sounds and images, adding timers, adding scores and lives, and ultimately how to download the game to your phone or share it with your friends.\n","torrent":{"xt":"urn:btih:08919e046e9a225d47fe7285e0fb5869f02487ae","amp;dn":"Create+Your+First+Android+Game+Step+By+Step+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08919e046e9a225d47fe7285e0fb5869f02487ae","infoHashBuffer":{"type":"Buffer","data":[8,145,158,4,110,154,34,93,71,254,114,133,224,251,88,105,240,36,135,174]},"announce":[],"urlList":[]}}