{"title":"Paul McCartney - Spies Like Us (2nafish)","uid":5977486,"size":156043268,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:09302689ac5622ade1c62fba4c5e3508291516f4&amp;dn=Paul+McCartney+-+Spies+Like+Us+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1290485429,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Spies Like Us&quot; is the title song to the 1985 Warner Bros. motion picture of the same name, starring Chevy Chase, Dan Aykroyd and Donna Dixon. It was written and performed by Paul McCartney, and was a top-ten hit in the United States in early 1986, reaching #7 on the singles chart, making it McCartney's final top-10 hit in the U.S. to date.\n\nMultiple releases were issued in the UK: a regular 7&quot; single, a 7&quot; shaped picture disc, a regular 12&quot; single featuring extended mixes and the B-side &quot;My Carnival&quot; (a song by Wings from the Venus and Mars session) and a 12&quot; picture disc.\n\nThe minute-long outro is uptempo and features Linda singing &quot;spies like us&quot; repeatedly. When the movie Spies Like Us hit the theaters, producers opted to play the outro first in the closing credits before playing the entire song.\n\nCritics[who?] derided the song for its trite lyrics, purists[who?] for the supposed &quot;sell-out&quot; nature of the song so directly tied to a movie.\n\nThe video for the song, directed by John Landis (who also directed the movie), was banned by the BBC because Dan Aykroyd and Chevy Chase appeared in it playing instruments.labour rules prohibit non-musicians from performing in videos; however, Aykroyd was a proficient harmonica player in the Blues Brothers, and Chase was an accomplished pianist.\n\n&quot;Spies Like Us&quot; was released on CD in 1993, as part of the release of The Paul McCartney Collection, as a bonus track on the album Press to Play. The B-side, &quot;My Carnival&quot;, was released as a bonus track on Venus and Mars, and the 12&quot; single was an exclusive to iTunes.\n\nMcCartney, the song, and its associated film were all referenced in the Self song &quot;Out With a Bang&quot;.\n\nSpies Like Us is a 1985 American comedy film directed by John Landis, starring Chevy Chase, Dan Aykroyd, Steve Forrest, and Donna Dixon. The film presents the comic adventures of two novice intelligence agents sent to the Soviet Union.\n\nPress to Play is the 6th solo studio album by Paul McCartney released in 1986. It is notable for being his first album of entirely new music since 1983's Pipes of Peace and his first album released internationally by long-time label EMI after a brief alliance with Columbia Records in the United States and Canada. Largely due to its experimental nature, some listeners and critics regard the album as one of McCartney's finest solo efforts, while others regard it as one of his worst.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:09302689ac5622ade1c62fba4c5e3508291516f4","amp;dn":"Paul+McCartney+-+Spies+Like+Us+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09302689ac5622ade1c62fba4c5e3508291516f4","infoHashBuffer":{"type":"Buffer","data":[9,48,38,137,172,86,34,173,225,198,47,186,76,94,53,8,41,21,22,244]},"announce":[],"urlList":[]}}