{"title":"MARY BRYANT 2005 DD2.0 Retail PAL --TBS","uid":6482322,"size":8468630177,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:0950c046ae50284b00eabf41efb45c682803fa50&amp;dn=MARY+BRYANT+2005+DD2.0+Retail+PAL+--TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Saggin","files":-1,"time":1308577567,"description":"MARY BRYANT 2005 DD2.0 Retail PAL\n\n\nAustraliÃƒÂ« / Verenigd Koninkrijk\nDrama\n185 minuten (miniserie, 2 delen)\n\ngeregisseerd door Peter Andrikidis\nmet Romola Garai, Jack Davenport en Alex O'Loughlin\n\n\n\nAan het eind van de achttiende eeuw werden duizenden veroordeelde misdadigers naar de Britse strafkolonie Botany Bay\nin AustraliÃƒÂ« gedeporteerd.\nSlechts ÃƒÂ©ÃƒÂ©n van hen heeft ooit de moed gehad om een succesvolle ontsnapping op touw te zetten.\nDit is haar inspirerende, waargebeurde verhaal.\nEngeland, 1786. De 21-jarige Mary kent de criminele onderklasse als haar broekzak en weet dat je soms risico's moet nemen om dat leven achter je te laten.\nNadat ze is gearresteerd voor diefstal, moet ze haar straf uitzitten in een strafkolonie in het primitieve Botany Bay in AustraliÃƒÂ«.\nTijdens de 251 dagen durende reis bevalt Mary op het gevangenisschip van een dochtertje en in de kolonie trouwt ze met medegevangene William Bryant, een visser en drugs smokkelaar.\nSamen dromen ze ervan om te ontsnappen.\nSamen met de hulp van haar man en vijf andere gevangenen steelt Mary een kotter die toebehoort aan gouverneur Arthur Phillip en met haar gezin weet ze te ontsnappen naar Nederlands Timor; een reis vol ontberingen die tien weken duurt.\nMary's bijzondere moed wordt daar opnieuw op de proef gesteld in een vrijheidsstrijd op leven en dood; als ze terug moet naar Botany Bay, eindigt ze aan de galg.\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/35200&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/35200&lt;/a&gt;\n\nAustralia / United Kingdom\ndrama\n185 minutes (mini-series, 2 parts)\n\ndirected by Peter Andrikidis\nwith Romola Garai, Jack Davenport and Alex O'Loughlin\n\n\nAt the end of the eighteenth century, thousands of convicted criminals to\nBritish penal colony of Botany Bay Australia deported.\nOnly one of them has ever had the courage to launch a successful escape\nput.\nThis is her inspiring true story.\nEngland, 1786. The 21-year-old Mary knows the criminal underclass as her pocket and know sometimes you must take risks to life behind you.\nAfter she was arrested for theft, to her sentence in a penal colony\nprimitive in Botany Bay in Australia.\nDuring the 251 day journey, like Mary the daughter of a prison ship and\nin the colony she married fellow inmate William Bryant, a fisherman and drug smuggler.\nTogether they dream of it to escape.\nTogether with the help of her husband and five other prisoners who steals Mary a cutter belongs to Governor Arthur Phillip and her family knows how to escape to\nDutch Timor, a journey full of hardship, which lasts ten weeks.\nMary's special kind of courage is there again to the test in a freedom struggle\nlife and death, when she must return to Botany Bay, she ends on the gallows.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0428134&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0428134&lt;/a&gt;\n\n\nSpotinformatie\n\nSource            : Retail\nBeeldverhouding   : 4:3\nFramerate         : 25,000 fps\nStandaard         : PAL\nAudio             : Engels DD2.0\nSubtitles         : Dutch \nCover             : Ja\n\n\n\n \n","torrent":{"xt":"urn:btih:0950c046ae50284b00eabf41efb45c682803fa50","amp;dn":"MARY+BRYANT+2005+DD2.0+Retail+PAL+--TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0950c046ae50284b00eabf41efb45c682803fa50","infoHashBuffer":{"type":"Buffer","data":[9,80,192,70,174,80,40,75,0,234,191,65,239,180,92,104,40,3,250,80]},"announce":[],"urlList":[]}}