{"title":"AIG bailout shareholder approval notice","uid":4436876,"size":82317,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:09c942801fb8b36d45ba1b32122b0f4ccaeebcc2&amp;dn=AIG+bailout+shareholder+approval+notice&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"the_Phyrexian","files":-1,"time":1223602876,"description":"AIG bailout shareholder approval notice\n\nThe document presents the notice issued by Edward M. Liddy as Chairman and CEO of \n\nAmerican International Group Inc. to existing AIG shareholders, informing them of \n\nthe consequences of the federal bailout of AIG.\n\nIt informs shareholders of overruling the requirement of their approval for what \n\nwill be done with the bailout funds according to NYSE policy.\n\n\nReceived via email as a shareholder:\n\n(Paraphrase) Under the agreement with the Federal Reserve Bank of New York, the shareholders must approve the issuance of Convertible Participating Serial Preferred Stock. The Preferred Stock will be convertible into Common Stock of AIG following a shareholder meeting to amend AIG&amp;#039;s restated certificate of incorporation.\n\nIn accordance with the NYSE rule providing the exception to the Shareholder Approval Policy requiring shareholder approval prior to issuance of Preferred Stock, the Audit Committee of the Board of Directors of AIG determined that the delay necessary in securing shareholder approval prior to the issuance of the Preferred Stock would seriously jeopardize the financial viability of AIG. The Audit Committee has expressly approved AIG&amp;#039;s decision not to seek shareholder approval.\n\n\nPlease leave a comment if you want, this is just to show what is out there...\n\nAnd before you go and spam, dl it watch it and make up your own mind...\n\ncheers the_phyrexian\n","torrent":{"xt":"urn:btih:09c942801fb8b36d45ba1b32122b0f4ccaeebcc2","amp;dn":"AIG+bailout+shareholder+approval+notice","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09c942801fb8b36d45ba1b32122b0f4ccaeebcc2","infoHashBuffer":{"type":"Buffer","data":[9,201,66,128,31,184,179,109,69,186,27,50,18,43,15,76,202,238,188,194]},"announce":[],"urlList":[]}}