{"title":"The Big Red One","uid":10400405,"size":2025563571,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0a2037980a7ebd382b9a1b852ea01b78e25d4508&amp;dn=The+Big+Red+One+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"strawberry5","files":-1,"time":1403356580,"description":"The Big Red One \n\nIMDB:\nThis review is on the &quot;reconstructed&quot; DVD, a version that came out several years ago, adding 49 minutes to the original 1980 movie. (The film runs 162 minutes, not 158 as stated on the IMDb title page.) \n\nThe &quot;old&quot; version was very good, and this newer version makes the film even better. Either way, you have a solid war movie.\n\nFor men - and that's who will primarily watch this movie because it's a guy's flick with no romance and no women leads - this keeps the action coming, but without overdoing it. You can different kinds of action scenes, too, not just people shooting at one another.\n\nI also appreciated the photography. It's a good visual movie. The added footage looked sharper and clearer than the previously shown, but either way it was nicely filmed and directed. Of course, the director is the famous Sam Fuller, who did a number of tough film noirs, among other things.\n\nSpeaking of tough, the person who makes this movie a notch above average is Lee Marvin. He is just excellent as the tough-on-the-outside-but-soft-hearted underneath commanding officer, known only as &quot;The Sergeant.&quot; With his deep voice and weathered face, Marvin makes for an effective leader of tough guys. The language was much milder in here than you find in more modern films, although it can be crude in a few spots. There are no f-words and about seven usages of the Lord's name in vain. However, there are a number of sexual references, some crude but, hey, that's &quot;guy talk.&quot; All the young soldiers were good, too. It was especially interesting to see baby-faced Star Wars' star, Mark Hamill, playing one of the soldiers in the unit called &quot;The Big Red One.&quot;\n\nThe story with narration by one of the soldiers, tells of Marvin and his handful of men who travel and do battle from North Africa to Sicily, then Italy, the beaches of Normandy on D- Day and into Germany in addition to a few other memorable stops such as &quot;an insane asylum.&quot;\n\nIt's long, but I never found it boring and the men never stay too long in one spot.","torrent":{"xt":"urn:btih:0a2037980a7ebd382b9a1b852ea01b78e25d4508","amp;dn":"The+Big+Red+One+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a2037980a7ebd382b9a1b852ea01b78e25d4508","infoHashBuffer":{"type":"Buffer","data":[10,32,55,152,10,126,189,56,43,154,27,133,46,160,27,120,226,93,69,8]},"announce":[],"urlList":[]}}