{"title":"Black Zoo (1963) 88 min.Suspense,Michael Gough.DVDRip.mkv","uid":7388046,"size":1103031336,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0ac648dea7e6b11d110862e17bcca621ce293034&amp;dn=Black+Zoo+%281963%29+88+min.Suspense%2CMichael+Gough.DVDRip.mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":-1,"time":1340696618,"description":"Gough plays Michael Conrad the owner of Conrad's Animal Kingdom and one man accustomed to getting his way in life. Seems to also have quite a good relationship with his zoo pals, especially the big cats: a lion, a lioness, a pair of cheetahs, a tiger, a black panther, and also a fake looking gorilla(George Barrows AGAIN!). Gough plays organ music to his animal friends in his living room, belongs to a cult group of animal worshipers, and uses his friends to kill any personages that get in his way. To say Gough overacts is an incredible understatement. He bellows his lines with ferocity in scenes that do not need such vigour, but he is always fun toThe film is really very interesting as the cats are real and they have been trained very nicely. The acting, aside from Gough, is uniformly good with a nice performance turned in by Rod Lauren(The Crawling Hand) as a mute assistant forced to aid Gough. Jeane Cooper is lovely and does well as Gough's wife, and the character acting of Elisha Cook, Ed Platt, Virginia Grey, and Jerome Cowan all enhance the film. Make no mistake though, even though he wildly overacts, Gough is the film's main attraction. You have to look a ways to find a more over-the-top performance and a bigger slice of ham! The film also boats a wonderful scene where a tiger gets buried. Amidst the swirling fogs and moody backdrops, Gough, with mute assistant and wife, gives a eulogy before all the big cats. Effectively eerie. ","torrent":{"xt":"urn:btih:0ac648dea7e6b11d110862e17bcca621ce293034","amp;dn":"Black+Zoo+%281963%29+88+min.Suspense%2CMichael+Gough.DVDRip.mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ac648dea7e6b11d110862e17bcca621ce293034","infoHashBuffer":{"type":"Buffer","data":[10,198,72,222,167,230,177,29,17,8,98,225,123,204,166,33,206,41,48,52]},"announce":[],"urlList":[]}}