{"title":"Nanoparticulates as Drug Carriers - Vladimir Torchilin","uid":15346577,"size":59597043,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0bb30fecdbbf8c1a4e4dd3d59e2b6e2a100bd132&amp;dn=Nanoparticulates+as+Drug+Carriers+-+Vladimir+Torchilin&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1468884100,"description":"Nanoparticulates as Drug Carriers - Vladimir Torchilin (ICP, 2006).pdf\r\n\r\nISBN 1-86094-630-5\r\n\r\nWritten by key experts in the field of nanomedicine, this book provides a broad introduction to the important field of nanomedicine and application of nanotechnology for drug delivery. It covers up-to-date information regarding various nanoparticulate drug delivery systems, describes the various opportunities for the application of nanoparticular drug carriers in different areas of clinical medicine, and analyzes already available information on their clinical applications. This book can be used as an advanced textbook by graduate students and young scientists and clinicians at the early stages of their career. It is also suitable for non-experts from related areas of chemistry, biochemistry, molecular biology, biomedical engineering, physiology, experimental and clinical medicine, and pharmaceutical sciences, who are interested in general problems of drug delivery and drug targeting, as well as in more specialized topics of using nanoparticulate-mediated drug delivery approaches in the individual areas of clinical medicine. Prof Torchilin is an expert in Nanomedicine and a recipient of numerous awards including the Lenin Prize in Science &amp; Technology of the former USSR, membership in the European Academy of Sciences, and AAPS Research Achievement Award in Pharmaceutics and Drug Delivery. He served as an Associate Professor of Radiology at Harvard Medical School before joining Northeastern University as the Chairman of the Department of Pharmaceutical Sciences","torrent":{"xt":"urn:btih:0bb30fecdbbf8c1a4e4dd3d59e2b6e2a100bd132","amp;dn":"Nanoparticulates+as+Drug+Carriers+-+Vladimir+Torchilin","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0bb30fecdbbf8c1a4e4dd3d59e2b6e2a100bd132","infoHashBuffer":{"type":"Buffer","data":[11,179,15,236,219,191,140,26,78,77,211,213,158,43,110,42,16,11,209,50]},"announce":[],"urlList":[]}}