{"title":"Spider-Man 3(2007)DVDRip.AC3(ENG)-DROCK","uid":6683020,"size":734366845,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0c12438b04dbc5cfff62999fd393df2810686b91&amp;dn=Spider-Man+3%282007%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drock232","files":1,"time":1316278273,"description":"Your friendly neighborhood web-slinger is back, only this time his sunny outlook has become partially overcast in the third chapter of director Sam Raimi's Spider-Man saga. Tobey Maguire, Kirsten Dunst, and James Franco return to reprise their roles from the previous two installments, with Thomas Haden Church, Topher Grace, and Bryce Dallas Howard making their first appearances in the series as Flint Marko (aka Sandman), Eddie Brock (aka Venom), and Gwen Stacy, respectively. Peter Parker (Maguire) has finally leaned to walk the middle ground between being the superhero that his city needs and the man that Mary Jane (Dunst) loves. All is well in New York City until one night, as Peter and M.J. sit gazing at the stars, a falling comet streams across the sky and crashes into the ground close by. But this isn't any ordinary shooting star, and upon impact the mysterious space rock is split open to reveal a shape-shifting symbiote with the power to overtake anything that it comes into contact with. Later, as Harry Osborn (James Franco) acquires his late father's flying board, engineers a powerful new Goblin outfit, and takes to the sky to avenge dad's death, the mysterious space sludge infects both Peter's Spider-Man suit and ambitious street photographer Eddie Brock (Grace). Peter's strange new suit gives him a newfound sense of power as it gradually overpowers his personality, and he discovers that escaped convict Flint Marko was in fact the man responsible for the death of Uncle Ben (Cliff Robertson). Unfortunately for Peter, Marko has recently acquired the power to morph at will and quickly completes his transformation into the dreaded Sandman. As the Sandman gives in to his darkest criminal instincts and the slithering space symbiote transforms Eddie Brock into the nightmarish fanged villain known as Venom, the citizens of New York City must once again call on Spider-Man to fend off destructive forces that are far too powerful for the likes of mortal man.\n\nRipped with Handbrake.\n\nLength: 2 Hours 19 Minutes\n\nFile Type: MP4\n\nFrame Width: 720\n\nFrame Height: 400\n\nFrame Rate: 23fps\n\nAudio\n\nBit Rate: 159kbps","torrent":{"xt":"urn:btih:0c12438b04dbc5cfff62999fd393df2810686b91","amp;dn":"Spider-Man+3%282007%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c12438b04dbc5cfff62999fd393df2810686b91","infoHashBuffer":{"type":"Buffer","data":[12,18,67,139,4,219,197,207,255,98,153,159,211,147,223,40,16,104,107,145]},"announce":[],"urlList":[]}}