{"title":"60's psychedelic garage mix 3 cheers chrisgoes","uid":3417231,"size":58114568,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0c8d7beb2ab54bd6c92e7812b4a82886b4856241&amp;dn=60%5C%27s+psychedelic+garage+mix+3+cheers+chrisgoes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bluejam15","files":2,"time":1133694897,"description":"I've been downloading Chrisgoes's superb torrents for nearly a year now, and thanks to all the great garage tracks he has supplied I have put together a few garage mixes. I have made the mix using mixmeister pro,and although 85% happy with it would like to tweak it more.If anyone could recommend another mixing program, please advise.\n\n If people would like the individual tacks i may upload, but do not want to step on Chrisgoes territory.\n\nThis mix (along with others) were designed as a DJ set for The Skull club venue, tamworth, England. (next one due to take place 18th Jan 2006)\n\nWhat has took me so long is that I supplied a vJ set - this music forms a background to it. \n\nThe VJ set splits this mix into 2 avi files. The video samples include, club scene from coogans bluff, pink floyd in london, how to roll a joint, pink flamingoes, barbarella, batman 1966, blow up, vampyros lesbos, get carter, the prisoner, tHe trip and Psych out. This i am particulay proud of,and again thanks to all the dowloads from Pirate bay.\n\nIf people are interested in the avi files let me know so i can upload\n\nI am busy creating another vj set and more mixes for next skull club. \nIf anyone has any psych dvds they could recommend(plus links) or tunes let  me know, and i will try to put in.\n \nAlso is anyone out there looking to set up an online radio station which may include tunes such as above, or are you hosting a psychedelic night where a couple of the skull club dj's could do a set for you please advise.  \n\nAny comments appriciated..Long live chrisgoes.\n\nBluejam15\n","torrent":{"xt":"urn:btih:0c8d7beb2ab54bd6c92e7812b4a82886b4856241","amp;dn":"60%5C%27s+psychedelic+garage+mix+3+cheers+chrisgoes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c8d7beb2ab54bd6c92e7812b4a82886b4856241","infoHashBuffer":{"type":"Buffer","data":[12,141,123,235,42,181,75,214,201,46,120,18,180,168,40,134,180,133,98,65]},"announce":[],"urlList":[]}}