{"title":"Big.Brother.Australia.AU.Series5.Disc1.Days.01a-24b","uid":9225106,"size":8485912933,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0dc7d82892e31cbb94ced8eb474330afb110ca11&amp;dn=Big.Brother.Australia.AU.Series5.Disc1.Days.01a-24b&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"xgimpyx","files":37,"time":1384998315,"description":"Okay here we go as promised!\nI will try and let you know how I'm going about these uploads. First of all I have all series archived on 8GB dual layer dvd disc's so that is how I will post all of the series. Next I have changed my mind on the order I'm posting them, however, I do plan to post all of the series so you can either wait for them all and then choose your order to watch or watch them as they are posted. Most series have a small look back at previous winners on launch night so I will try and give you the time stamps to avoid if you are watching out of order. I CAN'T GUARANTEE YOU WON'T HAVE A SPOILER SOMEWHERE THAT I FAIL TO CATCH! \n\nNow regarding the order I'm posting them. I see series 9 is still active on TPB so I will be posting 1-8 only and also Celebrity BBAU which if my memory is correct aired right after series 2. ALWAYS READ THIS INFO SECTION BEFORE DOWNLOADING EACH DISC IN CASE THERE IS SOMETHING YOU NEED TO KNOW REGARDING THAT DISC BEFORE WATCHING! Many of the comments were wanting series 6 first because of the &quot;Turkey Slap&quot; incident which started the problems for BBAU. As you see I'm starting with series 5 first and will then do 6 for a couple of reasons. Series 5 was when Friday Night Live was introduced which I personally loved. It also had what I think was slightly better housemates than 6 and will probably be more beneficial to watch 5 before 6 so everything blends together better. So I'm doing 5-6-7-8 then I'm going backwards and doing 4-3-2-1-CBB. My favorites were series 3 then 5\nand then 7. That's why I'm putting 3 farther down the list so you will have a really good series to look forward to if you start getting BBAU overload.\n\nPLEASE, PLEASE, PLEASE, try and seed at least to a ratio of 1:1 and as much more as you possibly can. I need all the help I can get so that I can keep moving on to new discs. Since I always seed to a ratio of between 8 and 10 to 1, once I move on to the next disc I won't go back so please do your part! If after a series or two it doesn't seem as if enough people are helping seed then I may have to decide if it's worth continuing. \n\nNow for series 5 specifics. \nSeries 5 will be 5 discs. No shows aired on Saturdays and are marked with notepad documents for those days so you don't think episodes are missing. For people new to BBAU in the past couple of years this series as well as all series 1-7 are hosted by Gretel Killeen. She was the face of BBAU and I hated to see her go. Spoilers about previous series are mentioned in the Launch Night Episode 01 from the 01:00 mark until the 04:40 mark and again from the 07:30 mark until the 10:35 mark. As I stated earlier there may be other spoilers besides these.\n\nI hope everyone enjoys these series and if you have any questions or comments please don't hesitate to ask and I will try to check the comments to see if it's something I can answer.\n\n   ","torrent":{"xt":"urn:btih:0dc7d82892e31cbb94ced8eb474330afb110ca11","amp;dn":"Big.Brother.Australia.AU.Series5.Disc1.Days.01a-24b","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0dc7d82892e31cbb94ced8eb474330afb110ca11","infoHashBuffer":{"type":"Buffer","data":[13,199,216,40,146,227,28,187,148,206,216,235,71,67,48,175,177,16,202,17]},"announce":[],"urlList":[]}}