{"title":"Environmentally Compatible Food Packaging - Emo Chiellini","uid":15156630,"size":19392597,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0e8505e41093dffda6ae779f46f522188b813fc1&amp;dn=Environmentally+Compatible+Food+Packaging+-+Emo+Chiellini&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1467308441,"description":"Environmentally Compatible Food Packaging - Emo Chiellini (WP, 2008).pdf\r\n\r\nISBN 978-1-84569-194-3\r\n\r\nFood packaging performs an essential function, but packaging materials can have a negative impact on the environment. This collection reviews bio-based, biodegradable and recycled materials and their current and potential applications for food protection and preservation.\r\n\r\nThe first part of the book looks at the latest advances in bio-based food packaging materials. Part two discusses the factors involved in choosing alternative packaging materials such as consumer preference, measuring the environmental performance of food packaging, eco-design, and the safety and quality of recycled materials. Part three contains chapters on the applications of environmentally-compatible materials in particular product sectors, including the packaging of fresh horticultural produce, dairy products and seafood. This section also covers active packaging, modified atmosphere packaging and biobased intelligent food packaging. The book finishes with a summary of the legislation and certification of environmentally-compatible packaging in the EU.\r\n\r\nWith its distinguished editor and contributors, Environmentally-compatible food packaging is a valuable reference tool for professionals in the food processing and packaging industries.\r\n\r\nReviews bio-based, biodegradable and recycled materials and their current and potential applications\r\nDiscusses consumer preference, environmental performance, eco-design and the quality of recycled materials as factors involved in choosing alternative packaging materials\r\nSummarises EU legislation and certification of environmentally compatible packaging","torrent":{"xt":"urn:btih:0e8505e41093dffda6ae779f46f522188b813fc1","amp;dn":"Environmentally+Compatible+Food+Packaging+-+Emo+Chiellini","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e8505e41093dffda6ae779f46f522188b813fc1","infoHashBuffer":{"type":"Buffer","data":[14,133,5,228,16,147,223,253,166,174,119,159,70,245,34,24,139,129,63,193]},"announce":[],"urlList":[]}}