{"title":"The Rat Pack - Live At The Sands TQMP","uid":4801940,"size":473517752,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0f9fcfe923a3671e0758d22421f86b21e57956f8&amp;dn=The+Rat+Pack+-+Live+At+The+Sands+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zootallure","files":41,"time":1238072982,"description":"The Rat Pack was a group of popular entertainers originally centered on Humphrey Bogart. In the mid-1960s it was the name used by the press and the general public to refer to a group that called itself &quot;the summit&quot; or &quot;the clan,&quot; featuring Frank Sinatra, Dean Martin, Sammy Davis, Jr., Peter Lawford and Joey Bishop, who appeared together on stage and in films in the early-1960s, including the movie Ocean's Eleven.[1] Despite its reputation as a masculine group, the Rat Pack did have female participants, including movie icons Shirley MacLaine, Lauren Bacall, Angie Dickinson, Marilyn Monroe, and Judy Garland.\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at:\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health:-)\n\n","torrent":{"xt":"urn:btih:0f9fcfe923a3671e0758d22421f86b21e57956f8","amp;dn":"The+Rat+Pack+-+Live+At+The+Sands+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f9fcfe923a3671e0758d22421f86b21e57956f8","infoHashBuffer":{"type":"Buffer","data":[15,159,207,233,35,163,103,30,7,88,210,36,33,248,107,33,229,121,86,248]},"announce":[],"urlList":[]}}