{"title":"Easy WIFI Radar 1.0.5v Installer.exe","uid":4725652,"size":2245758,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:100bab0f375734cb2e5feb5f68220021bc460c23&amp;dn=Easy+WIFI+Radar+1.0.5v+Installer.exe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"ps3idwralw","files":1,"time":1234732109,"description":"Some things in life should be free. Easy WiFi Radar helps you find and connect to open wireless access points with a single mouseclick. It's WiFi for Dummies. And we're giving it away for your PC. \n\nIf you have ever tried to use Windows XP's built-in connection manager, you know what a hassle it can be to quickly check your mail or browse the web on the go. You need to browse through a list of access points, find one that you can connect to, manually try to connect to it, confirm the connection and then wait. Even if it says that's it connected, often it doesn't open a webpage or you mail will stall. Easy WiFi Radar automates all of this. It's main goal is to let you get your mail or surf the web without having to go through all of the connection trouble, and without having to pull your creditcard. Just run it and it'll connect you for FREE to the internet. It doesn't get easier than this. \n\nGet your mail and browse the web without being charged. The ideal WiFi-tool for frequent travellers and mobile professionals. Easy WiFi Radar will connect to open hotspots automatically and shows you exactly what it is doing in a cool animated radar screen. Access points are represented as green, yellow or red dots. It plays a sound and opens your webbrowser as soons as it succesfully finds a free connection. Works on Windows XP and Windows Mobile, not on Vista. \n\nenjoy people.","torrent":{"xt":"urn:btih:100bab0f375734cb2e5feb5f68220021bc460c23","amp;dn":"Easy+WIFI+Radar+1.0.5v+Installer.exe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"100bab0f375734cb2e5feb5f68220021bc460c23","infoHashBuffer":{"type":"Buffer","data":[16,11,171,15,55,87,52,203,46,95,235,95,104,34,0,33,188,70,12,35]},"announce":[],"urlList":[]}}