{"title":"Champions (Eclipse, Heroic)","uid":8963729,"size":594097036,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:104dd4ced3efd28226557c82779f3e7f056a4856&amp;dn=Champions+%28Eclipse%2C+Heroic%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Ichthypod_Crane","files":61,"time":1380165899,"description":"\n\nThe ECUP pees on a stick and waits five minutes for the color bands, with 'Champions'!\n\nTwiki says:\n\nChampions is a role-playing game published by Hero Games that is designed to simulate and function in a four-color superhero comic book world. It was created by George MacDonald, Steve Peterson, Bruce Harlick, and Ray Greer.\n\nChampions, first published in 1981, was the first role-playing game in which character generation was based on a point-buy system instead of random dice rolls. A player decides what kind of character to play, and designs the character using a set number of &quot;character points&quot;, often abbreviated as &quot;CP.&quot; The limited number of character points generally defines how powerful the character will be. Points can be used in many ways: to increase personal characteristics, such as strength or intelligence; to buy special skills, such as martial arts or computer programming; or to build superpowers, such as supersonic flight or telepathy. This point system was praised by reviewers for the balance it gave character generation over random dice rolls.\n\nPlayers are required not only to design a hero's powers, but also the hero's skills, disadvantages, and other traits. Thus, Champions characters are built with friends, enemies, and weaknesses, along with powers and abilities with varying scales of character point value for each. This design approach intends to make all the facets of Champions characters balanced in relation to each other regardless of the specific abilities and character features. Characters are rewarded with more character points after each adventure, which are then used to buy more abilities, or eliminate disadvantages.\n\nStarting in June 1986, a comic mini-series was published by Eclipse Comics based on characters from the first Champions campaign. After the initial mini-series a regular series was published by Hero Comics (later Hero Graphics, later still Heroic Publishing). Like the Villains and Vigilantes comic mini-series, the early issues printed character sheets which allowed readers to incorporate characters used in the comic books in their own Champions campaigns. \n\nThis here torrent contains the original Eclipse mini, the later Champions comic published by Heroic AND 13 of the (unverified) 14 issues of a spin-off comic called 'League of Champions'. Why? Can't you see I'm MAD about you, silly fool???\n\nCreators: thank.  Scanners: thank  You: get, seed\n\n\n\nTonight's two-for-one Eclipse is &quot;Destroyer Duck&quot;, written by Steve Gerber and illustrated by Jack 'King' Kirby! It was uploaded by fudoh101 in June 2013 and contains all 7 issues of the series. Find it here:\n &lt;a href=&quot;\nhttps://thepiratebay.se/torrent/8616787/Destroyer_Duck___1-7_(Eclipse_Comics)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/torrent/8616787/Destroyer_Duck___1-7_(Eclipse_Comics)&lt;/a&gt;\n\nAccess it, disperse it!","torrent":{"xt":"urn:btih:104dd4ced3efd28226557c82779f3e7f056a4856","amp;dn":"Champions+%28Eclipse%2C+Heroic%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"104dd4ced3efd28226557c82779f3e7f056a4856","infoHashBuffer":{"type":"Buffer","data":[16,77,212,206,211,239,210,130,38,85,124,130,119,159,62,127,5,106,72,86]},"announce":[],"urlList":[]}}