{"title":"Don't Starve - 2 July - Srange new powers (2-click run)","uid":8641425,"size":125198949,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:12581a0f99fc00ad37f9693909a3e37a9ae27dbf&amp;dn=Don%27t+Starve+-+2+July+-+Srange+new+powers+%282-click+run%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"The_Duck1","files":-1,"time":1372888371,"description":"No need for serials and cracks to get the full version, (already done it for you).\nNo unnecessary registry changes. \nNo boring installation of tool-bars in your browser or other unwanted things.\nYou can even run this torrent from an USB-Stick.\nEasy Uninstall with the Windows control panel.\nChoose where you want to put the files on your PC. \nThese are a few things that makes a '2-click run' version a better version.\n\nIf everybody seeds, you will get higher downloading speeds.\n\nDescription:\nPlay as Wilson, an intrepid Gentleman Scientist who has been trapped by a demon and transported to a mysterious wilderness world. Wilson must learn to exploit his environment and its inhabitants if he ever hopes to escape and find his way back home. Enter a strange and unexplored world full of strange creatures, dangers, and surprises. Gather resources to craft items and structures that match your survival style. Play your way as you unravel the mysteries of this strange land.\n\n================\n===CHANGELOG:===\n================\nNew Character:\nWoodie the Lumberjack\n\nHe's a fun-loving Canadian who spends too much time in the woods. His axe talks to him, and he has a terrible curse.\n\nNew special powers for the unlockable characters:\n\nWillow\n\nGets a sanity bonus from being near fire\nImpervious to fire damage (and probably heat when that becomes a Thing)\nGets a unique lighter that acts as an infinite torch with a very small radius\nHas a lower max sanity\nLights fires at random when her sanity is low\n\nWX-78\nCan eat spoiled food with no penalty\nStarts with very low stats, but can upgrade himself by eating gears.\nTakes damage in the rain, but creates light from the sparks\nCan get hit by lightning, causing a system overload that makes him run faster and glow in the dark\nWes\nHas pathetic, low stats\nCan make balloon animals\nWolfgang\nHas a large stomach\nFaster sanity drain in the dark and near scary things\nGets damage and health bonuses when his belly is full (and penalties when it is empty!)\nWendy\nLower combat damage\nLess afraid of the dark and monsters.\nCarries around Abigail's Flower. When it is charged (it takes a couple of days), a blood sacrifice will summon Abigail!\nAbigail is a lot more useful now, and will last until she falls in battle\nWickerbottom\nGets a bonus tech level\nHas a high max sanity\nCan craft books that can be read to cast powerful magic spells\nInsomniac - can not sleep\nPicky eater - higher penalties for spoiled food\nNew creatures:\nSplumonkeys - Cave-dwelling monkeys that just want to cause you trouble. Nothing is safe from their pestering! Barrels spawn Splumonkeys.\nPengulls - Mostly harmless penguinoids who leap from the ocean in the winter to form rookeries. Be careful if you disrupt their migration!\nNew craftables:\nWe added a new tab for gem-based items, and added amulets and staffs for all of the existing colours. Watch this space for more mind-bending magic in future updates!\n\nRed amulet - resurrects as before, but also converts hunger into health\nBlue amulet - harness the power of cold!\nPurple amulet - Dare to gaze upon the terrifying nightmare world.\nPurple staff - Warp space and time with teleportation!\nMods:\nThere is a new mod configuration screen that lets you activate/deactivate mods from within the game. Check out the modding forum for details!\n\nWorld Generation\n\nWhen tree generation is set to more then lumpy trees can be generated in normal forests.\nRoads are wider and turn back on themselves less.\nItems\nGold, Fireflies and flames shine with a redish, gold glow.\n\nInstallation instructions:\n1. Execute the Dont Starve - 2 July - Srange new powers (2-click run).exe file.\n2. Click next.\n3. Enjoy the program.","torrent":{"xt":"urn:btih:12581a0f99fc00ad37f9693909a3e37a9ae27dbf","amp;dn":"Don%27t+Starve+-+2+July+-+Srange+new+powers+%282-click+run%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12581a0f99fc00ad37f9693909a3e37a9ae27dbf","infoHashBuffer":{"type":"Buffer","data":[18,88,26,15,153,252,0,173,55,249,105,57,9,163,227,122,154,226,125,191]},"announce":[],"urlList":[]}}