{"title":"God Mode","uid":9283980,"size":1887399154,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1292117b2b6186a2e2007e1a4de8f7a0a722a2e1&amp;dn=God+Mode&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"anuJXD","files":2,"time":1385979290,"description":"Year: 2013 \nGenre: Action (Shooter) / 3D / 3rd Person \nDeveloper: Saber Interactive and Old School Games \nPublishing House: Atlus \nLanguage: English/Multi\n\nPublication Type: Licence \nPlatform: PC \nDescription: Like it quickly run and shoot straight? Use an arsenal of different kinds of skills? Play with friends (up to 4 players on one card)? And dozens of enemies, where you can unleash your firepower, and obtained for the destruction of opponents gold and experience points to spend on a new, even more deadly equipment ... If everything described pleases your ears - so you just like God Mode.\nThis new third-person shooter combines the best elements of retro shooters and role-playing games. God Mode combines non-linear gameplay, a hurricane fire, hordes of enemies, a full-fledged co-op mode for four players and excellent graphics and music surrounding. You will not be bored - there are dozens of in-game modifiers allow you to change the gameplay literally &quot;on the fly.&quot; It offers - characters, appearance and equipment are modified according to your wishes. And earned in battles experience points and gold will help open new deadly weapons and unique abilities - and improve them!\n\nFeatures Repack:\n* Co-op game mode up to 4 people (with special PvP-Zones) \n* New, improve weapons and abilities, that can be opened for gold and experience points \n* Highly customizable characters appearance \n* Dozens of test of faith (in-game modifiers) and dynamically changing gameplay\n\n** Language of the game depends on the language of the installer (do not forget to turn the subtitles on the game settings)**","torrent":{"xt":"urn:btih:1292117b2b6186a2e2007e1a4de8f7a0a722a2e1","amp;dn":"God+Mode","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1292117b2b6186a2e2007e1a4de8f7a0a722a2e1","infoHashBuffer":{"type":"Buffer","data":[18,146,17,123,43,97,134,162,226,0,126,26,77,232,247,160,167,34,162,225]},"announce":[],"urlList":[]}}