{"title":"Thomas Eakins and The Metropolitan Museum of Art (Art Ebook).pdf","uid":8813714,"size":11867080,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:134ecb9d5c8aaeddbfdfe49255ba2009fce8a12c&amp;dn=Thomas+Eakins+and+The+Metropolitan+Museum+of+Art+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"STBGD","files":-1,"time":1376525573,"description":"Weinberg, H. Barbara, &quot;Thomas Eakins and The Metropolitan Museum of Art&quot;\nPublisher: The Metropolitan Museum of Art | 1994 | ISBN: N/A | ASIN: B000QA2MLE | English | PDF | 56 pages | 11.32 Mb\n\nLittle appreciated in his lifetime, Thomas Eakins is today recognized as one of America's finest painters, a respected sculptor and photographer, and an influential art teacher. This Bulletin accompanies an exhibition of his oil paintings, watercolors, and drawings owned by the Museum and a selection of our holdings of photographs associated with him and his circle.\n\nLike the exhibition, this Bulletin honors the sesquicentennial of Eakins's birth in Philadelphia in 1844 and the Museum's early and continuing interest in his work. Eakins's The Chess Players, of 1876, presented by the artist to the Metropolitan in March 1881, was only the second painting by him to enter a museum's collection. Two months before Eakins's death in 1916, the Metropolitan's curator of paintings, Bryson Burroughs, bought his Pushing for Rail, of 1874, for the Museum and the following year organized a memorial exhibition with the help of his widow. This one-month display, which maintained the Museum's pattern of commemorating American painters, opened in November 1917. It provided the first overview of Eakins's achievements as a painter and the model for the ensuing memorial exhibition at the Pennsylvania Academy of the Fine Arts, an institution with which he had a more extensive connection.\n\nBurroughs also arranged for the Metropolitan to buy two canvases from the memorial exhibition, furthering the growth of one of the most important collections of Eakins's paintings. Our oils by Eakins, exhaustively documented by Natalie Spassky in American Paintings in the Metropolitan Museum of Art, Volume II (1985), articulate his development and include several that are considered among his most significant. Perspicacious purchases and generous gifts have also made the Metropolitan a leading repository of Eakins's watercolors; we possess seven of his twenty-eight known works in the medium. Photographs, which the Museum began to acquire in 1941, enrich Eakins's representation at the Metropolitan.","torrent":{"xt":"urn:btih:134ecb9d5c8aaeddbfdfe49255ba2009fce8a12c","amp;dn":"Thomas+Eakins+and+The+Metropolitan+Museum+of+Art+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"134ecb9d5c8aaeddbfdfe49255ba2009fce8a12c","infoHashBuffer":{"type":"Buffer","data":[19,78,203,157,92,138,174,221,191,223,228,146,85,186,32,9,252,232,161,44]},"announce":[],"urlList":[]}}