{"title":"Guitar Hero III: Legends of Rock [k'ed] MAC v1.3","uid":4436620,"size":6826061163,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:13fb5b0bc5588bd1e455b36371eba8f31b0d3c15&amp;dn=Guitar+Hero+III%3A+Legends+of+Rock+%5Bk%5C%27ed%5D+MAC+v1.3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Nadav_Peretz","files":-1,"time":1223587164,"description":"---------------------------------\n\nNOTE: [K] FIX IS AVAILABLE HERE:\nhttp://thepiratebay.se/torrent/4440967/Guitar_Hero_III__Legends_of_Rock_%5Bk%5D_FIX_v1.3\n\n---------------------------------\n\nGuitar Hero III: Legends of Rock is a music video game developed by Neversoft published by Activision and RedOctane. It is the third full installment in the Guitar Hero series, and the fourth title overall. Guitar Hero III was first released for the PlayStation 3 and Xbox 360, with the PlayStation 2 version developed through Budcat Creations and the Wii version through Vicarious Visions. Aspyr Media assisted in porting the game to the PC, and Mac platforms in late 2007. Due to the acquisition of RedOctane by Activision, Harmonix Music Systems is no longer involved in developing titles in the Guitar Hero series; instead, they developed the competing Rock Band.\n\nGuitar Hero III: Legends of Rock retains the same gameplay as the other games in the series. The player uses a special guitar-shaped controller to simulate the playing of rock music by playing in-time to scrolling notes on-screen. Guitar Hero III includes a new cooperative career mode and &quot;Boss Battles&quot; against both in-game characters and other players; the game is also the first in the series to allow for online play for the Xbox 360, PlayStation 3, and Wii versions. The game features over 70 total songs shipped on disk, many of which, in contrast to previous games, are master tracks. The Xbox 360 and PlayStation 3 versions also feature the ability to download additional songs. Several musicians appear in Guitar Hero 3, including Tom Morello (of the bands Rage Against the Machine and Audioslave) and Slash (of the bands Guns N' Roses and Velvet Revolver) as in-game characters. The PC, PlayStation 3, and Xbox 360 versions also include Bret Michaels (of the band Poison). \n\nPlease read the attached Instructions.txt for further information\n\n\n---------------------------------\n\nNOTE: [K] FIX IS AVAILABLE HERE:\nhttp://thepiratebay.se/torrent/4440967/Guitar_Hero_III__Legends_of_Rock_%5Bk%5D_FIX_v1.3\n\n---------------------------------","torrent":{"xt":"urn:btih:13fb5b0bc5588bd1e455b36371eba8f31b0d3c15","amp;dn":"Guitar+Hero+III%3A+Legends+of+Rock+%5Bk%5C%27ed%5D+MAC+v1.3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13fb5b0bc5588bd1e455b36371eba8f31b0d3c15","infoHashBuffer":{"type":"Buffer","data":[19,251,91,11,197,88,139,209,228,85,179,99,113,235,168,243,27,13,60,21]},"announce":[],"urlList":[]}}