{"title":"TMS - Astronomy I - Earth, Sky, and Planets","uid":6587541,"size":118281349,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:140e7be8f190d1c45c453a5f09057e37e9e1ecc8&amp;dn=TMS+-+Astronomy+I+-+Earth%2C+Sky%2C+and+Planets&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"programa","files":15,"time":1312672289,"description":"TMS - Astronomy I: Earth, Sky and Planets\nby James Kaler\n\nFormat: MP3\nBitrate: 32 Kbps\n\n\nThe Earth, the sun and moon, the planets, comets, asteroids and meteors-the solar system is all around us, yet how much do we truly know about it? When we explore the Earth and the layout of the sky, what can we learn about the meanings of the day, the year, the seasons, and the constellations? Which physical laws control what we see, and what are the natures of the celestial bodies? Professor James Kaler-a former Fulbright and Guggenheim Fellow and author of many acclaimed books on astronomy-answers these questions, taking us on a fascinating and informative voyage through the Solar System.\n\nThe heart of this course examines the planets themselves, and reveals how they are constructed and how they differ from one another. By studying the physical astronomy of all the planets in the Solar System, we can attempt to understand their true nature. Ultimately, these lectures will bring us to a greater understanding of the Solar System's creation, which brings us again back to the beginning and what it means to us as we look outward from our rotating Earth.\n\nProfessor James B. Kaler is Professor Emeritus of Astronomy at the University of Illinois at Urbana-Champaign. He received his B.A. in Astronomy from the University of Michigan in 1960 and his Ph.D. from UCLA in 1964. He has been at Illinois ever since. His research area, in which he has published over 120 papers, involves dying stars, specifically the graceful shells and rings of gas ejected in stellar death called ''planetary nebulae.'' He has held both Fulbright and Guggenheim Fellowships, and has been awarded medals for his work from the University of LiÃƒÂ©ge, in Belgium, and from the University of Mexico. He currently serves on the Board of Directors of the Astronomical Society of the Pacific.\n\n14 Lectures\n30 minutes/lecture\n\n1 We and the Universe\n2 Reflections of the Spinning Earth\n3 Sun and Seasons\n4 Stories in the Sky: Constellations\n5 Romance of the Moon\n6 Happy Wanderers: The Planets\n7 Keeping It All Together\n8 Reaching Outward\n9 Our Domain: Earth and the Moon\n10 Iron Planets: Mercury, Venus, and Mars\n11 Monsters of the Midway: Jupiter and Saturn\n12 Distant Outposts: Uranus, Neptune, and Pluto\n13 Leftovers of Creation: Comets, Asteroids, and Meteors\n14 Creation\n","torrent":{"xt":"urn:btih:140e7be8f190d1c45c453a5f09057e37e9e1ecc8","amp;dn":"TMS+-+Astronomy+I+-+Earth%2C+Sky%2C+and+Planets","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"140e7be8f190d1c45c453a5f09057e37e9e1ecc8","infoHashBuffer":{"type":"Buffer","data":[20,14,123,232,241,144,209,196,92,69,58,95,9,5,126,55,233,225,236,200]},"announce":[],"urlList":[]}}