{"title":"Jos Brink - Rouw op je dak, NL Ebook(ePub).DMT","uid":6649491,"size":807462,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1441dc871c964498b4a1372a4e1213bab3d53554&amp;dn=Jos+Brink+-+Rouw+op+je+dak%2C+NL+Ebook%28ePub%29.DMT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Falco_bis","files":-1,"time":1315079396,"description":"Jos Brink - Rouw op je dak, NL Ebook(ePub).DMT\n\n\n\nAuteur: Jos Brink\npagina's: 93\nUitgever: Lannoo\njaar van uitgifte: 2007\n\n\n\nBeschrijving\n\nRouwen betekent een moeilijke weg gaan: je weet dat je kunt lopen. maar je wilt eigenlijk niet verder. Er ligt een onoverzichtelijk traject voor je. Een rouwproces geeft uitdrukking aan pijn en verdriet, twee grote emoties die onlosmakelijk aan elkaar zijn verbonden. Het is een weg die je toch moet gaan.\nNaar een horizon waar hemel en aarde wellicht weer bij elkaar komenRouwen is een proces van heling, het uiteindelijk accepteren van wat onvermijdelijk bleek. Er zijn vooralsnog alleen maarverliezers en je hebt geen enkel uitzicht op winst. Wat jou is overkomen, is de meest traumatische ervaring die mensen kunnen hebben. En er is niemand die echt weet en kan meevoelen wat jij voelt, omdat geen twee mensen gelijk zijn, ook al hebben zij hetzelfde te doorstaan. Jouw verdriet is uniek.Hoe groei je door je pijn heen? En kan dat? Hoe ga je om\nmet je woede? En wat is berusting?In dit eerlijke boek probeert Jos Brink, pastor en stervensbegeleider, maar ook theatermaker (en dus een mensen-mens) geen gemakkelijke antwoorden te geven op alle vragen die je hebt.\nWel herkent hij, vanuit zijn lange ervaring, jouw situatie. Hij kan je wellicht richting geven, een beetje sturen, waardoor eenzaamheid weer in tweezaamheid verandert. Dat wat de auteur zelf, en samen met anderen, heeft meegemaakt,\nvormt de basis van Rouw op je dak, bepaald niet alleen geschreven voor mensen die leven vanuit een religieuze optiek: wie je ook bent, waar je ook bij wilt horen, verdriet is verdriet.Jos Brink legt je in dit boek geen waarheden op, maar probeert met je mee te gaan. Niet om je te dragen, want dat kan niet. Maar misschien kan hij jou wel weer leren lopen\n[\n\n\nDit boek wordt u aangeboden door:\n\nDUTCH MOVIE THEATER","torrent":{"xt":"urn:btih:1441dc871c964498b4a1372a4e1213bab3d53554","amp;dn":"Jos+Brink+-+Rouw+op+je+dak%2C+NL+Ebook%28ePub%29.DMT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1441dc871c964498b4a1372a4e1213bab3d53554","infoHashBuffer":{"type":"Buffer","data":[20,65,220,135,28,150,68,152,180,161,55,42,78,18,19,186,179,213,53,84]},"announce":[],"urlList":[]}}