{"title":"Richmond Lattimore, trans. - The New Testament (pdf)","uid":8535189,"size":4664697,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1483202e3720b110994dd2e373181a3d8440e2c6&amp;dn=Richmond+Lattimore%2C+trans.+-+The+New+Testament+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmakate","files":-1,"time":1370251986,"description":"Richmond Lattimore, translator - The New Testament (North Point Press, 1996). 586 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\nThis is a very good translation of the New Testament by a translator best known for his versions of Homer. Lattimore's NT is literal, literary and modern all at once.\n\nAnother good thing about this edition is that the page layout is classy and very restrained: no chapter and verse numbers in the text, no notes or other junk to get in the way. Just the biblical text itself. Nice.\n\nThe only thing that makes no sense to me is that they decided to put Mark before Matthew -- but they made no effort to re-arrange any other books chronologically.\n\nAnd yes, that front cover is pretty damn strange. Later printings changed it to something less likely to cause the faithful to pick up their pitchforks, but I like the original.\n\n\ndescription:\n\nRichard Lattimore, among the most distinguished translators of the Greek classics, concluded late in his life one of his most ambitious projects - a complete translation of the New Testament. This New Testament is itself a classic of another kind - the words of the gospel and the apostles presented for the modern reader in fresh English by a writer without pretensions as a biblical scholar, who was an authority on the Greek language in which these texts have come down to us.\n\nFrom Library Journal\n\nThis volume offers the complete translation of the New Testament, previously published in two paperback volumes (The Four Gospels and the Revelation, 1962, 1979; Acts and Letters of the Apostles, 1982) by the well-known translator of the Greek classics, who died in 1984. More formal than attractive, Lattimore's translation is not really that different from the Revised Standard Version. Although verse numbers are indicated at the top of each page, the body of the text remains unnumbered, so that one feels one is reading a narrative, the way the text was originally presented, and not a hallowed volume that has been canonized. Although literal - with masculine terms for God - the rendition is smooth and gives a sense of the Greek style. Notes (limited to questions of translation) are kept to a minimum and relegated to the back.\n\nReview\n\n&quot;The importance of Lattimore's skill and careful work and of his highly-informed literary sense is that you do indeed come away with a new and strong sense of who the reporters are. And when you know that, it expands the meaning of the Story.&quot;--Richard Dyer, The Boston Globe\n\n&quot;Without the gaudy beauties of the King James version or the overly hip sound of some modern editions, Lattimore's New Testament possesses an austere, moving plainness, a willingness to shape long sentences, and an admirable clarity.&quot;--The Washington Post Book World\n\n&quot;The important news is that Mr. Lattimore has provided a... self-consistent, personal, sanely literal version of the four texts most central to our tragic history. He has avoided the twin shoals of caprice and ego, and his dedication to the line of the originals has produced an air of solidity and reliability often missing from single efforts.&quot;--Reynolds Price\n\n&quot;An impressive, scholarly new version by the eminent translator.&quot;--The New York Times Book Review","torrent":{"xt":"urn:btih:1483202e3720b110994dd2e373181a3d8440e2c6","amp;dn":"Richmond+Lattimore%2C+trans.+-+The+New+Testament+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1483202e3720b110994dd2e373181a3d8440e2c6","infoHashBuffer":{"type":"Buffer","data":[20,131,32,46,55,32,177,16,153,77,210,227,115,24,26,61,132,64,226,198]},"announce":[],"urlList":[]}}