{"title":"Lightbot - Programming Puzzles v1.6.3","uid":12011666,"size":43299582,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:15acfea786e3d239a1590304804a4249cc245318&amp;dn=Lightbot+-+Programming+Puzzles+v1.6.3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Androider","files":1,"time":1434172431,"description":"Get kids hooked on programming within minutes! As featured in the New York Times, TechCrunch, and Forbes.\n\nLightbot is a programming puzzle game: a puzzle game that uses game mechanics that are firmly rooted in programming concepts.\n\nLightbot lets players gain a practical understanding of basic control-flow concepts like procedures, loops, and conditionals, just by guiding a robot with commands to light up tiles and solve levels. Ideal for ages 8+\n\nTeachers and parents worldwide are choosing Lightbot first out of other games and software when introducing kids to programming.\n\nLightbot features 50 levels and 20 challenge stars to collect and is a must-have for puzzle enthusiasts of any age.\n\nThis version of Lightbot lets you play in English, French, Russian, Brazilian Portuguese, Spanish, Traditional Chinese, Simplified Chinese, Norwegian, Slovenian, Romanian, Indonesian, German, Polish, Danish, Croatian, Dutch, Slovak, Czech, Greek, Italian, Japanese, Korean, Malay, Thai, Hindi or Swedish! Just hit the associated flag icon on the main screen to select a language!\n\nWhat's New:\n\nNEW to Google Play: Lightbot now features multiple save slots and the ability to track progress across multiple players.\nNow multiple players can enjoy Lightbot within their own save slot, advancing at their own pace, and also competing on number of levels finished, number of stars collected and total number of commands used once all levels are complete (Lower score = better)\nNew languages Japanese, Korean, Thai, Malay, Hindi &amp; Swedish added!\nAnd as always, thank you for supporting Lightbot!\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.lightbot.lightbot&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.lightbot.lightbot&lt;/a&gt;","torrent":{"xt":"urn:btih:15acfea786e3d239a1590304804a4249cc245318","amp;dn":"Lightbot+-+Programming+Puzzles+v1.6.3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15acfea786e3d239a1590304804a4249cc245318","infoHashBuffer":{"type":"Buffer","data":[21,172,254,167,134,227,210,57,161,89,3,4,128,74,66,73,204,36,83,24]},"announce":[],"urlList":[]}}