{"title":"Sharyn   McCrumb-Bimbos of the Death Sun","uid":9878157,"size":127359820,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:1603b31f3ffc5e36f6d3ec9e8a6fc2c62543c79b&amp;dn=Sharyn+++McCrumb-Bimbos+of+the+Death+Sun&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"twocows","files":20,"time":1396501436,"description":"Ostensibly a mystery novel, Bimbos of the Death Sun won an Edgar Award in 1988 for Best Original Paperback Mystery. While we follow the plot eagerly, the fact is that what happens in this novel is in some ways much less important than where it happens. Bimbos of the Death Sun is not a mystery that just so happens to also be science fiction and fantasy; it's a novel about a particular American subculture as well in which Trekkies and Dungeon Masters convene--complete with their hobbit costumes and the like--to buy and sell memorabilia.\n\nIt could be said that Jay Omega and his girlfriend, Dr. Marion Farley, represent two different approaches to the pageantry and obsession that swirl around them. Omega, as guest author and conference V.I.P., tries to tread lightly around the customs and peculiarities of the sci-fi aficionados in an effort not to offend but also to avoid becoming too involved. Marion, the professor of comparative literature, casts a more critical eye on the proceedings, giving the touted big-shots and the aspiring authors little in the way of credibility.\n\n","torrent":{"xt":"urn:btih:1603b31f3ffc5e36f6d3ec9e8a6fc2c62543c79b","amp;dn":"Sharyn+++McCrumb-Bimbos+of+the+Death+Sun","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1603b31f3ffc5e36f6d3ec9e8a6fc2c62543c79b","infoHashBuffer":{"type":"Buffer","data":[22,3,179,31,63,252,94,54,246,211,236,158,138,111,194,198,37,67,199,155]},"announce":[],"urlList":[]}}