{"title":"Total DC Comics fr 4/2/2014 (darkhomr) [ALL]","uid":9894035,"size":698278251,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:1672744a25e8788ae55385463e8f3a0d8a00166d&amp;dn=Total+DC+Comics+fr+4%2F2%2F2014+%28darkhomr%29+%5BALL%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"dadrkhomr","files":17,"time":1396676819,"description":"This is the 5th week of a Total DC pack.  Similar to my Total Marvel pack, this gathering of comics will include both DC Universe and non-universe titles.  What will be in here will be Vertigo comics, non-DC Universe titles, and any digital titles released by Friday morning.  This release has 11 DC Universe comics 3 non-Universe titles and 3 digital titles.  \n\nMy release packs are as follows: \n \nDC Universe 52 (Wednesdays based on scanners release times, but not later than Friday morning)\nMarvel NOW! (Marvel Comics in the NOW! universe will be released Wednesdays, based on scanners release times)\nTotal Marvel (All Marvel Universe comics, released on Friday, based on scanners release times)\nIndependent Comics (Non-DC Universe and Major Independent comics, released between Sunday and Monday morning) \nTotal DC (all DC comics released for the current week.  Released by Saturday each week.  Does not include digital only releases)\nDC Monthly (all DC Universe comics for the month, released the first Friday after the end of the month)\nTotal Marvel Monthly (all Marvel Universe comics, released the first Tuesday after the end of the month)\n\n\n\n\n\n\n\n\n\nAction Comics #30 (CBR 4/2/2014)\n\nFollowing the events of FOREVER EVIL, Superman confronts Lex Luthor--but the world has turned around for these two. The hero has become the villain and the villain the hero as forces beyond these two gather to destroy the Man of Steel, beginning with a dormant Doomsday who has crossed over from the Phantom Zone! \n\nAquaman and the Others #1 (CBR 4/2/2014)\n\nA &quot;FUTURES END&quot; prelude! Spinning out of AQUAMAN, the King of Atlantis and his teammates find themselves targeted by an unknown foe that wants their Atlantean artifacts! Don't miss the start of this all-new series! \n\nBatman '66 #31 (CBR 4/2/2014)\n\nThe Joker's back and he's teaming up with Catwoman. Will Batgirl's help be enough for Batman and Robin to overcome this dastardly duo? \n\nBatwing #30 (CBR 4/2/2014)\n\nBatwing races Menace to attempt to save his family! But the Gotham Underground is about to boil over with anarchy, and no matter which tribe rises up from below Gotham City, Batwing will be the first target! \n\nDetective Comics #30 (CBR 4/2/2014)\n\nA bold new direction for DETECTIVE COMICS as THE FLASH creative team of Francis Manapul and Brian Buccelato take over the creative reins! Batman finds himself knee-deep in a new mystery involving a deadly new narcotic that has hit the streets of Gotham City. \n\nEarth 2 #22 (CBR 4/2/2014)\n\nWhen all looks lost--Green Lantern returns!\n\nFairest #25 (CBR 4/2/2014)\n\n'OF MEN AND MICE' barrels toward its epic conclusion in this penultimate chapter! The secrets of the mice/men hybrids are revealed! Cindy and the man responsible for it all return to Fabletown just in time for...chaos? Spies, intrigue, murder, and more rodents than a New York City subway tunnel! \n\nGreen Arrow #30 (CBR 4/2/2014)\n\n&quot;The Outsiders War&quot; Part 5! Arrow and Robert face a mob of Outsiders. It looks bad . . . but the cavalry is about to arrive in the form of Katana, Butcher, Magus and Kodiak! Will they be in time to save the day? \n\nGreen Lantern #30 (CBR 4/2/2014)\n\nHal Jordan is surrounded on the homeworld of the Khund, the bloodthirsty military wing of a cosmic alliance that's determined to crush the Green Lanterns! So why has he volunteered to fight without his ring? \n\nLooney Tunes #218 (CBR 4/2/2014)\n\nDaffy Duck is sure he'd give the best-ever rendition of his pal Porky's famous 'Th-th-that's all, folks!' Could he be too good at it, though? We'll find out when the director gives him his big break! \n\nMovement #11 (CBR 4/2/2014)\n\nVirtue's mysterious past is revealed! Plus, The Movement travels outside of Coral City for the first time to rescue their teammate Burden from his demonic brother! \n\nPhantom Stranger #18 (Trinity of Sin) (CBR 4/2/2014)\n\n'The Crack in Creation' begins! Sin Eater and his new master, the mysterious Non, are marshaling an army of these in-between souls! Their goal? To invade the world of the living and set up a new order! Guest-starring Superman and Dr. Light, who is still dead! \n\nSmallville: Lantern #4 (CBR 4/2/2014)\n\nAs Clark begins to grasp the potential of the Green Lantern ring, he realizes John Stewart's training hasn't prepared him for the battle they're about to face. \n\nStormwatch #30 (CBR 4/2/2014)\n\nFINAL ISSUE A 'FUTURES END' prelude! The original Stormwatch team returns, as this story sets up the organization's role in the future of the DC Universe! \n\nSwamp Thing #30 (CBR 4/2/2014)\n\nAlec Holland contemplates the Sureen's offer to turn him human. but if he does accept, what happens to his almost all-powerful body? He and his warrior companion Capucine must travel to India to find the answersÃ– and to get there, they'll need help from Vandal Savage! \n\nTrillium #8 (of 8) (CBR 4/2/2014)\n\nWhat is Nika's ultimate destiny? And what role will William play in the survival of humankind? Can they finally be reunited before the universe unravels all around them? Vertigo's sci-fi epic reaches its mindbending conclusion. \n\nThe Vampire Diaries #19 (CBR 4/2/2014)\n\n&quot;The Mummy&quot; part 1 of 2! A traveling mummy exhibit offers the teens of Mystic Falls a unique opportunity--an overnight museum stay! When freshman class members Elena Bennett and Stefan Salvatore volunteer to chaperon pre-teens for extra credit, they have no idea what they're getting themselves into! ","torrent":{"xt":"urn:btih:1672744a25e8788ae55385463e8f3a0d8a00166d","amp;dn":"Total+DC+Comics+fr+4%2F2%2F2014+%28darkhomr%29+%5BALL%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1672744a25e8788ae55385463e8f3a0d8a00166d","infoHashBuffer":{"type":"Buffer","data":[22,114,116,74,37,232,120,138,229,83,133,70,62,143,58,13,138,0,22,109]},"announce":[],"urlList":[]}}