{"title":"[Raw Food] Get Fresh Magazine Winter 2007 issue 49","uid":4251791,"size":8280788,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:16b2d3360b60231fd02788142cdb5d33589db7a5&amp;dn=%5BRaw+Food%5D+Get+Fresh+Magazine+Winter+2007+issue+49&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"panda4723","files":1,"time":1214007376,"description":"get fresh! - winter 2007 - issue 49\n\nWhat&amp;#039;s in issue 49?\n* Exclusive interview with supermodel Carol Alt. Find out why she says that raw food not only changed her life, but saved her life \n* Nutritionist and author Natalia Rose on why getting hung up on &amp;#039;100% raw&amp;#039; can prevent you from reaching your true potential\n* It&amp;#039;s official: raw food does equal better sex, but only if you do it right. Roe Gallo introduces the lifestyle that will help you reach your true &amp;#039;SQ&amp;#039; \n* Not sure which water is best to drink? We sort through the confusion with an exploration of the relative merits of tap, bottled and the different varieties of filtered water\n* An article on the living foods solution to diabetes by Dr Gabriel Cousens \n* Brian Clement with a shocking exploration of the possible implications of planned Codex Alimentarius legislation on our health freedom \n* Sarma Melngailis finds salvation in green shakes \n* World-class athlete Brendan Brazier on the importance of staying alkaline, and how to achieve this \n* Raw chef Chad Sarno presents a New England Christmas feast \n* The role of raw blogs in spreading the word and providing much-needed information and support\n* Karen Knowler outlines the five steps to freedom from emotional eating \n* How I beat chronic fatigue syndrome&quot; by Raw Lifestyle Coach Jess Michael \n* YOU too can prepare raw dishes that taste amazing with top chef Cherie Soria&amp;#039;s guide to balancing flavours\n* How raw foods and yoga work in tandem for superior health, by Tonya Zavasta \n* Why microbes could be ruining your day, by Pete Vincent \n* Energy soups: what they are, what they can do for you and how to make them \n* Alissa Cohen shares her tips for eating healthily during the party season, and her favourite festive recipes \n* The alternatives to vaccination \n* An in-depth review of the 2007 Raw Spirit Festival \n* Plus news, reviews, tips, useful contacts and much more!\n\n","torrent":{"xt":"urn:btih:16b2d3360b60231fd02788142cdb5d33589db7a5","amp;dn":"%5BRaw+Food%5D+Get+Fresh+Magazine+Winter+2007+issue+49","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16b2d3360b60231fd02788142cdb5d33589db7a5","infoHashBuffer":{"type":"Buffer","data":[22,178,211,54,11,96,35,31,208,39,136,20,44,219,93,51,88,157,183,165]},"announce":[],"urlList":[]}}