{"title":"[psx]-GRAN turismo2-SIMULATION DISC!-XxGLITCHxX-ePSXe100%","uid":4122510,"size":387628911,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:172b5507db13d6816c5d1cf36cc011e5ed34d845&amp;dn=%5Bpsx%5D-GRAN+turismo2-SIMULATION+DISC%21-XxGLITCHxX-ePSXe100%25&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"XxGLITCHxX","files":1,"time":1207624339,"description":"**REUPLOADED*** !!!FASTER CONNECTION!!!\n\n\n\nWorking, Hard to find, ePSXe compatiable. Also this is not a PSP EBOOT. OR PSX to PSP\n\nthis is only for PLAYSTATION1 EMULATORS! and thats it! no PSP HERE!!!\n\n\nProbably one of the hardest torrents/files to track!! was the Simulation disc. i gave up and uploaded my own copy!! .BIN format \n\n(I see someone is already seeding a arcade version too!)\n\nthis works 100% in ePSXe, (i provide ePSXe in my uploads, working with BIOS+plugins)\n\n\nsome info about the awesome game sony ever created!\n\nINFO:\n\nPlatform: PlayStation\nRelease Date: December 17, 1999\nSimilar Games: Gran Turismo (PlayStation), Need for Speed: High Stakes (PlayStation), R4: Ridge Racer Type 4 (PlayStation), Sports Car GT (PlayStation), Need for Speed: High Stakes (IBM PC Compatible), Gran Turismo 3 A-spec (PlayStation 2)\n\n\nGENERAL INFO:\n\nGran Turismo took the PlayStation to new graphical standards. It also advanced the racing genre with its inclusion of full Arcade and Simulation modes. Along with the two modes of play, players also found themselves with a plethora of cars (new and used), tracks and car settings. Gran Turismo 2 takes everything in the original and adds to it with more cars, more tracks, more car manufacturers and even rally racing. Replays can be saved to a memory card and unlike the original, viewed from camera angles selected by the user.\n\nArcade mode has players racing each track on a variety of difficulty settings. Winning on each setting will release new cars and tracks. Every car featured in the complete game will not be found in this mode, but instead only a select group. However, this time around players are now allowed to use the cars that have been purchased and modified in Simulation mode. This mode has another connection to Arcade mode as well: obtaining licenses will unlock tracks in Arcade mode. Time Trial, Ghost Car, Replay Theater and Rally modes are also included in Arcade mode, however rally mode exists only as a time trial here. In order to race against opponents on rally tracks, players will have to purchase a rally car in Simulation mode.","torrent":{"xt":"urn:btih:172b5507db13d6816c5d1cf36cc011e5ed34d845","amp;dn":"%5Bpsx%5D-GRAN+turismo2-SIMULATION+DISC%21-XxGLITCHxX-ePSXe100%25","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"172b5507db13d6816c5d1cf36cc011e5ed34d845","infoHashBuffer":{"type":"Buffer","data":[23,43,85,7,219,19,214,129,108,93,28,243,108,192,17,229,237,52,216,69]},"announce":[],"urlList":[]}}