{"title":"Natural Colorants for Food and Nutraceutical Uses","uid":14669196,"size":6432318,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:175bf7dbd8a0b2f53d52cdebfefd047f892a2a40&amp;dn=Natural+Colorants+for+Food+and+Nutraceutical+Uses&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1463849260,"description":"Natural Colorants for Food and Nutraceutical Uses - Francisco Delgado-Vargas, Octavio Paredes-López (CRC, 2003).pdf\r\n\r\nISBN 1-58716-076-5\r\n\r\nAs our understanding of the science and functions of color in food has increased, the preferred colorants, forms of use, and legislation regulating their uses have also changed. Natural Colorants for Food and Nutraceutical Uses reflects the current tendency to use natural pigments. It details their science, technology, and applications as well as their nutraceutical properties.\r\n\r\nStarting with the basics, the book creates an understanding of physical colors, discusses color measurement, and analyzes why natural pigments are preferred today. The authors present an overview of global colorants, including safety, toxicity and regulatory aspects. Information about inorganic and synthetic colorants is included. The book then focuses on applications of natural colorants, with special attention given to characteristics, extraction and processing stability, and the use of biotechnology and molecular biology to increase colorant production. Finally, the book examines the nutraceutical properties of natural colorants and compares them to other well-known nutraceutical components.\r\n\r\nFrom the basics to highly specialized concepts and applications, Natural Colorants for Food and Nutraceutical Uses presents essential, practical information about pigments in the food industry. With its coverage of state-of-the-art technologies and future trends in the application of color to food, this book provides the most comprehensive, up-to-date survey of the field","torrent":{"xt":"urn:btih:175bf7dbd8a0b2f53d52cdebfefd047f892a2a40","amp;dn":"Natural+Colorants+for+Food+and+Nutraceutical+Uses","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"175bf7dbd8a0b2f53d52cdebfefd047f892a2a40","infoHashBuffer":{"type":"Buffer","data":[23,91,247,219,216,160,178,245,61,82,205,235,254,253,4,127,137,42,42,64]},"announce":[],"urlList":[]}}