{"title":"Atlas of Mammalian Chromosomes (gnv64)","uid":7663503,"size":101774239,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:18975dd7b55da42cac2642d5465dc4b2be0581d7&amp;dn=Atlas+of+Mammalian+Chromosomes+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"gnv65","files":-1,"time":1348371912,"description":"Atlas of Mammalian Chromosomes\nby Stephen J. O'Brien, Joan C. Menninger and William G. Nash\nWiley-Liss | August 2006 | ISBN-10: 047135015X | PDF | 714 pages | 97 mb &lt;a href=&quot;\nhttp://www.amazon.com/Atlas-Mammalian-Chromosomes-Stephen-OBrien/dp/047135015X/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Atlas-Mammalian-Chromosomes-Stephen-OBrien/dp/047135015X/&lt;/a&gt;\n\nA stunning visual collection of the banded metaphase chromosome karyotypes from some 850 species of mammals, the Atlas of Mammalian Chromosomes represents an unabridged compendium of the state of this genomic art form. Bringing together information currently scattered throughout the cytogenetics literature for scores of published and unpublished species, this atlas features high-quality karyotype images for nearly every mammal studied to date, making it the most comprehensive assemblage of high-resolution chromosome photographs available--a critically invaluable resource for today's comparative genomics era.\nFor every available species, the Atlas of Mammalian Chromosomes presents the best karyotype produced, the common and Latin name of the species, the published citation, and the contributing authors. Most karyotypes are G-banded, revealing the chromosomal bar codes of homologous segments among related species.\nAddressing the mandate of the Human Genome Project to annotate the genomes of other organisms as well, the Atlas of Mammalian Chromosomes offers a step forward in our understanding of species formation, of genome organization, and of DNA script for natural selection. It is an invaluable resource for geneticists, mammalogists, and biologists interested in comparative genomics, systematics, and chromosome structure.","torrent":{"xt":"urn:btih:18975dd7b55da42cac2642d5465dc4b2be0581d7","amp;dn":"Atlas+of+Mammalian+Chromosomes+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18975dd7b55da42cac2642d5465dc4b2be0581d7","infoHashBuffer":{"type":"Buffer","data":[24,151,93,215,181,93,164,44,172,38,66,213,70,93,196,178,190,5,129,215]},"announce":[],"urlList":[]}}