{"title":"THE HIGH CHAPARRAL (1967) 1-2 [retr0tv]","uid":3988108,"size":575985711,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1a6f42b8fd1ee4f22bbbb1178aa65a634dffa5d5&amp;dn=THE+HIGH+CHAPARRAL+%281967%29+1-2+%5Bretr0tv%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"flixer","files":3,"time":1200874780,"description":"High Chaparral was the name given to the ranch owned and operated by the Cannon family in the Arizona Territory during the 1870&amp;#039;s. Stubborn, proud Big John Cannon (Leif Erickson) is unceasing in his determination to carve a life in the untamed land. Frequently at odds with Big John is his firebrand of a younger brother Buck (Cameron Mitchell) and John&amp;#039;s sensitive son, Billy Blue (Mark Slade). After his first wife&amp;#039;s death, Big John marries Victoria (Linda Cristal), daughter of wealthy Mexican Land-owner, Don Sebastian Montoya (Frank Silvera) as a political alliance. Her roguish brother Manolito (Henry Darrow) accompanies her to the Cannon ranch and becomes a permanent member of the household. Sam Butler (Don Collier) is hired as the ranch foreman, while his brother Joe (Bob Hoy) along with Reno (Ted Markland), Pedro (Roberto Contreras), Ira (Jerry Summers), and Vaquero (Rudolfo Acosta) are the hard-working, fun-loving ranch hands.\n\n\n1. Destination Tucson  9/10/1967\nThis pilot launches the saga of the Cannon family as they fight to establish a ranch in the Arizona territory of the 1870s. Marauding Apaches led by Cochise are on the warpath. The Army orders the Cannon family to move on, but Big John Cannon won&amp;#039;t budge. While his brother Buck rides off to recruit gun-carrying cowhands, Big John learns of another enemy: a Mexican land baron claims the Cannon property, and dispatches his men to seize the cattle.\nGuest star: Rico Alaniz (Ricardo), X Brands (Nock-ay-del), Henry Wills (Lt. Ellis) , Jorge Moreno (Chico), Joan Caulfield (Annalee Cannon, Big John&amp;#039;s First Wife), Mike De Anda (Chavez), Evelyn King (Mabel), Erin O&amp;#039;Donnell (Jo)\n\n\n2. The Arrangement  9/10/1967\nJohn Cannon&amp;#039;s first wife is killed during an Apache raid. Buck, his brother, can&amp;#039;t stop Mexican bandits from rustling cattle. Unable to fight on two fronts -- against Mexican marauders and the Indians -- John arranges a defense agreement with his neighbor in Mexico, Don Sebastian Montoya. The Mexican insists that John seal the agreement by marrying Victoria, his daughter, thus solidifying an alliance against the Apache. Moreover, Don Sebastian demands that Victoria&amp;#039;s carefree brother, Manolito, come along to guarantee her safety.\nGuest star: Rico Alaniz (Ricardo), X Brands (Nock-Ay-Del) , Jorge Moreno (Chico)\n\nLeave a comment if you&amp;#039;d like to see more! :)","torrent":{"xt":"urn:btih:1a6f42b8fd1ee4f22bbbb1178aa65a634dffa5d5","amp;dn":"THE+HIGH+CHAPARRAL+%281967%29+1-2+%5Bretr0tv%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a6f42b8fd1ee4f22bbbb1178aa65a634dffa5d5","infoHashBuffer":{"type":"Buffer","data":[26,111,66,184,253,30,228,242,43,187,177,23,138,166,90,99,77,255,165,213]},"announce":[],"urlList":[]}}