{"title":"Michelle Branch - The Spirit Room","uid":6628502,"size":340275879,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1bba0c4755de2f47b15d43e1c05c1a09e02e19dd&amp;dn=Michelle+Branch+-+The+Spirit+Room&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cdda-flac","files":-1,"time":1314251752,"description":"\n &lt;a href=&quot;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/45/44/4beb124128a067d399c14010.L.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/45/44/4beb124128a067d399c14010.L.jpg&lt;/a&gt;\n\n\nTitle: The Spirit Room\nArtist: Michelle Branch\nAudio CD (August 14, 2001)\nOriginal Release Date: 2001\nNumber of Discs: 1\nGenre: Rock\nFormat: Free Lossless Audio Codec\n\n\nTrack Listing:\n\n01. Everywhere\n02. You Get Me\n03. All You Wanted\n04. You Set Me Free\n05. Something to Sleep To\n06. Here with Me\n07. Sweet Misery\n08. If Only She Knew\n09. I'd Rather Be in Love\n10. Goodbye to You\n11. Drop in the Ocean\n\n\nAmazon Review:\n&quot;So I'm a little left of center, I'm a little out of tune,&quot; sings Michelle Branch on her debut album's &quot;You Get Me.&quot; Well, maybe. Branch offers a well-produced pastiche of chiming and strumming guitars, hip-hop-lite beats, quiet-verse-to-louder-chorus templates, and positive thinking. At her best--&quot;If She Only Knew,&quot; a propulsive love note to an ex--she rivals the likes of Sixpence None the Richer as likable radio-aimed fare. Catchy and self-expressive while breaking absolutely no ground, Branch also echoes everyone from label-mate Alanis Morissette to the solo Belinda Carlisle. She dies just a little in this crazy mixed-up world, escapes to her secret garden for sunshine in the pouring rain, and ultimately finds her reflection getting clearer. The Spirit Room could be the next bit of pop philosophy to dazzle mainstream audiences.\n\nAllmusic Review:\nYou have to keep reminding yourself that 2001 newcomer Michelle Branch is only 17 years old when listening to her worthy pop/rock debut The Spirit Room. The 11-track set showcases this precocious artist on guitar (electric and acoustic) and a substantial vocal presence that blends innocence, passion, vulnerability, yearning, intensity, and tenderness all in one voice. She also has a knack for crafting melodic vocal leads, which further define her infectious sound. However, what truly shines through are the young musician's lyrics she handles much of the songwriting which are some of the most open, simple, and idealistic ruminations on love to drop in 2001. It's no surprise that the disc's first single release, the lively and heartfelt &quot;Everywhere&quot; with its electric-guitar power chords, spirited vocal delivery, and catchy chorus spread like wildfire on the radio. Elsewhere, the sugary mid-tempo rock ballad &quot;You Get Me&quot; is an endearing and clever spin on the romantic pairing of two misfits. There's nothing more fulfilling and powerful than having the unconditional understanding, acceptance, and love of another, particularly for those a bit &quot;left of center,&quot; as the song explains, and Branch well captures the essence of this life treasure. The album's most captivating moment is the mesmerizing &quot;Drop in the Ocean,&quot; which, to be sure, symbolizes Branch's Spirit Room. On it her voice, backed by slow and building synth chords, departs from its usual energetic sound and becomes throaty, deep, and ethereal. And Branch's lyrics &quot;Love took me by the hand/love took me by surprise/love led me to you/and love opened up my eyes/I was drifting away like a drop in the ocean, now I realize/that nothing has been as beautiful as when I saw heaven's skies/in your eyes&quot; take the musical depiction of love to a spiritual level, and that doesn't happen often in contemporary pop/rock, particularly not by a 17 year old. Of note is producer John Shanks' (Stevie Nicks, Melissa Etheridge, and BBMak, among others) great mix; textured backing vocals and overdubs, and a creative use of drum machines, modern beat sounds, and turntables set to a backdrop of rock music, puts a fresh spin on the genre. No doubt, Branch is an artist with a bright future, and that's lucky for music listeners. She has enough spirit to fill not just one room, but many.","torrent":{"xt":"urn:btih:1bba0c4755de2f47b15d43e1c05c1a09e02e19dd","amp;dn":"Michelle+Branch+-+The+Spirit+Room","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1bba0c4755de2f47b15d43e1c05c1a09e02e19dd","infoHashBuffer":{"type":"Buffer","data":[27,186,12,71,85,222,47,71,177,93,67,225,192,92,26,9,224,46,25,221]},"announce":[],"urlList":[]}}