{"title":"Humayun (1945) Xvid 1cd_Eng Subs_Indian Cinema_The Early Years_C","uid":8641172,"size":763515919,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1bf2a323ebaee1a8a22793fc00a2e5d90f27ca21&amp;dn=Humayun+%281945%29+Xvid+1cd_Eng+Subs_Indian+Cinema_The+Early+Years_C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SaM","files":-1,"time":1372881300,"description":"Humayun (1945) Xvid 1cd_Eng Subs_Classic [DDR]\n\nCAST:- Ashok Kumar, Nargis, Veena, Chandramohan, Shah Nawaz, K.N. SIngh\n\nDirected by Mehboob\nMusic Director: Ghulam Haider\t and V. Balsara\nLyricists:-  Arzoo Lakhnavi, Vikar Ambalvi, Anjum Pilibhiti, Pandit Madhur, Shums Lakhnavi\t\n\nSongs are included in MP3s\nHumayun (1945) 00. Title Music and Screen Credits, Ghulam Haider\nHumayun (1945) 01. Naina Bhar Aaye Neer, Shamshad Begum, Anjum Pilibhiti, Kavi \nHumayun (1945) 02. Woh Desh Kal Nahee Tha, Shams Lakhnavi, Anjum Pilibhiti, G\nHumayun (1945) 03. Ae Chand Tu Bata De, Shams Lakhnavi, Ghulam Haider\nHumayun (1945) 04. Meri Yeh Duaon Ka, Shamshad Begum, Shams Lakhnavi, Ghulam \nHumayun (1945) 05. Main To Odhoon Gulabi, Shamshad Begum, Shams Lakhnavi, \nHumayun (1945) 06. Rasmein Ulfat Kisi Soorat Se, Rajkumari, Shams Lakhnavi, \nHumayun (1945) 07. Husn Kehta Jaa Raha Hai, Shamshad Begum, Vikar Ambalvi, \nHumayun (1945) 08. Oh Chand Chamka Andhere Mein, Pandit Madhur, Ghulam Haider\n\nPROFILE:- Ashok Kumar - Oct, 13th, 1911 - Dec 10th, 2001\nWhen Ashok Kumar began his career in cinema, German director Franz Osten wrote him off at the very outset. &quot;You will never make it in films because of your tremendous jaw,&quot; the famed director of the classical hit &quot;Achut Kanya&quot; had told Kumar. The year was 1936. During the shooting for &quot;Achut Kanya&quot;, in which Kumar played the male lead, Osten hauled up the newcomer numerous times. The nervous Kumar was at his wit's end. Sixty-five years later and with more than 270 films to his credit, Kumar emerged as one of India's celluloid legends. Far from Osten's assessment, the argument now is whether Kumar was not Indian cinema's most enduring lead actor.\n\nBorn Kumudlal Kunjilal Ganguly at Bhagalpur, Bihar, in 1911, Ashok Kumar was the oldest of the three famous Ganguly brothers - Ashok, Anup and Kishore Kumar. Ashok Kumar spent his early years in Khandwa, Madhya Pradesh.\n\nBe it the handsome, soft-spoken lover or the middle-aged crook or later still the affable grandfather, Kumar not only left an indelible mark on the big screen but also won millions of fans as a singer in his earliest films. The song 'Main Ban Ki Chidiya..' he sang for &quot;Achut Kanya&quot; was a rage in its time. Kumar's entry into acting appears to have been accidental. A science graduate, he became a film buff and wanted to make a career as a director. In 1934, he used his examination fee of Rs.35 for a law degree to buy a ticket for Mumbai. He landed up at the Bombay Talkies, then the nerve-centre of India's film world. He was hired by Bombay Talkies owner Himanshu Rai for Rs 150 as a trainee technician and a camera assistant. Months later, he became a laboratory assistant and his salary rose to Rs 250. In 1936, when Rai was producing &quot;Jeevan Naiya&quot;, the original hero of the film Najmul Hussein failed to turn up for shooting. Rai asked Kumar to do the make-up. &quot;Jeevan Naiya&quot; was a runaway hit. Kumar's success was confirmed with his next film &quot;Achut Kanya&quot;. The astounding success of the film, considered a classic of all times, turned the pair of Kumar and Devika Rani, that had also appeared in &quot;Jeevan Naiya&quot;, into a hit combination.\n\nEarly in his career, he played second fiddle to Devika Rani, and it was with films like Kangan, Bandhan and Jhoola that he was recognised as a hero in his own right. All the three films had Leela Chitnis playing the female lead. Film critics say Kumar's acting career can be clearly divided into three phases. The days of the handsome, soft-spoken romantic hero in enduring films like &quot;Kismet&quot; and &quot;Kangan&quot;, the years as tough-talking hero in films like &quot;Sangram,&quot; &quot;Mahal,&quot; &quot;Samadhi&quot; and &quot;Howrah Bridge&quot; and finally the character actor in films like &quot;Aashirwad,&quot; &quot;Mili,&quot; &quot;Khoobsurat&quot; and &quot;Shaukeen.&quot;\n\nHe starred in a series of crime films like Sangram, Inspector, Howrah Bridge and Night Club, all in the fifties, when he had stiff competition in the form of Dev Anand, Dilip Kumar and Raj Kapoor. He charmed the audience with movies like Deedar and Bewafaa where he shared the screen with the leading trio of moviedom. With the riotous Chalti Ka Naam Gaadi, he displayed his flair for comedy. In the mid sixties, he turned to character roles, including the suave villain of Jewel Thief and the caring father of Mili. By playing the rapist in Jawab (1970), he broke the conventional mould. It was in Khubsoorat, in 1980, that he played one of his memorable roles. With a repertoire of around 300 movies, he quit the scene due to poor health.\n\nHe got the most prestigious Dada Sahab Phalke Award in 1988, for his dedicated contribution to Hindi cinema. Fondly called Dada Moni, he was a doyen in the true sense of the word. With his penchant for blending into every character and merging with the role, Ashok Kumar was addictive to filmmakers and audiences alike. For more than six decades, he never acted - he became whatever character he played.\n\nDada Moni acted in 300 Hindi films approximately.\n \t\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 744 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec: 0x0055 MPEG-1 Layer 3\nAudio Bitrate: 115kb/s VBR 48000 Hz\nAudio Streams:  2\nAudio Languages: Hindi\nRunTime: 1:51:54\nSubtitles: English\nRipped by: Trinidad [DDR]     \nDuration: 1:51:54","torrent":{"xt":"urn:btih:1bf2a323ebaee1a8a22793fc00a2e5d90f27ca21","amp;dn":"Humayun+%281945%29+Xvid+1cd_Eng+Subs_Indian+Cinema_The+Early+Years_C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1bf2a323ebaee1a8a22793fc00a2e5d90f27ca21","infoHashBuffer":{"type":"Buffer","data":[27,242,163,35,235,174,225,168,162,39,147,252,0,162,229,217,15,39,202,33]},"announce":[],"urlList":[]}}