{"title":"The Walt Disney Creativity Strategy ( NLP )","uid":11871375,"size":331605293,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:1c0337f1c67b51d06cd5bcf3d079a4bb4b022e8a&amp;dn=The+Walt+Disney+Creativity+Strategy+%28+NLP+%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"DesertSpirit","files":2,"time":1430432622,"description":"\t\nThis is an enormously useful process for almost any choice, decision, or plan you are considering.  One of the most popular and widely used, you can benefit tremendously even if you have no NLP experience at all.  You'll want to make it part of &quot;how you think&quot; in every area of your life for better choices and more satisfying decisions.  \n\nRobert modeled this process from Walt Disney's strategy for producing movies, tv shows, amusement parks and other projects.\n\nIt's simplicity belies its power.  On this video Robert will personally guide you through the subtleties and nuances of the process so that you get the greatest benefit for yourself from the very beginning.  \n\nRehearsing the process three of four times with Robert's tutelage will start to make it a natural part of how you think.  You'll find this wonderfully useful not only with work issues like&quot;should I take this job&quot; to &quot;shall I take on this project&quot; you'll also find it fun to explore with your family on topics like where to go on holiday.\n\nFor many people, criticism is the biggest obstacle to creative thinking. Through studying his strategies, Robert Dilts found that Disney circumvented this difficulty by sequencing his creative process into three functional stages: &quot;Dreamer, Realist, and Critic.&quot; Watch Dilts use the Disney strategy to help a man who previously had given up his dreams. Connirae Andreas offers an introduction to Dilts' demonstrations as well as a follow-up interview","torrent":{"xt":"urn:btih:1c0337f1c67b51d06cd5bcf3d079a4bb4b022e8a","amp;dn":"The+Walt+Disney+Creativity+Strategy+%28+NLP+%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c0337f1c67b51d06cd5bcf3d079a4bb4b022e8a","infoHashBuffer":{"type":"Buffer","data":[28,3,55,241,198,123,81,208,108,213,188,243,208,121,164,187,75,2,46,138]},"announce":[],"urlList":[]}}