{"title":"NewsLeecher 3.9 Final(with keygen)","uid":4212372,"size":3867986,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1ca52d1cea53e164f36b03759120290268d1c9ad&amp;dn=NewsLeecher+3.9+Final%28with+keygen%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"aoloffline","files":1,"time":1212107287,"description":"About NewsLeecher:\nNewsLeecher is a tool made for fetching and managing articles from the Usenet. It downloads Usenet articles in a snap, and uses it&amp;#039;s inline engine to assemble and decode all the downloads. The powerful featureset and state-of-the-art user interface makes it an application &quot;you simply can&amp;#039;t live without&quot; if you are a serious Usenet user.\n\n\n\nCompletely Free of Spyware &amp; Adware\n\t\nNewsLeecher does *not* contain any spyware or adware that might send personal details over the Internet. In fact, it has been certified as spyware-, adware- and virus-free by one of the largest software sites on the Internet.\n\n \tBased on Successful Experience\n\t\nIt is no secret that the development of NewsLeecher was initially inspired by some of the existing newsreaders on the market. We have tried to take the best features of those readers and mixed them together to make the ultimate newsreader available for our users!\n\n \tIncluding the Popular SuperSearch Usenet Search Feature\n\t\nWith the built-in SuperSearch feature, you can search *all* the binary usenet groups at once, for a specific keyword or keystring, in less than a second! The SuperSearch engine is state-of-the-art in it&amp;#039;s speed and it&amp;#039;s ability to perform true wildcard searches!\n\n \tFull Support for NZB Download Files\n\t\nNewsLeecher has full support for the NZB file format.\n\n \tAdvanced Multiserver Support\n\t\nNewsLeecher has advanced support for leeching from multiple servers at the same time! An unlimited number of usenet servers can be used to download files at the same time!\n\n \tTop Tuned yEnc Support\n\t\nBesides supporting the &quot;old&quot; encoding formats, such as uuEncode, NewsLeecher also supports the brand new encoding format called yEnc. Actually NewsLeecher has a top tuned yEnc decoding engine that makes sure your downloads are decoded smoothly in the background without consuming too much CPU time.\n\n \tMultithreaded Server Downloading\n\t\nBesides being able to download from several servers at the same time, NewsLeecher can also use up to 99(!!) simultaneous download threads per server. This could, for example, be used to download 99 pictures from a server at the same time!\n\n \tFilter System\n\t\nThe filtering feature enables one to find certain posts without going through all received headers. Filter by subject, size, age and more!\n\n \tAutomatic Downloading\n\t\nThe built-in automatic multipart posts processing removes the hassle from combining binary post parts one by one. NewsLeecher detects and combine parts by itself!\n\n \tFastest Group Caching in the World\n\t\nFast group caching enables much faster group viewing by only receiving the latest available post headers and caching the old ones! The caching routines in NewsLeecher has been tweaked and optimized to be the fastest in the world!\n\n \tTop Modern User Interface\n\t\nState of the art user interface with support for XP themes and many options for tweaking the usability and the interface!\n\n \tAdvanced Feature Support\n\t\nBesides all the usual download features, NewsLeecher also supports tons of advanced features that makes it easy to use your usenet membership to the fullest. Such features include smart article highlighting, a built in group noteblock and much much more!\n\n \tCompatible Technology\n\t\nCompatible with Windows 98, Me, NT, 2000, 2003, XP and Windows Vista.","torrent":{"xt":"urn:btih:1ca52d1cea53e164f36b03759120290268d1c9ad","amp;dn":"NewsLeecher+3.9+Final%28with+keygen%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ca52d1cea53e164f36b03759120290268d1c9ad","infoHashBuffer":{"type":"Buffer","data":[28,165,45,28,234,83,225,100,243,107,3,117,145,32,41,2,104,209,201,173]},"announce":[],"urlList":[]}}