{"title":"Dinanderie - A history and description of mediaeval art work in ","uid":9563540,"size":53578917,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1ccd551b25f5c73291ad4bcfa3e326678a64b24d&amp;dn=Dinanderie+-+A+history+and+description+of+mediaeval+art+work+in+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":-1,"time":1391472125,"description":"Dinanderie: A History And Description Of Mediaeval Art Work In Copper, Brass And Bronze\nG. Allen &amp; Sons | 2011 | English | ISBN: 1246159856 | 354 pages | PDF | 51 MB\nHistory\n\nMiddle Ages to denote the various articles required for ecclesiastical or domestic use made of copper or of its alloys, brass and bronze, with which the name of Dinant on theM euse was so intimately associated ;and as we have no word in modern English which would in the same way embrace all branches of this important art work, we have adopted it as the most convenient for our purpose. Numerous books have appeared of late years treating of the gold and silver-smith craft, and of the various objects made in the precious metals ;iron work, both constructional and artistic, has been even more fully dealt with, while pewter and lead work have not been forgotten ;but no attempt has yet been made adequately to describe the widely extended art of the coppersmith, although our museums and the church treasuries of the Continent abound in beautiful works executed in copper, brass and bronze. Mr. Drury Fortnum in his book on Bronzes deals slightly with one branch of our subject; but as he includes in it both the ancient and modern periods of the art, the proportion available for the description of mediaeval work is but scanty. Although it would be impossible in a single volume to do more than give a general view of the whole subject, with an account of the more important varieties of objects made in those metals during the mediaeval period, this has been done in a sufficiently detailed manner to make it an introductory handbook to this most interesting subject.","torrent":{"xt":"urn:btih:1ccd551b25f5c73291ad4bcfa3e326678a64b24d","amp;dn":"Dinanderie+-+A+history+and+description+of+mediaeval+art+work+in+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ccd551b25f5c73291ad4bcfa3e326678a64b24d","infoHashBuffer":{"type":"Buffer","data":[28,205,85,27,37,245,199,50,145,173,75,207,163,227,38,103,138,100,178,77]},"announce":[],"urlList":[]}}