{"title":"The Jazz June - They Love Those Who Make the Music [FLAC]","uid":9106321,"size":289174519,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1cdb43d066097740c423f5fd6bbba30e8c4b8976&amp;dn=The+Jazz+June+-+They+Love+Those+Who+Make+the+Music+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1382883884,"description":"\n  The Jazz June - They Love Those Who Make the Music [FLAC]\n\n  Released: 2000\n  Genre: Pop/Rock\n  Styles: Alternative, Indie Rock, Emo\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 Low End Automatic\n  02 Red Light District\n  03 When in Rome\n  04 Rich Kid Shakedown\n  05 Transintrumentalism\n  06 La Villanelle\n  07 Oncoming 2600\n  08 The Possibilities Are Endless\n  09 Day 7\n  10 Falling Asleep on Lincoln Drive\n\n  Kutztown, PA's Jazz June debuted on the scene with this well-executed disc that admittedly takes quite a bit from peers like the Promise Ring and Texas Is the Reason. Still, the group's abilities to add extremely poppy sentiments into hard rocking emo grooves makes for some memorable moments and a disc that stands above many similar mid-'90s efforts. The entire LP is extremely upbeat, with singer Andrew Low's vocals leading the way and providing for some seriously catchy hooks. The band isn't afraid of sounding tough, but they keep the melodic flow intact as well, with plenty of high notes and straightforward breakdowns. Tracks like &quot;When in Rome&quot; are instantly memorable, and after a few listens the complicated structure underneath becomes as appealing as the initial and more obvious aspects. There isn't all that much variety to They Love Those Who Make the Music, but Jazz June excel at what they do, making for like-minded but ultimately individual sounding tracks with a similar style and a bevy of equally effective variations on it. The disc was initially pressed by Workshop in 1996, but Initial Records has picked up the out-of-print record and again made it available to the masses. Plenty of bands went unheard during the emo craze of the late '90s, and most deserve to never be heard from again, but this is a disc that makes the most of its stylistic pigeonholing and ultimately ends up being a great example of the quality music produced in a then confined scene.","torrent":{"xt":"urn:btih:1cdb43d066097740c423f5fd6bbba30e8c4b8976","amp;dn":"The+Jazz+June+-+They+Love+Those+Who+Make+the+Music+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1cdb43d066097740c423f5fd6bbba30e8c4b8976","infoHashBuffer":{"type":"Buffer","data":[28,219,67,208,102,9,119,64,196,35,245,253,107,187,163,14,140,75,137,118]},"announce":[],"urlList":[]}}