{"title":"HISTORY OF POP AND ROCK MUSIC - part 400","uid":7529871,"size":526912103,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:1cfe09a740e484775eccd10dfa8e522846ebc665&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+400&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pupovaczlatko","files":-1,"time":1344898236,"description":"        \n\n\n\n\n                    PART  400\n\n\n           LEMON PIPERS -  Green Tambourine  (1967)\n           OHIO EXPRESS - Yummy Yummy Yummy  (1968)\n           THE ZOMBIES - Time Of The Season (1968)  \n\n\n\n          &quot;Green Tambourine&quot; was the primary hit by the 1960s Ohio-based rock group The Lemon Pipers, as well as the title track to their debut-album &quot;Green Tambourine&quot;. The song has been credited as being the first bubblegum pop chart-topper. Released towards the end of 1967, it peaked at number one on the U.S. Billboard Hot 100 for one week at the start of February, 1968 and earned the group a gold record for over a million copies sold. The record remained on the chart for three months.It was also the first U.S. number-one hit for the Buddah label. The Lemon Pipers would never repeat this success,                    \n          The Ohio Express was a musical recording unit, mainly active from 1967 through 1970.The best known songs of Ohio Express (including their best scoring single, &quot;Yummy Yummy Yummy&quot;) were actually the work of an assemblage of studio musicians working out of New York, including singer/songwriter Joey Levine.Yummy Yummy Yummy&quot; is a bubblegum pop song by Arthur Resnick and Joey Levine, first recorded by Ohio Express in 1968. Their version reached #4 in the U.S. Pop Singles chart and #5 in the UK Singles Chart. It has since been covered by many artists. Ohio Express was a studio concoction and none of the &quot;official&quot; members appear on the record. Joey Levine sang lead vocals. In the years since it was a hit, the song has become a cheesy staple. In Time Magazine's 2011 list of top 10 songs with silly lyrics it ranked #8. It has been used in a commercial for Kinder chocolate, in a food-themed scene in the television show The Simpsons, in Monty Python's Flying Circus in episode How Not to Be Seen, and in &quot;Last McSupper&quot; scene of the film Super Size Me.       \n         &quot;Time of the Season&quot; is a song by The Zombies, featured on their 1968 album &quot;Odessey and Oracle&quot;. It was written by keyboard player Rod Argent and recorded at Abbey Road Studios in August 1967. The song's characteristics include the unique voice of lead singer Colin Blunstone, the memorable bass riff (which is similar to Ben E. King's hit &quot;Stand By Me&quot;), and Rod Argent's fast-paced psychedelic improvisation.&quot;Time of The Season&quot; is frequently used in pop culture to represent the late 1960s. In that sense, it is featured in the films 1969, Awakenings, A Walk on the Moon and Riding the Bullet, all of which depict the year of 1969.","torrent":{"xt":"urn:btih:1cfe09a740e484775eccd10dfa8e522846ebc665","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+400","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1cfe09a740e484775eccd10dfa8e522846ebc665","infoHashBuffer":{"type":"Buffer","data":[28,254,9,167,64,228,132,119,94,204,209,13,250,142,82,40,70,235,198,101]},"announce":[],"urlList":[]}}