{"title":"The Whole Truth - David Baldacci - Audio Book Unabridged","uid":9332879,"size":874767397,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:1e19a90c635a1c75233413bdd697962a34c86dbd&amp;dn=The+Whole+Truth+-+David+Baldacci+-+Audio+Book+Unabridged&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Big-Papi","files":-1,"time":1386799112,"description":"This is the unabridged version\n-\n\nSource:  2008 12-CD Set\n-\n-\nPlease note that there are two special settings on the MP3 files in this collection\n-\nSkip Shuffle - If you have this audio book on your music player and shuffle songs none of these audio book tracks will play.\n-\nRemember Position - If you hit the stop button when the track is resumed later it will begin to play where it left off. \n-\n128vbr - This collection really doesn't require the Big Papi 320cbr rip afforded to music. Most tracks sit about 160-170kbps and that is mucho good.\n-\nAlbum Display - When viewing this audio book in your music player you will see one album with cover art with 12 discs inside. The view from the factory is typically one album for each disc and that makes for sloppy.\n-\n-\n-\n-\n-  Thanks.....Big Papi\n-\n-\n-\n\nBook: The Whole Truth\nAuthors: David Baldacci, Ron McLarty\n&quot;Matt, I need a war.&quot;So begins David Baldacci's new book--a thriller unlike any he's written before. &quot;Matt&quot; is Mathew Pender, of Pender Associates--a shadowy organization that specializes in managing seemingly impossible situations for its clients. Sometimes, those services extend to managing--and creating--armed conflict. When Matt Pender is asked by his client--the largest defense contractor in the world--to manipulate two nations against each other, a shocking and surprising series of events are set in motion that will possibly bring the world to the brink of World War III.*In this epic thriller with a global backdrop, David Baldacci delivers all the twists and turns, compelling characters, and can't-put-it-down pacing that readers have come to expect from this master storyteller.","torrent":{"xt":"urn:btih:1e19a90c635a1c75233413bdd697962a34c86dbd","amp;dn":"The+Whole+Truth+-+David+Baldacci+-+Audio+Book+Unabridged","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e19a90c635a1c75233413bdd697962a34c86dbd","infoHashBuffer":{"type":"Buffer","data":[30,25,169,12,99,90,28,117,35,52,19,189,214,151,150,42,52,200,109,189]},"announce":[],"urlList":[]}}