{"title":"The World Without Us - Alan Weisman","uid":4009870,"size":299702266,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:1e90bee704b560e36c123d5a84859fde585fc0e8&amp;dn=The+World+Without+Us+-+Alan+Weisman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"arzendiq","files":169,"time":1202025243,"description":"The World Without Us - Alan Weisman\n\nIf a virulent virus--or even the Rapture--depopulated Earth overnight, how long before all trace of humankind vanished? That&amp;#039;s the provocative, and occasionally puckish, question posed by Weisman (An Echo in My Blood) in this imaginative hybrid of solid science reporting and morbid speculation. \n\nDays after our disappearance, pumps keeping Manhattan&amp;#039;s subways dry would fail, tunnels would flood, soil under streets would sluice away and the foundations of towering skyscrapers built to last for centuries would start to crumble. At the other end of the chronological spectrum, anything made of bronze might survive in recognizable form for millions of years?along with one billion pounds of degraded but almost indestructible plastics manufactured since the mid-20th century. \n\nMeanwhile, land freed from mankind&amp;#039;s environmentally poisonous footprint would quickly reconstitute itself, as in Chernobyl, where animal life has returned after 1986&amp;#039;s deadly radiation leak, and in the demilitarized zone between North and South Korea, a refuge since 1953 for the almost-extinct goral mountain goat and Amur leopard. From a patch of primeval forest in Poland to monumental underground villages in Turkey, Weisman&amp;#039;s enthralling tour of the world of tomorrow explores what little will remain of ancient times while anticipating, often poetically, what a planet without us would be like.\n\n10 CDs, 12 hours. VBR 44KHz mono Ogg Vorbis","torrent":{"xt":"urn:btih:1e90bee704b560e36c123d5a84859fde585fc0e8","amp;dn":"The+World+Without+Us+-+Alan+Weisman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e90bee704b560e36c123d5a84859fde585fc0e8","infoHashBuffer":{"type":"Buffer","data":[30,144,190,231,4,181,96,227,108,18,61,90,132,133,159,222,88,95,192,232]},"announce":[],"urlList":[]}}