{"title":"[DVDRip-Divx-Ita-Mp3]Un corpo da reato[survivalofmisa]","uid":5145485,"size":956780544,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1ef02b1fb0d9ac4df6030348c7800cdcab51c8e4&amp;dn=%5BDVDRip-Divx-Ita-Mp3%5DUn+corpo+da+reato%5Bsurvivalofmisa%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mitimex","files":1,"time":1257240770,"description":"\n\nTre uomini raccontano il loro incontro con la donna che ha sconvolto (e anche qualcosa di piÃƒÂ¹) le loro vite. Randy, l'uomo che ha vissuto con lei, ne parla con un killer di provincia a cui chiede di ucciderla mentre sta giocando al Bingo. Suo cugino, l'avvocato Carl, racconta di come ha sfogato con lei le proprie pulsioni masochiste a un'analista che passa dall'indifferenza alla finta partecipazione. Il detective Dehling si trova invece a indagare su di lei e a trovarsene perdutamente innamorato sentendosi in dovere di confessare tutto a un sacerdote amico e curioso. Lei ÃƒÂ¨ Jewel, una dark lady di provincia con aspirazioni da casalinga frustrata. Il finale ipertruclento mescola i fratelli Farrelly (quelli di Tutti pazzi per Mary) a citazioni musicali (Village People) a &quot;omaggi&quot; cinefilo-douglasiani ( Un giorno di ordinaria follia). Michael Douglas si ritaglia una caratterizzazione azzeccata. Il trio di attori Jewel-dipendenti regge bene il ritmo delle tre narrazioni. Ma chi, dopo film in cui appariva imbolsita e un po' spenta, ÃƒÂ¨ tornata in piena forma fisica e recitativa ÃƒÂ¨ Liv Tyler. La ragazzina che cerca di capire il mondo ÃƒÂ¨ scomparsa. C'ÃƒÂ¨ un attrice che puÃƒÂ² reggere il confronto con la Kidman di Da morire.\n","torrent":{"xt":"urn:btih:1ef02b1fb0d9ac4df6030348c7800cdcab51c8e4","amp;dn":"%5BDVDRip-Divx-Ita-Mp3%5DUn+corpo+da+reato%5Bsurvivalofmisa%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ef02b1fb0d9ac4df6030348c7800cdcab51c8e4","infoHashBuffer":{"type":"Buffer","data":[30,240,43,31,176,217,172,77,246,3,3,72,199,128,12,220,171,81,200,228]},"announce":[],"urlList":[]}}