{"title":"Lead Balloon Season 01 Complete","uid":4587922,"size":1309645960,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1f9551342d2f056382d14bc1c22f6e5791f8f00b&amp;dn=Lead+Balloon+Season+01+Complete&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jmjmjm","files":6,"time":1229708108,"description":"When Rick Spleen (Jack Dee) was younger he dreamed of being a great stand up comic. Unfortunately, this didn't turn out so well. Now, he's a burnt out comedian who spends too much time arguing with his American co-writer Marty, is continually distracted by his family who are after his money (which he avoids spending at all costs!) and by Michael, the local cafe owner.\n\nSeason 1\n\nS01 E01     4 Oct 06   Rubbish     \nRick needs to get a christening present for a baby and on his travels he has to deal with Maureen, the mad shopkeeper, and Michael, the local cafe owner. Rick's career takes another turn for the worse after his latest show doesn't turn out well. \n\nS01 E02     11 Oct 06   Wayne\nRick is having a bad time of it at the moment, he has to deal with an electrician who is very sarcastic and stealing spoons from the cafe doesn't turn out to be the best move. At work, neither of the pair can come up with good material for his latest project.\n\nS01 E03     18 Oct 06   Ã‚Â£5000\nRick finds himself in the middle of a fight at an awards ceremony and can't find anyone who will sympathise with him. He also learns he donated a lot of money to the cafe which he needs to wiggle himself out of somehow. \n\nS01 E04     25 Oct 06   Allergic\nRick fears he may have killed Bob Fairchild, a famous British entertainer but with Rick being Rick he's more worried when his shoe-organiser doesn't turn up. Rick is supposed to be appearing on a news show in the near future and much to his annoyance, Michael thinks he knows what's best to put on the show. \n\nS01 E05     1 Nov 06   Pistachio\nRick once again doesn't think about what he's doing and buys himself a scooter which he believe makes him look gay. To combat this he buys a leather jacket and makes homophobic jokes at an award ceremony which doesn't go down well with the audience.\n\nS01 E06     8 Nov 06   Fatty\nAdam Greene, a talk show host, makes fun of Rick by incinuating that he's getting a bit bigger around the waistline, so Rick decides to do something about it. To make matters worse, his new DVD player is broken and he has an unpleasant experience at the gym.","torrent":{"xt":"urn:btih:1f9551342d2f056382d14bc1c22f6e5791f8f00b","amp;dn":"Lead+Balloon+Season+01+Complete","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f9551342d2f056382d14bc1c22f6e5791f8f00b","infoHashBuffer":{"type":"Buffer","data":[31,149,81,52,45,47,5,99,130,209,75,193,194,47,110,87,145,248,240,11]},"announce":[],"urlList":[]}}