{"title":"Jude - Highway Child (2003)  JPOP 320 vtwin88cube","uid":6117270,"size":156087728,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1ffb51b8f089eaa67d57498d8b105f13364563aa&amp;dn=Jude+-+Highway+Child+%282003%29++JPOP+320+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1295607820,"description":"Jude\nHighway Child (2003)\n\nJunk Magnet Says...\n\nKenichi Asai is a musical force to be marveled at. After his Blankey Jet City party ended, he stretched his wings with the Sherbets and Ajico.\n\nBoth of his new outfits did their time and then disbanded, but now Kenichi is back with Jude (pronounced &quot;Yu-day&quot;) his latest masterpiece. Think of latter-day BJC crossed with little touches of sonic superiority. All out primal rock meets loaming melodies, to great effect.\n\nAs soon as I found out about Jude's existence (from Kenichi's official page, SexyStones), I rushed to acquire their body of work. I wasn't disappointed, because their last three albums are objects to treasure.\n\n[Charming Bloody Tuesday] and [Dirty Animal] came out on the same day in 2002, so one can safely call them a distributed double album. The first is sweeter sounding, with the almost poppy sounding [Silvet] being the exemplary single. [Dirty Animal] has more of a punch and kick to it, and the single [Devil] brings out the dirty guitar strings for a little surf rockabilly garage action. Taken as a whole, these two albums have practically something for everybody, and are highly recommended.\n\nHowever, the jewel of the bunch is [Highway Child], which came out a year later, and is so great that I've listened to it practically every day since I received it. It represents the Jude quintessence - the energy of Blankey Jet City combined with the slink of Ajico and the slap of Sherbets. The beautiful first track, [ARABIA], even brings in the violin (courtesy of Aya Tamaki), creating an almost filmic sountrack to travel the rest of the album with. Furthermore, the astonishing UA provides backing vocals to [Happa No Ouchi], which is a treat for all Ajico fans. In between those bookending tracks are marvels like [Wild Bebi], [Accele], [Sleeping Charley], and [Kaisuiyoku], a perfect single if there ever was one. Every single track has something special to offer, and you have to give it up for Jude, a dream now realized.\n\nYou think I'm exaggerating, but you just haven't been introduced to the kind of bliss I'm now familar with. Complicated yet effortless, Kenichi's compositions are something you are better off experiencing. Yes, they're 99% Japanese lyrically, but you don't need to understand to appreciate.\n\nMembers:\n\nKenichi Asai: Vocals, Guitar\nKeiichi Watanabei: Bass\nJunji Ikehata: Drums\nKyoichi Shiino: Drums\nHiroshi Kido: Drums (Zhivago)\n\nChannels:\t\t2 (stereo)\nSample Rate:\t\t44.1 KHz\nSample Size:\t\t16 bit\nBit Rate:\t\t320 kbps\n\nAudio Quality:\t\tVery High (Lossy)\nEncoder:\t\tLAME 3.98r\nEncoder Settings:\tConstant Bit Rate 320 kbps (Insane)\nContains:\t\tAlbum Art, ID Tag [ID3v2.3 (ANSI) &amp; ID3v1.1]\n\nFormat:\t\t\tMp3\nGenre:\t\t\tJRock\t\t\nM3U Playlist:\t\tYes\n\n01.Arabia\n02.Wild Bebi\n03.Emerald\n04.Accele\n05.Diduri Didura\n06.Atarashii Kaze\n07.Sleeping Charley\n08.Kaisuiyoku\n09.Chopper\n10.Pistol Bird\n11.Happa No Ouchi\n12.Hourou\n\n\nCheers!","torrent":{"xt":"urn:btih:1ffb51b8f089eaa67d57498d8b105f13364563aa","amp;dn":"Jude+-+Highway+Child+%282003%29++JPOP+320+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ffb51b8f089eaa67d57498d8b105f13364563aa","infoHashBuffer":{"type":"Buffer","data":[31,251,81,184,240,137,234,166,125,87,73,141,139,16,95,19,54,69,99,170]},"announce":[],"urlList":[]}}