{"title":"Complete Commodore 64 music archive (0 - 36,081) - 7tux","uid":4641167,"size":53153245,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:209cc945befe44272444e2def3efdc5e252b3f9f&amp;dn=Complete+Commodore+64+music+archive+%280+-+36%2C081%29+-+7tux&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"seventux","files":1,"time":1231716527,"description":"###################################################\n\nComplete Commodore 64 music archive (0 - 36,081) - 7tux\n\n###################################################\n\nThe High Voltage SID Collection - Commodore 64 music for the masses\n\nThe High Voltage SID Collection (HVSC) is a freeware hobby project which organises Commodore\n64 music (also known as SID music) into an archive for both musicians and fans alike. The work\non the collection is done completely in the Team and contributors' spare time and is proudly\none of the largest and most accurate computer music collections known.\n \n\n.Brief SID History:\nWhat exactly is a Commodore 64 (C64) SID tune? Basically it is music originally generated on the C64, a popular family computer from the '80s. The C64 was undoubtedly ahead of its time offering many advanced features for a relatively cheap price. One particular advanced feature on the C64 was the Sound Interface Device (SID) chip  developed in 1982 by Bob Yannes  . The remarkable capabilities of this chip caused a revolution in the computer music industry. The chip was so revolutionary in fact that Byte Magazine named the chip one of the Top 20 most important chips in computing history (see Byte's 20th Anniversary tribute edition, 1996).\n\nAlthough the design of the chip was quite a feat, the true test of technology is what people can do with it. The early musical pieces on the C64 were impressive for that time frame, but the hidden potential of the chip wasn't heard until 1985. Composers began to use audio &quot;illusions&quot; that tricked the ear into hearing more voices than the three-voice chip actually had. The music continued to progress in 1987 when musicians began to utilize a fourth voice which was dedicated for samples. Although many other improvements to SID music have been made over the years, none were as important as the two just mentioned.\n\nMore importantly, though, was the release of this technology to the C64 public world. Back then, composers had to also program their own tools otherwise the composers would have to create their music using primitive software. Due to a competitive game musician market, however, musicians were reluctant to share their knowledge. Through reverse-engineering and some eventual leaks, the C64 public soon utilized some of these advanced music tools creating a boom in the amount of quality music available.\n\nThroughout the 1990s, the C64 game industry may have ceased to a halt, but there are still many musicians who compose for demo groups, who still enjoy the challenge of squeezing as much as they can out of the SID chip. Most of these new tunes will hold special memories for people, but in a different way in that you'll remember them from demo X or Y rather than as a game soundtrack. \n &lt;a href=&quot;\nhttp://www.hvsc.c64.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hvsc.c64.org/&lt;/a&gt;\n\nPlayers/Plugins: &lt;a href=&quot;\nhttp://www.gsldata.se/c64/spw/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.gsldata.se/c64/spw/&lt;/a&gt; (player) &lt;a href=&quot;\nhttp://www.winamp.com/plugins/details/144643&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.winamp.com/plugins/details/144643&lt;/a&gt; (winamp plugin)\n\n_-7tux-_","torrent":{"xt":"urn:btih:209cc945befe44272444e2def3efdc5e252b3f9f","amp;dn":"Complete+Commodore+64+music+archive+%280+-+36%2C081%29+-+7tux","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"209cc945befe44272444e2def3efdc5e252b3f9f","infoHashBuffer":{"type":"Buffer","data":[32,156,201,69,190,254,68,39,36,68,226,222,243,239,220,94,37,43,63,159]},"announce":[],"urlList":[]}}