{"title":"Primal Fear-16.6 Before the Devil Knows Youre Dead-Ltd.Ed.-","uid":4912531,"size":122946857,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:20a78a421e864ef1696ee9b7703823068abe14db&amp;dn=Primal+Fear-16.6+Before+the+Devil+Knows+Youre+Dead-Ltd.Ed.-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PoisonI","files":18,"time":1243248511,"description":"ARTiST..Primal Fear\nTiTLE...16.6 Before The Devil Knows You're Dead\nGENRE...Power Metal \nGRABBER...EAC\nENCODER...Lame\nLABEL...frontier records \nYEAR....2009\nQUALiTY...avg. 225kbps\nSOURCE..CDDA \nMODE....Joint-Stereo\nPLAYTIME...69:32 min \nREL.DATE...05.23.2009\nTRACKS..15\nRiPPER..TEAM OMA\nSiZE...117,2 MB \nSUPPLiER...TEAM OMA \n\nBand:\n\nRalf Scheepers (vocals)\nHenny Wolter (guitars)\nMagnus Karlsson (guitar, keyboards)\nRandy Black (drums)\nMat Sinner (bass, vocals)\n\nTracklist:\n\n01 Before the Devil Knows You're Dead 00:49\n02 Riding the Eagle 04:59\n03 Six Times Dead (16.6) 04:00\n04 Black Rain 06:07\n05 Under the Radar 05:26\n06 5.0, torn 07:14\n07 Soar 04:17\n08 Killbound 04:13\n09 No Smoke Without Fire 04:52\n10 Night After Night 05:01\n11 Smith &amp; Wesson 04:46\n12 The Exorcist 04:47\n13 Hands of Time 04:22\n14 Cry Havoc (bonus track) 04:00\n15 Scream (bonus track) 04:39\n\nTOTAL: 69:32 \n\nRelease Notes:\n\nIf you're talking about Europe's top metal acts the discussion is heading straight towards Primal Fear. Former Gamma Ray vocalist Ralf Scheepers and bassist/vocalist Mat Sinner, two of the most respected German Metal musicians founded the band in late 1997. They recorded their first Primal Fear songs for JVC in Japan, together with drummer Klaus Sperling and guitarist Tom Naumann. They got signed immediately and Germany's best-kept secret soon became a target for many of the European record companies. The band finally signed to Nuclear Blast Records in early 1998. The debut album, simply called Primal Fear was released in March 1998 and entered the German album charts at number 48, soon followed by similar chart success in Japan. The band recruited guitarist Stefan Leibing to their line up and started touring with Running Wild and Hammerfall. The second PF album Jaws Of Death entered the German Charts at number 49 in July 1999, followed by their first headlining World Tour. The tour was a huge success and included countries such as Brazil, Japan and of course Europe. Primal Fear released another 3 very successful studio albums (&quot;Nuclear Fire&quot;, &quot;Black Sun&quot; and &quot;Seven Seals&quot;) that entered the Top 100 charts in many European countries. After some line-up changes (that brought in Canadian drummer Randy Black) and the release of a &quot;Best of&quot; album aptly entitled &quot;Metal Is Forever&quot;, Primal Fear waved goodbye to Nuclear Blast and signed a new recording contract with Frontiers Records. The first album for the new label was released in September 2007 and named &quot;New Religion&quot; Starbreaker and Allan/Lande producer/guitarist Magnus Karlsson helped out with two stunning guitar solos, before Henny Wolter rejoined the band and played some more lead &amp; rhythm guitars on the album. Epica's lead singer Simone Simons was invited to the studio to sing the first duet in Primal Fear recording history, the song Everytime It Rains. The album was mixed by Ronald Prent (Rammstein, Iron Maiden, Manowar). After a three month co-headlining European Tour with Udo, a headlining Japanese tour and a co- headlining show at the Progpower Festival in Atlanta/US, the band embarked on their &quot;10 Years Of Metal&quot; 2008 anniversary tour including new guitarist Magnus Karlsson, who finally joined the band. After a massive summer Open Air schedule, the band started the pre-production at Karlsson's Stuntguitar Music studio in Sweden. With 14 new songs written by the band, Primal Fear entered the House Of Music studios with engineer Dennis Ward, mixing engineer Achim Koehler and producer Mat Sinner. The result of the new album is the most powerful, ambitious and interesting album in Primal Fear's history. The vibe of songs like the opening track &quot;Riding The Eagle&quot;, &quot;Killbound&quot; or &quot;Under The Radar&quot; are reminiscent of the &quot;Nuclear Fire&quot; album. You will find all the trademarks of the Primal Fear sound and the total dedication to pure Metal. There is also a new approach mixed with PF riffs in tracks like &quot;Six Times Dead (16.6)&quot;, &quot;Soar&quot;, &quot;Smith &amp; Wesson&quot; as well as the epic stories, consummate musicianship, courage and fantastic melodies in songs like &quot;Black Rain&quot;, &quot;No Smoke Without Fire&quot;, &quot;Torn&quot; and the stylistically new ballad &quot;Hands Of Time&quot; with the 4 guys all sharing the lead-vocals. Once again Primal Fear display a very high standard of song writing, sound and the production. A video clip was shot for the albums title track &quot;Six Times Dead (16.6)&quot;. Karlsson &amp; Wolter shine with a new dimension to the guitar work, and lead vocalist Ralf Scheepers reaches a new level to his vocal performances. Nothing can go wrong if you're backed by one of the best rhythm sections in metal with Randy Black and Mat Sinner and you can hear the result on Primal Fear's outstanding new message called &quot;16.6&quot;! The Primal Fear 16.6 World Tour starts in August in South America, followed by a US tour that includes a visit to this years Progpower X festival and an extensive European Tour that kicks off on Sept. 24th. A tour through Japan &amp; Asia is already be scheduled.\n\nEnjoy and please seed after you have finished download as long as you can.","torrent":{"xt":"urn:btih:20a78a421e864ef1696ee9b7703823068abe14db","amp;dn":"Primal+Fear-16.6+Before+the+Devil+Knows+Youre+Dead-Ltd.Ed.-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20a78a421e864ef1696ee9b7703823068abe14db","infoHashBuffer":{"type":"Buffer","data":[32,167,138,66,30,134,78,241,105,110,233,183,112,56,35,6,138,190,20,219]},"announce":[],"urlList":[]}}