{"title":"MTCDC-NMC 05 DC Comics from All-Alo (joshua13","uid":6419605,"size":15383696538,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:20f23f24b9f95755e196bb75e60338a9e0dcc300&amp;dn=MTCDC-NMC+05+DC+Comics+from+All-Alo+%28joshua13&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":9,"uploader":"joshua13","files":-1,"time":1306271397,"description":"The More than Complete DC-Now More Completerer!\n\nPart Five\n\nWhat's This?\n     It's a project to upload everything that's been scanned that DC ever published or distributed, whatever name was on the cover. That's DC, Vertigo (ugghh!)Ã‚Â®, Wildstorm, Helix, Milestone, Minx, Paradox, Piranha, Tangent, America's Best Comics, Cliffhanger, CMX, Homage, Humanoids, and MC.Gaines among others.\n       Plus, for characters and titles DC picked up from other companies, as much of those &quot;Pre-DC&quot; comics as I can find. This includes many major and minor DC superheroes, war comics, romance comics and various licensed characters such as Tarzan, Star Trek, Loony Toons, Scooby-Doo etc. A few of the heros include Shazam!, Blue Beetle, Plastic Man, Gen13, The Web, The Shield, Phantom Lady, Captain Atom and many more. There may be a lot of things you didn't know started with a different company. There will some &quot;Post DC&quot; comics of characters like Fallen Angel that have moved on. But that will be arbitrarily selective on my part. Assorted related material will be included. It's going to be 750-800gb in total. It will take a year or two. I've already done a 600+gb subset of this in an earlier project (MTCDC). So clearly, I'm insane, which is what you look for in a guy promising this. So here we go again, but bigger.\n\nThis fifth alphabetical installment is: All-Alo\n\nScreen of cover thumbnails here\n &lt;a href=&quot;\nhttp://img830.imageshack.us/img830/5347/mtcdcnmc05.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img830.imageshack.us/img830/5347/mtcdcnmc05.jpg&lt;/a&gt;\n\t\n\tWe have have a great mixture today. I think we've got a good day or two of torrenting ahead of us. Now lets all share together, and we won't have anyone left out. Remember your training. Focus on the goal (Zattana).  Now I know some people seem to prefer another team's torrents, but I'm confidant that this lineup can beat the best those other guys have to offer. (I'm looking at you, PeteThePipster) We've got the golden age Flash in his own title as well as the whole JSA in All-Star Comics from the the 1940s and the 1970s. We've got Batman and Superman from the animated DCU. We have war stories, (the sanitized, nothing like the real thing variety) cowboys and indians or if you prefer, Cowboys and Native Americans  or even Bovine-Citizen Enslavers - too silly, but to each his own. We even have Muhammed Ali and Rudolph the Red-Nosed Reindeer - if we haven't exported that particular american christmas story to your country, google and learn.\n\n\tOh just kidding about PTP's Marvel torrents. \n\n\tNow totally unrelated to these comics but solely because I can, I'mm going to clarify something from my last post. IF you haven't heard the following you my have been confused by my references to the end of the world. No I'm not crazy, and btw I was positively not suicidal despite my reference to suicide - that was just a joke.\n\tYou may not have heard that a man in the USA who runs a radio bible teaching organization got a bit of a bee in his bonnet this last year or so. (sorry non-native english speakers, google that idiom). He decided that he could calculate the exact day of the Bible's predicted return of Christ and the end of the world as we know it. That this goes against all reasonable interpretation of the Bible according to nearly all the rest of Christendom throughout history and secular scholars of the bible as well. (estimate 99.99% Plus)\n\t He said it was going to be May 21st. A bunch of people believed him and spent a lot of time and money telling others. Some even quit their jobs or school and spent every dime they had out of concern for the rest of us. Az Zaphod Beeblebrox might have said &quot;Ten out of Ten for dedication to Christ and loving their neighbors, minus several million for not using their heads.&quot;\n\n\tSo this relates to comics how? If this had happened I would either be gone to heaven with Christ, or we'd all be enduring a 5 month long destruction of the earth and not even the super heroes in today's comics could have stopped it.\n\t\n\tThis just in - the failed predictor decided not to own up, but rather took the disappointing, but historically popular &quot;spiritualize the prediction&quot; route. So he says he was not wrong on the date, but he had misunderstood that it was it was an invisible, heavenly judgement. We are still on track for the ultimate end in October, says he. He's 89, so maybe he'll be dead by then and avoid his next tap-dance for the press. Otherwise I'm looking forward to his next story.\n\n\tStill you never know. The world could end. Maybe there's a nice big, fast moving comet out there with our name on it that will be appearing in a telescope near you any second now.\n\n\tSuperman! HELP!\n\nToday's offering: All-Alo\n\nDC Comics\n\nBTW I was quite picky about All-XXXX vs &quot;All XXXX&quot;. I don't care what the cover says, it got a dash or not depending on the indica. One title changed after a few issues but I decided to let that slide rather than spilt it into two folders. That's inconsistent with what I do elsewhere. Maybe the degree of consistency I already display is foolish, hmm?  &quot;A foolish consistency is the hobgoblin of little minds, adored by little statesmen and philosophers and divines&quot; I'm misusing that quote, but Ralph won't mind. Ralph's dead. \n\n\n\nAll Flash Quarterly 01-05 - renamed &quot;all flash&quot; at #6 (1941-42)\n\nAll Flash 001-2 covers (One Shot) (09-2007)\n\nAll Funny Comics 01-23 (1943-48)\n\nThe All New Atom v1 (Atom II Ryan Choi) 01-25 (2006-2008)\n\nAll New Batman-Brave &amp; the Bold 001-xxx (2011-20xx)\n\nAll New Collectors' Edition C-53-Rudolph 68p  (Winter 1977)\nAll New Collectors' Edition C-54-Superman vs Wonder Woman (1978)\nAll New Collectors' Edition C-55-Superboy &amp; The Legion of Super-Heroes\nAll New Collectors' Edition C-56-Superman vs. Muhammad Ali (1978)\n\textra - Neal Adams Superman vs. Muhammed Ali-Sketches &amp; Variants\nAll New Collectors' Edition C-58-Superman vs. SHAZAM! (1978)\nAll New Collectors' Edition C-60-Rudolph's Summer Fun 68p (Summer 1978)\nAll New Collectors' Edition C-62-Superman the Movie ctc (1979)\n\t\n\tC-57, C-59, and C 61 were not used as numbers for this title.\n\nAll-Star Batman &amp; Robin, The Boy Wonder 01-10 (2005-2008)\nAll Star Batman &amp; Robin, the Boy Wonder 01 45p Special Edition (Pencil &amp; Script)\nAll Star Batman &amp; Robin, the Boy Wonder 10 uncensored pages\nAll Star Batman &amp; Robin, the Boy Wonder 10-Nearly Wordless Variant (2008)\n\nAll-American Comics 001-102 (1939-1948)\nAll-American Comics v2 001-JSA Returns (05-1999)\nAll-American Comics alternates\nAll-American Comics Reprints\n\nAll-American Men of War 127-128, 002-117 after All American Western 126\n\nAll-American Western 103-126 After All-American Comics 102\n\nAll-Flash 06-32 After All Flash Quarterly 05 (1942-1947)\n\nAll-Out War 01-06 (1979-80)\n\nAll-Star Comics v1 01-57 (1940-1951)\nAll-Star Comics v1 58-74 (1976-1978)\nAll-Star Comics v1 Reprints\nAll-Star Comics v2 01-02 (1999)\nAll-Star Comics v2 001-RRP Special Edition Variant (1999).jpg\nAll-Star Comics 80 Page Giant 001 (09-1999)\nAll-Star Comics Archives Covers\nAll-Star Comics Archives v1 276p HC\nAll-Star Comics Archives v8 210p HC\nAll-Star Comics Revue-Index, etc\nMillennium Edition 026-All-Star Comics 003 ctc (2000)\n\nAll-Star Squadron 01-67 (1982-1986)\nAll-Star Squadron Annuals 01-03 (1982-1984)\n\nAll-Star Superman 001-12 (2006-2008)\nAll-Star Superman DVD Maquette.jpg\n\nAll-Star Western v1 058-119 after All Star Comics 57 (1951-1961)\nAll-Star Western v2 01-11 (1970-72)\nMillennium Edition 017-All-Star Western v2 010\n\nPre-DC Comics \nNot your biggest or more successful DC characters, but Blue Beetle for on has managed to have some prominance along the way.\n\nAll New Adventures of the Mighty Crusaders v1 01-13 (Red Circle-Archie(1983-85)\nThese guys from the Red Circle-Radio-Archie comics company were first brought into DC in the !mpact imprint in a revised version and in 2009 became mainstream DCU in a different but more classic version, but their DC comics are not being published at the moment. Who knows what the future may hold. \n\nAll Top Comics-Phantom Lady, Blue Beetle 01-17 (Fox(1945-49)\nNot all the issues of All Top Comics included have these pre-dc characters (Phantom Lady &amp; Blue Beetle) but I don't like to put up partial titles so Give you all I have.\n\nAll-New Comics (Harvey-Boy Heroes\nAgain, Boy Heroes are not necessarily in all issues included but I include all the issues I have.\n\n\n===============================================\n\nPlease Seed! Lots of people will start on the series months or even a year or two from now. You are their only hope to complete their downloads.\n\n=========================================================================\nThanks to the Scanners and editors, and thanks to the seeders, the\nanonymous folk that make the work of the scanners and uploaders multiply!\n=========================================================================\nSee Yah!\n\n13\n\nYou can see my other torrents at \n\nd-e-m-o-n-o-id.me/files/?uid=1213225&amp;seeded=2\n\nor\n-h-3-3-t.com-/userdetails.php?id=72866\n\nor &lt;a href=&quot;\nhttp://thepiratebay.se/user/joshua13/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/joshua13/&lt;/a&gt;","torrent":{"xt":"urn:btih:20f23f24b9f95755e196bb75e60338a9e0dcc300","amp;dn":"MTCDC-NMC+05+DC+Comics+from+All-Alo+%28joshua13","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20f23f24b9f95755e196bb75e60338a9e0dcc300","infoHashBuffer":{"type":"Buffer","data":[32,242,63,36,185,249,87,85,225,150,187,117,230,3,56,169,224,220,195,0]},"announce":[],"urlList":[]}}