{"title":"Miss Fury v2 1-6 &amp; Digital First 1-6 (Dynamite)(2013)(Empire","uid":8998290,"size":333376391,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:23893ce881080c5e4a3190f7c1057c1ce8743ac2&amp;dn=Miss+Fury+v2+1-6+%26amp%3B+Digital+First+1-6+%28Dynamite%29%282013%29%28Empire&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"muckymucks","files":-1,"time":1380912760,"description":"The upload for these titles are really sketchy because there's two different titles and it's a bit confusing to know which issue belongs with what series, so I decided to compile everything for the sake of clarity.\n\nIncluded in the on-going series Miss Fury published by Dynamite that started in April, 2013. This is volume 2 and it contains all the issues released so far.\n\nIn August, Dynamite decided to release a new series called Miss Fury Digital First and that's included here as well with all issues out so far.\n\nThere's also a 1991 one-shot in here, or at least it says it's a one-shot on the credits of the issue, but I'm reading some news articles that mention a 4-issue mini-series that was also published around that time, but this isn't it and I can't find that mini-series at all.\n\nSo, that's it. If you like pulpy Golden Age characters getting a second chance in modern times this might be the series for you. Hopefully, from here on out we can link to this torrent as more issues come out for others to catch up rather than spend the better part of an hour trying to figure out what's going on with this series (only to figure out there were two of them!)","torrent":{"xt":"urn:btih:23893ce881080c5e4a3190f7c1057c1ce8743ac2","amp;dn":"Miss+Fury+v2+1-6+%26amp%3B+Digital+First+1-6+%28Dynamite%29%282013%29%28Empire","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23893ce881080c5e4a3190f7c1057c1ce8743ac2","infoHashBuffer":{"type":"Buffer","data":[35,137,60,232,129,8,12,94,74,49,144,247,193,5,124,28,232,116,58,194]},"announce":[],"urlList":[]}}