{"title":"Introduction To Languages and the Theory of Computation 3rd Ed b","uid":4771733,"size":67940289,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:239f208a4f7f10f61f67ab0ccb1c349a96d8774e&amp;dn=Introduction+To+Languages+and+the+Theory+of+Computation+3rd+Ed+b&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"codumon","files":-1,"time":1237063566,"description":"Introduction to Languages and the Theory of Computation, 3rd Edition by John C. Martin\nHardcover,  560 pages\nISBN-13 9780072322002\n\t\nDescription\n\nIntroduction to Languages and the Theory of Computation is an introduction to the theory of computation that emphasizes formal languages, automata and abstract models of computation, and computability; it also includes an introduction to computational complexity and NP-completeness. Through the study of these topics, students encounter profound computational questions and are introduced to topics that will have an ongoing impact in computer science. Once students have seen some of the many diverse technologies contributing to computer science, they can also begin to appreciate the field as a coherent discipline. A distinctive feature of this text is its gentle and gradual introduction of the necessary mathematical tools in the context in which they are used. Martin takes advantage of the clarity and precision of mathematical language but also provides discussion and examples that make the language intelligible to those just learning to read and speak it. The material is designed to be accessible to students who do not have a strong background in discrete mathematics, but it is also appropriate for students who have had some exposure to discrete math but whose skills in this area need to be consolidated and sharpened.","torrent":{"xt":"urn:btih:239f208a4f7f10f61f67ab0ccb1c349a96d8774e","amp;dn":"Introduction+To+Languages+and+the+Theory+of+Computation+3rd+Ed+b","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"239f208a4f7f10f61f67ab0ccb1c349a96d8774e","infoHashBuffer":{"type":"Buffer","data":[35,159,32,138,79,127,16,246,31,103,171,12,203,28,52,154,150,216,119,78]},"announce":[],"urlList":[]}}