{"title":"Alex Jones Show - 2014 July 17 TH [sebaygo1]","uid":10576529,"size":62482592,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:23fa4e8c9bd4f8dcf8adbcc29d1d5827cefd0cb9&amp;dn=Alex+Jones+Show+-+2014+July+17+TH+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sebaygo1","files":10,"time":1405642735,"description":"\nThe Alex Jones Show\nThursday, 17 July 2014\n\n\n[sebaygo1]\n\n\nShow Description\n................\nFrom the Infowars web site :: On this Thursday, July 17 edition of The Alex Jones Show, Nightly News host David Knight hosts the first hour. David covers the news and features Alex's special report centered around a disturbing Guardian Centers video. Guardian Centers is an 830 acre &quot;disaster preparedness and tactical training validation center&quot; located in Georgia which is routinely used by FEMA and other government agencies to practice emergency response procedures. \n\nAlex covers Rex84 and other government and military exercises designed to facilitate martial law in America. \n\nOn today's worldwide broadcast Alex talks with political documentary filmmaker Joel Gilbert about his latest film, There's No Place Like Utopia, a humorous and horrifying exploration of Progressivism, amnesty for illegals, race relations, Islam in America, political correctness, and Barack Obama. \n\nAlex also welcomes Dr. Peter Glidden (of Youngevity) back to the show. He is an advocate of wholistic health. His latest book is The MD Emperor Has No Clothes: Everybody Is Sick and I Know Why.\n\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n\n It is my opinion that in this time it is virtually\n essential to seek information from a variety of sources, \n to listen to a spectrum of voices in order to better \n understand the &quot;big picture.&quot; A reliance solely upon\n mainstream corporate media for news and info is a \n prescription for ignorance. I try to share information\n that counters the monotone of mainstream corporate media.\n \n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents. \n\n Think for yourself!\n To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n\n !! please try some of the other shows I upload too !!\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n.","torrent":{"xt":"urn:btih:23fa4e8c9bd4f8dcf8adbcc29d1d5827cefd0cb9","amp;dn":"Alex+Jones+Show+-+2014+July+17+TH+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23fa4e8c9bd4f8dcf8adbcc29d1d5827cefd0cb9","infoHashBuffer":{"type":"Buffer","data":[35,250,78,140,155,212,248,220,248,173,188,194,157,29,88,39,206,253,12,185]},"announce":[],"urlList":[]}}