{"title":"Celestia Portable Space Simulator","uid":4558991,"size":48993407,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:24c4a3aa28a7c1a027d6d57e4d6994783fdd9612&amp;dn=Celestia+Portable+Space+Simulator&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jmb2012","files":2,"time":1228598327,"description":"Celestia Portable\nthe portable space simulator\n\nCelestia Portable is the popular planetarium program packaged with a PortableApps.com Launcher as a portable app, so you can view the universe in 3-D anywhere. It has all the same great features as Celestia including 3-D planet viewing, viewing over 100,000 stars, traveling beyond our galaxy, and more. Plus, it leaves no personal information behind on the machine you run it on, so you can take your favorite astronomy program with you wherever you go.\n\n\nFeatures\n\nUnlike most planetarium software, Celestia doesn't confine you to the surface of the Earth. You can travel throughout the solar system, to any of over 100,000 stars, or even beyond the galaxy. All movement in Celestia is seamless; the exponential zoom feature lets you explore space across a huge range of scales, from galaxy clusters down to spacecraft only a few meters across. A 'point-and-goto' interface makes it simple to navigate through the universe to the object you want to visit. Celestia is expandable. Celestia comes with a large catalog of stars, galaxies, planets, moons, asteroids, comets, and spacecraft. If that's not enough, you can download dozens of easy to install add-ons with more objects.\n\nFile size: 22MB (download), 43MB (installed)\n\nSystem Requirements: Windows 95/98/Me/2000/XP/Vista\n\n\nin this torrent there is the installer, and there is the portable which is in the zip folder enjoy\n\njmb2012","torrent":{"xt":"urn:btih:24c4a3aa28a7c1a027d6d57e4d6994783fdd9612","amp;dn":"Celestia+Portable+Space+Simulator","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24c4a3aa28a7c1a027d6d57e4d6994783fdd9612","infoHashBuffer":{"type":"Buffer","data":[36,196,163,170,40,167,193,160,39,214,213,126,77,105,148,120,63,221,150,18]},"announce":[],"urlList":[]}}