{"title":"Xrecode II 1.0.0.203 Final + Portable by pmp317","uid":8539282,"size":38524797,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:24ea73a1bced41b9a95dc4c648cd0a6e19bcc2e3&amp;dn=Xrecode+II+1.0.0.203+Final+%2B+Portable+by+pmp317&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pmp317","files":-1,"time":1370352179,"description":"xrecode II is converter and audio-grabber which allows you to convert from mp3, mp2, wma, aiff, amr, ogg, flac, ape, cue, ac3, wv, mpc, mid, cue ,tta, tak, wav, wav(rf64), dts, m4a, m4b, mp4, ra, rm, aac, avi, mpg, vob, mkv, mka, flv, swf, mov, ofr, wmv, divx, m4v, spx, 3gp, 3g2, m2v, m4v, ts, m2ts, adts, shn, tak, xm, mod, s3m, it, mtm, umx, mlp to m4a, alac, ape, flac, mp3, mp4 (using NeroAAC), ogg, raw, wav, wav(rf64), wma, WavPack, mpc, mp2, Speex, ofr, ac3, aiff, tak, snd, Shorten and Opus formats. Command Line parameters are supported (see Command Line). \n\nFeatures\n- Works on XP, Vista, Windows 7, Windows 8 32/64 bit versions and under Wine.\n- Parallel conversion by utilizing power of multi-core CPUs.\n- Support of embedded CUE sheets (for FLAC, WavPack, APE and TAK files).\n- Support of mp4, mka chapters (can split mp4, mka by chapters to any supported format).\n- Built-in Metadata editor with Cover Art support.\n- Has support for LossyWav.\n- Supports portable mode.\n- Merge input files to one large audio file and create CUE sheet.\n- Converting to many formats at once using &quot;Multiple&quot; output mode.\n- Grabbing of multi-channel Audio CDs to the desired format at once.\n- Informative and resizable UI suited even for netbooks.\n- Extracting audio from flv, avi, mov etc. video files (multiple audio streams are supported).\n- Can export/import Metadata to/from external file.\n- Support for 24/32bit audio files.\n- Multilanguage support. Currently program is available in Dutch, English, French, Japanese, Korean, Polish, Russian, Hungarian, Italian, Spanish, Spanish Traditional, Swedish, Brazilian Portuguese, German, Finnish, Bulgarian, Czech, Danish and Chinese (simplified) languages.\n- And more.\n\n26.05.2013\n\n- version 1.0.0.203\n- NEW: added /stdout CLI parameter (see http://xrecode.com/cmdline.txt for examples).\n- NEW: updated German translation.\n- NEW: support lyrics tag when converting from flac to alac.\n- NEW: added support for lha files, i.e. you can open them directly from the program. Files will be unarchived to temp folder and then added to the program automatically.\n- FIX: fixed issue with duplicate files when adding folder with .m3u and .cue files to a program from shell.\n- FIX: fixed file naming when transcoding from \\serverpath1 to \\serverpath2 ","torrent":{"xt":"urn:btih:24ea73a1bced41b9a95dc4c648cd0a6e19bcc2e3","amp;dn":"Xrecode+II+1.0.0.203+Final+%2B+Portable+by+pmp317","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24ea73a1bced41b9a95dc4c648cd0a6e19bcc2e3","infoHashBuffer":{"type":"Buffer","data":[36,234,115,161,188,237,65,185,169,93,196,198,72,205,10,110,25,188,194,227]},"announce":[],"urlList":[]}}