{"title":"Around The Way Girls","uid":6362513,"size":1702149380,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:252179d4ac0fc3abaae3c3b577c49c601c9a835b&amp;dn=Around+The+Way+Girls&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"doggfrogg","files":12,"time":1304385803,"description":"Starring: Byron Long, Cherry, Nasty Girl, Luscious, Peaches, Chocolate, Peaches.\n\n\n\n\n&quot;This is far and away some of the most impressive all-black erotica available these days, and Nicky Starks, who along with Byron Long directs this torrid little volume, is one of the greatest showmen around these days when it comes to ethnic-themed pornography. The recipe here is simplicity itself - Byron, who for anyone who doesn't know is one of the BIGGEST black men ever to work in adult video, is teamed with a procession of mouth-watering young projects princesses, all of whom obviously adore his massive appendage. They take him on singularly and in pairs, and in every case milk him for all he's worth. Nasty Girl is an incredibly horny young nymph and who more than lives up to her name here. She blasts through some scalding sex with our man here, and in the process gets her buttons pushed but good. Then there are Chocolate and Peaches, who double team our man and take turns riding his huge unit to resounding Ohhhs. A must see treat for fans of hell-fire ethnic fare.&quot; \n","torrent":{"xt":"urn:btih:252179d4ac0fc3abaae3c3b577c49c601c9a835b","amp;dn":"Around+The+Way+Girls","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"252179d4ac0fc3abaae3c3b577c49c601c9a835b","infoHashBuffer":{"type":"Buffer","data":[37,33,121,212,172,15,195,171,170,227,195,181,119,196,156,96,28,154,131,91]},"announce":[],"urlList":[]}}