{"title":"RoboForm Pro Desktop and RoboForm2Go v7.8.9.5 w patch[onttm]","uid":8459409,"size":28081436,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:262383e5e8936c71565a4ee58091e88abe33d075&amp;dn=RoboForm+Pro+Desktop+and+RoboForm2Go+v7.8.9.5+w+patch%5Bonttm%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"onttm","files":-1,"time":1368197568,"description":"RoboForm Pro Desktop and RoboForm2Go v7.8.9.5 Â©2013 with patch by novice2 / RU-Board [brought to you by onttm]\n\nJust install your choice of RoboForm (Desktop vs Portable) and run the patch (read the patch txt file for command-line arguments to patch Portable). No need to close RoboForm before patching; the patch will kill the processes for you.  All you need to do is run the RoboForm TaskBar Icon after patching.\n\nSee included screen shots of both RF editions with and without Sync enabled.\n\nCurrently working on Windows 7 Ultimate SP1 x64\n\nEnjoy!\n\nNOTE: To date, there is still no universal patch for roboform-x64.dll, so you will have to continue using a 32-bit browser or pay for a legitimate Roboform license to enable 64-bit browser support. (or find another patched roboform-x64.dll for this version of RF)\n\nNOTE 2: I have seen the rare comment that the patch doesn't work after version &quot;blah blah blah&quot; (it's always different).  If at first you don't succeed, try running the patch a 2nd time.\n\nVirusTotal results for the patch reveal 'generic' malware flags (6/46) since it IS a functional patcher.\nResults URL: https://www.virustotal.com/en/file/5663a7ec1fc12f19fc6a582340960bcf8d6f7435f9328d39467081bfd046badf/analysis/1367295054/\n\n-----------------------\nKey Features\n\nOne-Click Logins - Put your passwords on speed dial and log into websites with a single click. RoboForm Logins is like having bookmarks on steroids.\n\nSingle Master Password - RoboForm securely stores all your website and Windows application passwords. From now on, you'll only need to remember one master password.\n\nOne-Click Form Filling - Enter your address, phone, email, etc. into your RoboForm Identity one time. Click on your Identity to completely fill long registration and checkout forms.\n\nCross Browser Support - RoboForm integrates with IE, Firefox, Chrome, and more, allowing you to share info between browsers and making your web experience faster, easier and more secure.\n\nSynchronize and Back up - Use our secure RoboForm Everywhere service (or use your own storage) to automatically sync your RoboForm information between multiple computers.\n\nStrong Encryption - Protected RoboForm Data is secured with military-grade AES 256 encryption, with additional security options available.\n\nCross Platform Support - RoboForm works with every major desktop OS including Windows, Mac, and Linux for a truly cross-platform experience.\n\nAccess from Anywhere - Always one click away. With RoboForm Everywhere, you can easily and securely access your RoboForm Logins, Identities, and Safenotes from anywhere in the world.\n\n","torrent":{"xt":"urn:btih:262383e5e8936c71565a4ee58091e88abe33d075","amp;dn":"RoboForm+Pro+Desktop+and+RoboForm2Go+v7.8.9.5+w+patch%5Bonttm%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"262383e5e8936c71565a4ee58091e88abe33d075","infoHashBuffer":{"type":"Buffer","data":[38,35,131,229,232,147,108,113,86,90,78,229,128,145,232,138,190,51,208,117]},"announce":[],"urlList":[]}}