{"title":"Christian Zionism: And the Road Map to Armageddon","uid":11549073,"size":2612924,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:26899ea7dfe47ccbe53ea038b00c4d448ddeba61&amp;dn=Christian+Zionism%3A+And+the+Road+Map+to+Armageddon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":-1,"time":1416761863,"description":"The term &quot;Zionism&quot; was first coined in the late nineteenth century, and referred to the movement for the return of the Jewish people to an assured and secure homeland in Palestine. Ironically, this vision was largely nurtured and shaped by Christians long before it received widespread Jewish support. The origins of &quot;Christian Zionism&quot; lie within nineteenth-century British premillennial sectarianism, but by the early twentieth century it had become a predominantly American dispensational movement, and pervasive within all main evangelical denominations. The contemporary Christian Zionism movement emerged after the &quot;Six Day War&quot; in Israel in 1967, and it has had a significant influence on attitudes towards the ongoing Palestinian-Israeli conflict in the Middle East. Evangelicals are increasingly polarized over whether Christian Zionism is biblical and orthodox or unbiblical and cultic. In this book Stephen Sizer provides a thorough examination of the historical development, variant forms, theological emphases and political implications of Christian Zionism. His excellent and informative survey is interwoven with critical assessment that repudiates both nationalistic Zionism and anti-Semitism.\n\nMake sure your guns are loaded.The niggers are going to riot and it will be open season on the spooks","torrent":{"xt":"urn:btih:26899ea7dfe47ccbe53ea038b00c4d448ddeba61","amp;dn":"Christian+Zionism%3A+And+the+Road+Map+to+Armageddon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26899ea7dfe47ccbe53ea038b00c4d448ddeba61","infoHashBuffer":{"type":"Buffer","data":[38,137,158,167,223,228,124,203,229,62,160,56,176,12,77,68,141,222,186,97]},"announce":[],"urlList":[]}}