{"title":"Build A Better Bio - Christina Katz","uid":11735445,"size":158770411,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:289a47f884f1d4669bd88d06c48055bc67ac5c35&amp;dn=Build+A+Better+Bio+-+Christina+Katz&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"paybacktime","files":11,"time":1425555488,"description":"URL: https://www.udemy.com/build-a-better-bio/\n\nBuild A Better Bio To Market Yourself Easily Day &amp; Night\n\nLearn To Draft, Edit &amp; Polish Bios In 30 Minutes That Convert Online Connections Into Paying Clients &amp; Career-long Fans\n\n\n\nCOURSE DESCRIPTION:\n\n\nLearn Quickly &amp; Work At Your Own Pace -- 100% Video Course With Six Downloadable Worksheets\nHave you ever wondered why some online marketers seem to attract fans all day and night?\n\nAnd have you also wondered why folks pass over your offerings without making a purchase, even though you are deeply committed to offering quality and service?\n\nHave you ever stopped to consider that maybe your online bios are not pulling in potential customers the way they could?\n\nI bet you are sincere, motivated, and hard-working. I am, too! And so are thousands of other folks who offer their products and services online every day.\n\nIf you are tired of working hard and getting little in return, maybe it's time to build a better bio for your business.\nIn fact, let's upgrade all of your online bios including your one-page bio, your one-paragraph bio, and your social media bios, while we're at it.\n\nEven if you have been in business for many years and think your bios work well already, you can likely make them better.\n\nI will walk you through 30-minutes of video instruction and then you can use the six downloadable worksheets that come with this class any time you like to build a bio that will set you apart from the crowd.\n\nIn this course, I have made it easy for you to condense your one-page bio into a one-paragraph bio and to leverage your one-paragraph bio into eight social media platform bios.\n\nI have 14 years of experience coaching writers and authors to take their professional communication skills to the next level and I can help you, too.\n\nRemember, the busiest professionals have bios that constantly reach out and connect them to new prospects. Are your bios doing this important work for you?\n\nIf not, then it's time to build a better bio for your business and leverage it into as many helpful versions as possible.\n\nClick on the Take This Course button to get started. You'll own the materials for life, so you can come back and update your bio as you continue to grow and expand your business in years to come.\n\nAnd you'll become part of a collective of motivated individuals who are all working on building better bios. So come on in! The bio-writing is fine. I look forward to working with you","torrent":{"xt":"urn:btih:289a47f884f1d4669bd88d06c48055bc67ac5c35","amp;dn":"Build+A+Better+Bio+-+Christina+Katz","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"289a47f884f1d4669bd88d06c48055bc67ac5c35","infoHashBuffer":{"type":"Buffer","data":[40,154,71,248,132,241,212,102,155,216,141,6,196,128,85,188,103,172,92,53]},"announce":[],"urlList":[]}}