{"title":"Catherine Wheel - Happy Days [1995]","uid":10488724,"size":427727072,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:290a5e1beca0105d53d2d7b1bf0c52d871be460a&amp;dn=Catherine+Wheel+-+Happy+Days+%5B1995%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"GenXRock","files":-1,"time":1404517722,"description":"Review by Andy Kellman  [-]\nA good percentage of Catherine Wheel's fans might have chucked Happy Days out of their players after the unleashing of Rob Dickinson's David Coverdale-like &quot;oooh&quot; during the brain bash of &quot;God Inside My Head.&quot; In the event that the listener had the open-mindedness required to tackle the lengthy record in whole, they would have heard more Headbanger's Ball vocalisms, wanky guitar solos, and some lyrical passages that would lead admirers of Ferment and Chrome to wonder what happened. &quot;Grow my hair long and strange/I'll be a walking mountain range.&quot; What?\nAlthough the onslaught of pounding, throbbing hard rock prevails throughout the course of Happy Days, there are moments of respite. &quot;Heal&quot; tugs the heartstrings, summing up the record's theme of combating cynicism and coming to grips with adulthood. (The line &quot;Everyone needs someone to live by&quot; comes straight from Talk Talk.) The smoldering eight-minute &quot;Eat My Dust&quot; is unfortunately buried half way through the record. It's easy to get lost in the web of dazzling atmospherics. But more than anything, the greatest challenge of Happy Days is wading through it. At 14 songs and 58 minutes, it's not necessarily bloated for records of its time, but with the tug of war between cocksure heaviness and grandiose pop, it's a chore to get through. It's only four minutes longer than Chrome, but it feels like it doubles it in length. The band seems like they lowered themselves to make a play for the U.S. alternative charts, but they undeniably sound full of fire. The record undeniably misses the imagination of their previous conquests, and it ultimately sounds like a lesser band. (2.5/5)","torrent":{"xt":"urn:btih:290a5e1beca0105d53d2d7b1bf0c52d871be460a","amp;dn":"Catherine+Wheel+-+Happy+Days+%5B1995%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"290a5e1beca0105d53d2d7b1bf0c52d871be460a","infoHashBuffer":{"type":"Buffer","data":[41,10,94,27,236,160,16,93,83,210,215,177,191,12,82,216,113,190,70,10]},"announce":[],"urlList":[]}}