{"title":"Inspector Singh Investigates - Shamini Flint (Detective Mystery)","uid":12586897,"size":1978195,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:297e043f76fa4684b63af59bd82085370816dd2e&amp;dn=Inspector+Singh+Investigates+-+Shamini+Flint+%28Detective+Mystery%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ZamKhan","files":6,"time":1445036607,"description":"A Most Peculiar Malaysian Murder (Inspector Singh Investigates #1)\r\nInspector Singh is in a bad mood. He’s been sent from his home in Singapore to Kuala Lumpur to solve a murder that has him stumped. Chelsea Liew—the famous Singaporean model—is on death row for the murder of her ex-husband. She swears she didn’t do it, he thinks she didn’t do it, but no matter how hard he tries to get to the bottom of things, he still arrives back at the same place—that Chelsea’s husband was shot at point blank range, and that Chelsea had the best motivation to pull the trigger: he was taking her kids away from her. Now Inspector Singh must pull out all the stops to crack a crime that could potentially free a beautiful and innocent woman and reunite a mother with her children. There’s just one problem—the Malaysian police refuse to play ball.\r\n\r\nA Bali Conspiracy Most Foul (Inspector Singh Investigates #2)\r\nInspector Singh, everyone's favorite portly and wheezing homicide detective, is still recovering from his last case when terrorists set off a bomb on the neighboring island of Bali. With Singapore's anti-terrorist team busy defending the home front, Inspector Singh's bosses ship him to Bali to assist with the investigation. Unfortunately, Inspector Singh has as much experience with terrorism as he does with proper diet and exercise -- none.\r\nWhen the police find a skull fragment of a man who was killed before the bomb went off, Inspector Singh is assigned to the case. With Bronwyn Taylor, a peppy and eternally optimistic Australian cop, at his side, Singh's investigation leads him to the wife of the murdered man, and her group of entitled, expatriate friends. The murder seems like an open-and-shut case -- that is, until Bronwyn and…\r\n\r\nSingapore School of Villainy (Inspector Singh Investigates #3)\r\nHomicide detective Inspector Singh has returned home to Singapore to rest his weary feet after time spent globe-trotting and crime-solving in Malaysia and Bali. But it's not long before he wishes he would be sent off to another foreign locale. With his wife nagging him and his boss lecturing him about his unconventional work habits, he's thrilled when a new case comes across his desk.\r\n\r\nA senior partner at an international law firm has been murdered, and it's up to Singh to catch the killer and solve the case. There's no shortage of suspects, from the victim's fellow partners, many of whom are hiding secrets, as well as the dead man's wife and ex-wife. Soon, Inspector Singh is poised to expose the treachery that lies beneath Singapore's high society. Fast-paced, funny, and highly original, Shamini Flint's The Singapore... \r\n\r\nA Deadly Cambodian Crime Spree (Inspector Singh Investigates #4)\r\nIn this fourth adventure, the corpulent, chain-smoking, likeable inspector from Singapore's police service is set against the Khmer Rouge Tribunal. Inspector Singh is in Cambodia, wishing he wasn't. He has been sent as an observer to the international war crimes tribunal in Phnom Penh in the latest effort by his superiors to ensure that he is anywhere except in Singapore. But for the first time the fat Sikh inspector finds himself on the verge of losing his appetite, when a key member of the tribunal is murdered in cold blood. The authorities are determined to write off the incident as a random act of violence, but Singh thinks otherwise. It isn't long before he finds himself caught up in one of the most terrible murder investigations he's witnessed, the roots of which lie in the dark depths of the Cambodian killing fields.\r\n\r\nA Curious Indian Cadaver (Inspector Singh Investigates #5)\r\nThis time his superiors are trying to keep him out of trouble through compulsory sick leave—but it always seems to find Inspector Singh, including in his fifth adventure when he travels to India. Inspector Singh is sick of sick leave, so when Mrs. Singh suggests they attend a family wedding in Mumbai, he grudgingly agrees, hoping that the spicy Indian curries will make up for extended exposure to his wife's relatives. Unfortunately, the beautiful bride-to-be disappears on the eve of her wedding—did she run away to avoid an arranged marriage, or is there something more sinister afoot? When a corpse is found, the fat inspector is soon dragged into a curious murder investigation with very firm instructions from Mrs. Singh to exonerate her family. But as he uncovers layer upon layer of deceit, he knows it isn't going to be that easy.\r\n\r\nA Calamitous Chinese Killing (Inspector Singh Investigates #6)\r\nInspector Singh's expertise is required in China in his sixth adventure, as he battles political intrigue to get to the bottom of a very murky and complex crime Inspector Singh is on a mission to China, against his better judgment. The son of a bigwig at the Singapore Embassy has been bludgeoned to death in a back alley in Beijing. The Chinese security insist that he was the victim of a robbery gone wrong, but the young man's mother demands that Singapore's finest (in his own opinion) rides to the rescue. But solving a murder in a country that practices socialism &quot;with Chinese characteristics&quot; is a dangerous business, and it soon becomes apparent that getting to the bottom of this calamitous killing will be his toughest case yet","torrent":{"xt":"urn:btih:297e043f76fa4684b63af59bd82085370816dd2e","amp;dn":"Inspector+Singh+Investigates+-+Shamini+Flint+%28Detective+Mystery%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"297e043f76fa4684b63af59bd82085370816dd2e","infoHashBuffer":{"type":"Buffer","data":[41,126,4,63,118,250,70,132,182,58,245,155,216,32,133,55,8,22,221,46]},"announce":[],"urlList":[]}}