{"title":"Save the Date - Jen Doll - Audiobook MP3","uid":10462353,"size":261054967,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2b451a0e3127deb7ad356433eafb7473403a519c&amp;dn=Save+the+Date+-+Jen+Doll+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1404147226,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Smart AudioBook Player or Listen Audiobook Player.\n\niTunes users - Add this to your iTunes collection, and change &quot;Media Kind&quot; to &quot;Audiobook.&quot; Right-click the track or album, and select &quot;Get Info&quot; from the context menu. You will find &quot;Media Kind&quot; under &quot;Options.&quot; This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nSave the Date: The Occasional Mortifications of a Serial Wedding Guest\n\nWritten by: Jen Doll\nNarrated by: Emily Durante\nLength: 9 hrs and 2 mins\nFormat: Unabridged\nRelease Date:06-10-14\nProgram Type: Audiobook\n\nWeddings. They're fun, festive, and joyful - they offer endless opportunities to reexamine love and what we want for ourselves, regardless of whether or not our aim is a walk down the aisle. In Save the Date, Jen Doll charts the course of her own perennial wedding guesthood, from the ceremony of distant family members when she was eight to the recent nuptials of a new boyfriend's friends. Wedding experiences come in as varied an assortment as the gowns at any bridal shop, and Doll turns a keen eye to each, delivering a heartfelt exploration of contemporary relationships. Funny, honest, and affecting, Save the Date is a fresh and spirited look at the many ways in which we connect to one another. ","torrent":{"xt":"urn:btih:2b451a0e3127deb7ad356433eafb7473403a519c","amp;dn":"Save+the+Date+-+Jen+Doll+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b451a0e3127deb7ad356433eafb7473403a519c","infoHashBuffer":{"type":"Buffer","data":[43,69,26,14,49,39,222,183,173,53,100,51,234,251,116,115,64,58,81,156]},"announce":[],"urlList":[]}}