{"title":"Nancy Mitford - The Sun King (unabridged)","uid":4638604,"size":414307659,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2ccaeed9577153d22ddc0d1eb38db5dc48b9817f&amp;dn=Nancy+Mitford+-+The+Sun+King+%28unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sheila6","files":89,"time":1231638091,"description":"Audio Books : Literary : Other quality : English\n\n\n\nType: Unabridged recording \nQuality: 96 kbps stereo 44khz \nLength: 9:30 hours \nPublisher: Audio Connoisseur (2004) \nNarrator: Charlton Griffin (with Ellen Ezekiel)\nOriginally Published: 1966\n(This audiobook also includes a brief prologue by Arthur James Grant, &quot;Louis XIV: A Brief Biography&quot;)\n\n\n\n&quot;Louis XIV fell in love with Versailles and Louise de La Valliere at the same time; Versailles was the love of his life.&quot;\n\n\nPublisher's Summary:\n\nOf all the crowned heads of Europe, there was none to match the dignity, grace, and magnificence of Louis XIV, the greatest king in French history. And there was no other palace to match the glory of Versailles at its zenith.\n\nFrom the moment of his accession to power in 1660, Louis took firm control of the reins of power, confounding everyone at court and in bureaucratic circles. And when that power was firmly in hand, he began building what author Nancy Mitford calls &quot;the love of his life&quot;, Versailles. From its beginnings as a simple hunting lodge for Louis XIII, Versailles went on to become the epitome of the lavish royal residence, the pride of France and the envy of monarchs everywhere. It was a byword for fashionable elegance, courtly manners, and refined taste. It was also a hotbed of deadly political intrigue and sexual politics.\n\nIn this witty and exciting book, you will hear how Louis kept his aristocratic dandies under his control, how he used his mistresses to his advantage, and how he decided whether or not to legitimize his many offspring. Listen as legendary mistresses Madam de Maintenon and Madam de Montespan engage in a duel of hearts to win the king's favor. Find out how the king managed his incredibly complex household of thousands, and how he ruled the most powerful nation on earth from his heavenly residence.\n\nNancy Mitford has produced a masterpiece of biographical entertainment, certainly one of the most charming, witty, and moving works ever written about Louis XIV and his time.\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:2ccaeed9577153d22ddc0d1eb38db5dc48b9817f","amp;dn":"Nancy+Mitford+-+The+Sun+King+%28unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ccaeed9577153d22ddc0d1eb38db5dc48b9817f","infoHashBuffer":{"type":"Buffer","data":[44,202,238,217,87,113,83,210,45,220,13,30,179,141,181,220,72,185,129,127]},"announce":[],"urlList":[]}}