{"title":"Conquistador by Barry Levy (Unabridged)","uid":6341262,"size":1228725060,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2d010068fc519e732b785b8cddbfb20c5388f36b&amp;dn=Conquistador+by+Barry+Levy+%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rosie1966","files":9,"time":1303674281,"description":"Thanks go out to the ULer of the original CD files of this audiobook, but I don't like how most audiobooks--like this one--are arbitrarily divided by length. I have split all of the files into individual chapters, which I think most people would agree is a better format.\n\nThere are two versions of the complete and unabridged audiobook in this torrent. You can choose the mp3 version (each chapter is a single file, 24 files in total), or you can choose the fully chapterized m4b (iPod/iPhone or similar device) version (2 fully chapterized files, already tagged for iTunes). Both versions are at 128 kbps.\n\nAlso included in the torrent is a PDF companion ebook with all of the book's original appendices along with illustrations &amp; maps (which I made myself, thanks to Amazon's &quot;Look Inside&quot; feature).\n\nEnjoy and please seed!   \n\n\n\nConquistador: Hernan Cortes, King Montezuma, and the Last Stand of the Aztecs\nby Buddy Levy; read by Patrick Lawlor\nÃ‚Â©2008 Tantor Media\nUnabridged (Length: 12 hrs., 14 mins.)\nOrig. Media: Audio Download (Audible)\n---------------------------------------------------------------------------\n\n\nTABLE OF CONTENTS . . .\n\nINTRODUCTION (13:27) \n01. Setting Out for New Spain and the Serendipitous Gift of Language (22:56) \n02. The Battle with the Tabascans and the Acquisition of La Malinche (23:21) \n03. Montezuma's Message (40:23) \n04. The Gambler Stakes All: &quot;Either Win the Land, or Die in the Attempt&quot; (32:05) \n05. Into the Mountains (45:25) \n06. The Massacre of Cholula (28:30) \n07. The City of Dreams (35:00) \n08. City of Sacrifice (23:49) \n09. Seizure of Empire (18:43) \n10. CortÃƒÂ©s and Montezuma (27:37) \n11. Spaniard Versus Spaniard (40:38)\n\n12. The Festival of Toxcatl (23:38) \n13. Montezuma's Ironic Fate (25:28) \n14. La Noche Triste (35:25) \n15. &quot;Fortune Favors the Bold&quot; (26:18)\n16. &quot;The Great Rash&quot; (28:12) \n17. Return to the Valley of Mexico (26:58) \n18. The Wooden Serpent (35:14)\n19. Encirclement (30:45)\n20. The Siege Begins (34:53) \n21. Clash of Empires (43:52) \n22. The Last Stand of the Aztecs (34:56) \nEPILOGUE: The Shadows of Smoke (36:14) \n\nAPPENDIX A: Significant Participants in the Conquest\nAPPENDIX B: A Brief Chronology of the Conquest \nAPPENDIX C: A Note on the Nahuatl Language Pronunciation *(NOTE: NOT Included) \nAPPENDIX D: Major Deities of the Aztec Pantheon \nAPPENDIX E: The Aztec Kings \n\n\n\nSUMMARY . . .\n\nThe saga of CortÃƒÂ©s, Montezuma, and the Spanish conquest of the Aztec Empire has been chronicled repeatedly, and with justification, since it is one of the seminal events in world history. There is probably no new information on the conquest left to uncover, but it is a thrilling, moving, and tragic story well worth retelling. Levy is not a professional historian, but he is a fine writer who knows the material, and he is wise enough to allow the pure excitement and drama of the story to unfold naturally. At the center of the tale, of course, are the two protagonists. CortÃƒÂ©s is viewed as an intriguing combination of ruthless ambition, religious piety, and surprising tenderness. Montezuma, also deeply religious, was less a man of action than CortÃƒÂ©s, and his contemplative nature probably sealed his doom. As Levy illustrates, this was also an earthshaking clash of civilizations that is still working itself out five centuries later. This is a superb work of popular history, ideal for general readers.\n\n\n\nABOUT THE AUTHOR . . .\n\nBuddy Levy is the author of Conquistador: Hernan Cortes, King Montezuma, and the Last Stand of the Aztecs (Bantam Dell, 2008); American Legend: The Real-Life Adventures of David Crockett (Putnam, 2005, Berkley Books, 2006); and Echoes On Rimrock: In Pursuit of the Chukar Partridge (Pruett, 1998). As a freelance journalist he has covered adventure sports and lifestyle around the world, including several Eco-Challenges and other adventure expeditions in Argentina, Borneo, Europe, Greenland, Morocco, and the Philippines. His magazine articles and essays have appeared in Backpacker, Big Sky Journal, Couloir, Discover, High Desert Journal, Poets &amp; Writers, River Teeth, Ski, Trail Runner, Utne Reader, TV Guide, and VIA. He is clinical assistant professor of English at Washington State University, and lives in northern Idaho with his wife Camie, his children Logan and Hunter, and two black Labs.\n\n\n\nABOUT THE READER . . .\n\nPatrick Lawlor is an AudioFile Earphones Award winner and Audie Award finalist, he is also an accomplished stage actor.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:2d010068fc519e732b785b8cddbfb20c5388f36b","amp;dn":"Conquistador+by+Barry+Levy+%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d010068fc519e732b785b8cddbfb20c5388f36b","infoHashBuffer":{"type":"Buffer","data":[45,1,0,104,252,81,158,115,43,120,91,140,221,191,178,12,83,136,243,107]},"announce":[],"urlList":[]}}