{"title":"(MARIJUANA DOCUMENTARY) The Union - The Business Behind Getting ","uid":4890258,"size":1304152407,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2d0a7841aa1214456cc56a4869259a5b1b0a5762&amp;dn=%28MARIJUANA+DOCUMENTARY%29+The+Union+-+The+Business+Behind+Getting+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"redxxxx","files":-1,"time":1241950107,"description":"*** SPREAD THIS AROUND! BURN, COPY, EXPOSE THE TRUTH! ***\n\n\nThe Union: The Business Behind Getting High\n\nCanada, 2007, 105 min\n\nDirected By: Brett Harvey\nExecutive Producer: Adam Scorgie\nProducers: Graeme Flannigan, Stephen Green, Kieran MaGuire\nCamera: Brett Harvey\nEditor: Stephen Green\nMusic: Michael Champion &lt;a href=&quot;\nhttp://www.theunionmovie.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.theunionmovie.com&lt;/a&gt; &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1039647/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1039647/&lt;/a&gt;\n\n\nHighly entertaining as well as informative, The Union takes a look at BC's ever-expanding marijuana industry. Beginning with a brief history of the use of marijuana in North America, director Brett Harvey takes us on a journey that includes interviews with growers, clippers, criminologists, politicians, doctors, police officers and pop culture icons to illuminate the business of BC bud and how it is that such a powerful industry can function so successfully while remaining illegal. With enormous profits to be made, he questions who benefits the most from the current state of affairs and comes up with some not-so-surprising answers.\n\nIn examining more closely the propaganda of the anti-marijuana lobby, some unexpected facts and figures surface regarding the health risks of marijuana as well as the economic, agricultural and societal benefits of growing hemp, and the current laws prohibiting such crops in North America. As an industry that brings in seven billion dollars annually, the business of growing and distributing marijuana is even more profitable for those involved on both sides of the law due to the prohibition. The Union is a fascinating and in-depth look at one of BC's most profitable industries and the players involved, from the growers and dealers to pharmaceutical companies and builders of private prisons. Winner, Outstanding Documentary Feature, 2007 Winnipeg International Film Festival.\n\nThis film is nominated for the National Film Board's Best Canadian Documentary Award.\n","torrent":{"xt":"urn:btih:2d0a7841aa1214456cc56a4869259a5b1b0a5762","amp;dn":"%28MARIJUANA+DOCUMENTARY%29+The+Union+-+The+Business+Behind+Getting+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d0a7841aa1214456cc56a4869259a5b1b0a5762","infoHashBuffer":{"type":"Buffer","data":[45,10,120,65,170,18,20,69,108,197,106,72,105,37,154,91,27,10,87,98]},"announce":[],"urlList":[]}}