{"title":"Jessie James - Boys In The Summer (2nafish)","uid":5809805,"size":138807300,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:2d2c6f36c5e9136b2939ac8566e491758e229cdf&amp;dn=Jessie+James+-+Boys+In+The+Summer+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1283586689,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Boys in the Summer&quot; is the lead single from the second studio album by the country-pop American singer Jessie James.\n\nThe song was produced by John Fields and co-written by Jessie James and James Michael. The country mix was produced by Mark Wright, released through Show Dog-Universal Music. The song goes for adds at Top 40 Mainstream stations on July 13th and on July 19th at HAC Stations. The music video was directed by Roman White and it was shot on May 18 and debuted on June 18 part of CMT Big New Music Weekend. The digital single became available on iTunes on June 29th.\n\nAmar Toor of AOL Radio Blog gave a positive review for the single, saying that &quot;Boys in the Summer&quot; &quot;[was] one of those rare tracks that seem to capture everything good and pure about summer.&quot;\n\nJessica Rose James, (born April 12, 1988) better known as Jessie James is an American country-pop singer and songwriter. Her debut album, Jessie James was released in 2009.\n\nShe has described her wardrobe as &quot;simple&quot; and has admitted to not being into fashion. She was named one of Maxim's 100 hottest women in the world.\n\nBesides country music, James also listened to pop and soul which also influence her musical style. She has listed Christina Aguilera, Bobbie Gentry, Janis Joplin, Shelby Lynne, and Shania Twain as influences.\n\nJames was introduced to Karla Wallace of independent label Yellow Dog Records  at seventeen who helped her with her songwriting and singing. One of her songs, &quot;Gypsy Girl&quot;, written with two writers from Yellow Dog had been pitched to American Idol winner Carrie Underwood who put it on hold for her record, made it into the hands of record executive David Massey who brought her to the attention of L.A. Reid. She auditioned for Reid singing her song, &quot;My Cowboy&quot;. James soon inked a contract with Mercury Records. Her debut album her, Jessie James was released in August 2009, debuting at number twenty-three on the Billboard 200. Its first single, &quot;Wanted&quot; had been released in April and peaked at number forty on the Billboard Hot 100. She later performed in the Middle East with singer Kid Rock and comedian Carlos Mencia for US troops stationed overseas.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:2d2c6f36c5e9136b2939ac8566e491758e229cdf","amp;dn":"Jessie+James+-+Boys+In+The+Summer+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d2c6f36c5e9136b2939ac8566e491758e229cdf","infoHashBuffer":{"type":"Buffer","data":[45,44,111,54,197,233,19,107,41,57,172,133,102,228,145,117,142,34,156,223]},"announce":[],"urlList":[]}}