{"title":"Monopoly Tycoon Portable - [Espera]","uid":6381456,"size":45253333,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2d77a7a560aae83670bb12644b4162709509ea20&amp;dn=Monopoly+Tycoon+Portable+-+%5BEspera%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":2,"time":1305042528,"description":"    //   / /                                            \n   //____     ___      ___      ___      __      ___    \n  / ____    ((   ) ) //   ) ) //___) ) //  ) ) //   ) ) \n //          \\ \\    //___/ / //       //      //   / /  \n//____/ / //   ) ) //       ((____   //      ((___( (   \n\n                     Presents\n\nINSTRUCTIONS\n1.Unrar\n2.Run &quot;Monopoly Tycoon 1 Click.exe&quot;\n3.Enjoy.\n\nWarning this is a PORTABLE verision of the game.\nAll portable versions brought to you by us most probably \nWILL NOT work with x64 versions of Windows, only with the x86 versions.\n\nMonopoly Tycoon uses the popular board game as the base on which to build a strong and innovative, and great-looking, real-time game of business management and city building.\n\nMost previous PC games based on Monopoly have gone in one of two directions: They either combine the classic property-trading game with another popular license, as in Monopoly Star Wars Edition, or they use the strong Monopoly brand and distinctive graphics to spruce up another type of game, as in Monopoly Casino. Fortunately, Monopoly Tycoon breaks the mold by using the popular board game as the base on which to build a strong and innovative, and great-looking, real-time game of business management and city building.\n\nIt's a completely new approach to the classic board game.\n\nMonopoly Tycoon is the kind of game you might have imagined as a kid while you played the real board game. The game includes all the familiar Monopoly elements, such as buying and selling properties and utilities, collecting rent, and managing your money, but it expands on the idea by letting you build a variety of retail and residential buildings and then manage your businesses by setting stock amounts, prices, and rent. If you've ever wanted to see what an expensive Boardwalk hotel would look like up close, this is your chance. While Monopoly purists may be wary of the numerous changes and additions that have been made to the classic game, the end result is a pleasing and challenging blend of city building and economic management, all created in the familiar, lighthearted style of Monopoly. \n\nMINIMUM PC REQUIREMENTS\n\nWindows 98/Xp and newer\n\nPentium 233MHz Processor\n\n64MB RAM\n\n90MB Hard Disk Space\n\n4X CD-ROM Drive\n\n8MB DirectX compatible Video Card\n\nDirectX compatibleSound Card\n\nDirectX 8.0\n","torrent":{"xt":"urn:btih:2d77a7a560aae83670bb12644b4162709509ea20","amp;dn":"Monopoly+Tycoon+Portable+-+%5BEspera%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d77a7a560aae83670bb12644b4162709509ea20","infoHashBuffer":{"type":"Buffer","data":[45,119,167,165,96,170,232,54,112,187,18,100,75,65,98,112,149,9,234,32]},"announce":[],"urlList":[]}}