{"title":"Edstrom&amp;Eller-Barbarians Led by Bill Gates(1999)","uid":4640403,"size":830354,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2e0f7e4cec91d69054661e0e58173918b2ae118f&amp;dn=Edstrom%26Eller-Barbarians+Led+by+Bill+Gates%281999%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"red_gonzo","files":1,"time":1231696361,"description":"For english-only speaking:\nThis book is a german translation of an english book Barbarians Led by Bill Gates - Microsoft from the Inside (1999). Jointly written by Jennifer Edstrom and Marlin Eller as a third-person account of the experiences of Eller at Microsoft, it goes into detail about the early years of Microsoft and its emergence as a massive corporation. How has Microsoft been able to crush its competition every step of the way? The company's own version of history ascribes it to something like &quot;really great technical innovation.&quot; But this shocking book presents a harsher and messier history, sharply questioning Microsoft's ethics and corporate wisdom while underscoring its fierce will to compete. The authors present a history of Microsoft from the early '80s to the present, covering the big projects, both successes and failures, that defined the company's direction. It's a difficult story to tell, filled with complex technology and a large cast of characters who are rarely in the public eye. Perhaps the most surprising thing to emerge is how many Microsoft ventures were mismanaged and how many opportunities were missed. The best-known of these is Microsoft's near-catastrophic failure to see the arrival and success of the Internet. The book also details the unplanned success of Windows 3.0, the demise of Pen Windows, and the compromised design and slow success of Windows 95. A final chapter tackles the Netscape-Microsoft Web-browser war and Microsoft's head-on collision with the Justice Department. Both authors are, in different ways, Microsoft insiders. Edstrom is the daughter of Pam Edstrom, Gates's long-time PR chief and spin doctor. Eller is a 13-year veteran Microsoft developer who has worked on DOS, early versions of Windows, and pen computing. Both stand open to the charge of having an ax to grind, and the reader senses a lot of personal animosity at work. If you ever doubted that Microsoft plays to win, or ever wondered how they do it, you'll learn a lot from this lively memoir that takes us inside the walls at Redmond. In the press we see what Microsoft wants the world to know. Here, the programmers in the trenches let us in on how they see it. 280 pages.\n\nFur Deutschsprachige:\nZusammen geschrieben von Jennifer Edstrom und Marlin Eller, das Buch befasst sich mit wie die reichste Firma der Welt ihre Macht ausÃƒÂ¼bt. Der Untertitel &quot;Microsoft von innen betrachtet&quot; verspricht wirklich nicht zuviel. Das Buch beschreibt auf knapp 300 Seiten den chaotischen Charakter der - eher zufÃƒÂ¤llig - fÃƒÂ¼hrenden Softwarefirma auf dem PC-Markt. Die Entwicklung schien relativ planlos vorangegangen zu sein. FÃƒÂ¼r viele neu sein wird die Tatsache, daÃƒÅ¸ Microsoft teilweise nur mit sehr viel GlÃƒÂ¼ck ihre dominante Marktstellung ausbauen konnte. Von zielgerichteter Produktstrategie ist die Firma laut Eller meilenweit entfernt. Vielmehr begrÃƒÂ¼ndet sich der Erfolg auf einige kluge Entwickler und eine hochkarÃƒÂ¤tige PR-Abteilung mit entsprechendem Etat. Interessant fÃƒÂ¼r den Leser ist die Bereitschaft Bill Gates', die Entwickler vor sich hinarbeiten zu lassen, wÃƒÂ¤hrend klare Projektstrategien fehlten. SchlieÃƒÅ¸lich wurden abstruse Forderungen gestellt und die Entwickler durften zusehen, ob und wie sie umgesetzt werden konnten und um welchen Zeitraum der geplante Auslieferungstermin verfehlt wird. Bezeichnend ist die Bemerkung von Eller, &quot;Microsoft lÃƒÂ¤uft erst dann zur Hochform auf, wenn es einen erfolgreichen Konkurrenten hat, den es kopieren und anschlieÃƒÅ¸end vernichten kann.&quot; Ebenso bezeichnend sind die Projekte, die Gates angefangen und verworfen hat, bzw. die Flops wurden wie z.b. das &quot;Homer&quot;-Projekt. Charakteristisch fÃƒÂ¼r die Planlosigkeit von Microsoft ist die Verfehlung im Browser- und Internet-Bereich anzusehen, ebenso die fixen Ideen von Bill Gates. Eigentlich sollte Windows 2.0 die letze Version sein und Microsoft richtete sich auf OS/2 aus. Die Zusammenarbeit mit IBM erschien jedoch unerwartet schwierig und schlieÃƒÅ¸lich machte sich ein Entwickler daran, Windows auf den Protected Mode zu portieren - und damit OS/2 zu ÃƒÂ¼berholen. Das daraus resultierende Produkt Windows 3.0 wurde ein absoluter Renner, die Zusammenarbeit mit IBM war gestorben und Konkurrenten bezeichneten es als &quot;heimtÃƒÂ¼ckischen obgleich brillianten Schachzug&quot;. Dank Marlin Eller, der dreizehn Jahre selbst als Entwickler bei Microsoft gearbeitet hat, gibt das Buch tatsÃƒÂ¤chlich tiefe Einblicke in die Strukturen und Planlosigkeit von Microsoft. Belegt wird die Entwicklung des Windows-Desktops durch die Graphical User Interface Gallery. Jennifer Edstrom, Tochter der PR-Cheffin von Microsoft, hat seit dem dreizehnten Lebensjahr die Entwicklung hautnah miterlebt. FÃƒÂ¼r jemanden, der sich mit der Materie bereits beschÃƒÂ¤ftigt hat, ist das Buch ein MuÃƒÅ¸. Es liest sich locker und fesselt. 280 Seiten.\n","torrent":{"xt":"urn:btih:2e0f7e4cec91d69054661e0e58173918b2ae118f","amp;dn":"Edstrom%26Eller-Barbarians+Led+by+Bill+Gates%281999%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e0f7e4cec91d69054661e0e58173918b2ae118f","infoHashBuffer":{"type":"Buffer","data":[46,15,126,76,236,145,214,144,84,102,30,14,88,23,57,24,178,174,17,143]},"announce":[],"urlList":[]}}