{"title":"Dressed to Kill 1980 Michael Caine DvDRip x264 AAC-miKem","uid":8517779,"size":968701169,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2edf174f11dc1d9ff0a0321fa1320287c90a3023&amp;dn=Dressed+to+Kill+1980+Michael+Caine+DvDRip+x264+AAC-miKem&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mikem777","files":5,"time":1369806860,"description":"Dressed to Kill (1980) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0080661&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0080661&lt;/a&gt;\n\nSAMPLE file included\n\nWhile taking a shower, Kate Miller, a middle-aged, sexually frustrated New York housewife, has a rape fantasy while her husband stands at the sink shaving. Later that day, after complaining to her psychiatrist Dr. Robert Elliott about her husband's pathetic performance in bed, she meets a strange man at a museum and returns to his apartment where they continue an adulterous encounter that began in the taxicab. Before she leaves his apartment, she finds papers which certify that the man has a venereal disease. Panicked, Kate rushes into the elevator, but has to return to his apartment when she realizes she's forgotten her wedding ring. When the elevator doors open, she's brutally slashed to death by a tall blonde woman wearing dark glasses. Liz Blake, a high-priced call girl, is the only witness to the murder and she becomes the prime suspect and the murderess's next target. Liz is rescued from being killed by Kate's son Peter, who enlists the help of Liz to catch his mother's killer ... \n\nDe Palma's best known, but not best Hitchcock homage. Style triumphs over substance but it's still good fun. 'Dressed To Kill' was Brian De Palma's third Hitchcockian thriller, and his most successful. I don't necessarily mean artistically successful, but it still remains one of his best known movies, and is the one on which his reputation as &quot;that Hitchcock&quot; guy mainly rests on. De Palma has made all kinds of movies in his long career but it says a lot for the impact 'Dressed To Kill' had on audiences for him to be stereotyped like that by many movie lovers. In 'Sisters' De Palma paid tribute to 'Rear Window', in his underrated 'Obsession' it was 'Vertigo', and this time around 'Psycho' is the major inspiration. Some critics of De Palma complain he is more interested in style over substance, and in 'Dressed To Kill' there is some truth in that. You will probably guess the murderer after the first 20-25 minutes, then think to yourself &quot;no, that's just a red herring and there will be an unexpected twist later on&quot;. You might then be a bit let down when the your initial guess turns out to be correct after all, but there are enough thrills and dazzling sequences throughout to keep most thriller fans happy. Michael Caine and Angie Dickinson are both pretty good in their respective roles, but Nancy Allen ('RoboCop') gives the real outstanding performance in the picture. De Palma would subsequently give her another good role in 'Blow Out' opposite John Travolta. Also strong are Keith Gordon (who went on to star in John Carpenter's 'Christine') and Dennis Franz ('NYPD Blue') in supporting roles. Personally I don't think 'Dressed To Kill' is as good as 'Sisters', but I still think it's first rate exploitation thriller and definitely worth watching. Not De Palma's most interesting movie by a long shot, but still one of his most watchable.\n\n*** General Parameters ***\n- Name:  Dressed to Kill 1980.m4v \n- Size:  962.59 MB \n- Duration:  1h 40mn \n- Bitrate:  1 280 Kbps \n\n*** Video Track Parameters ***\n- Format:  H.264/MPEG-4 AVC \n- Frame rate (fps):  Max.: --- / Average: 25.000 / Min.: --- \n- Encoding profile:  &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;fab2939d92bab6c9d4ca&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt; \n- Image size:  720*436 (Actual 1025 x 436 pixels)\n- Display Aspect Ratio:  2.35:1 \n- Interlacing:  Progressive \n\n*** First Audio Track Parameters ***\n- Format:  AAC - MPEG-4 audio \n- Bitrate:  161 Kbps \n- Rate:  48.0 KHz \n- Channel(s):  2 (stereo) \n\ntags: mystery, thriller, Michael Caine, apartment, elevator, psychiatrist, murder, sunglasses","torrent":{"xt":"urn:btih:2edf174f11dc1d9ff0a0321fa1320287c90a3023","amp;dn":"Dressed+to+Kill+1980+Michael+Caine+DvDRip+x264+AAC-miKem","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2edf174f11dc1d9ff0a0321fa1320287c90a3023","infoHashBuffer":{"type":"Buffer","data":[46,223,23,79,17,220,29,159,240,160,50,31,161,50,2,135,201,10,48,35]},"announce":[],"urlList":[]}}