{"title":"Nora Roberts - the O'Hurley saga books 1-4","uid":4017295,"size":800305538,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2fafd69637c36abd2ffca1c1a70e305521bfd3ee&amp;dn=Nora+Roberts+-+the+O%5C%27Hurley+saga+books+1-4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"htaylor","files":120,"time":1202438813,"description":"By \tSophie Williams (Victoria, BC, Canada) \nAs a relatively new fan of Nora Roberts, I have made it a mission of mine to acquire all of her classic novels, the ones written before I discovered this amazing author about five years ago. I have enjoyed every story I have managed to get my hands on, but the two tales in &quot;Born O&amp;#039;Hurley&quot; really stand out for me. The O&amp;#039;Hurley family consists of two entertainer parents who live their life on the road, an older brother, and fraternal triplets Chantel, Abby, and Maddy. Nora has created a wonderfully complex, vital, and compelling family in the O&amp;#039;Hurleys, and they had me hooked from the very first page!\n\nThe first of the O&amp;#039;Hurley triplets to have her story told is Abby, the quiet but strong middle (by just a few minutes) sister. After a difficult and unhappy first marriage to well-known racecar driver Charles Rockwell, Abby has been left a widow struggling to raise her two sons on a small farm in Virginia.\nBut the steady routine of her life is irrevocably changed when author Dylan Crosby comes into her life to write the biography of her deceased husband.\nDylan soon finds he is far more interested in the lovely Abby than in the job he came to do, and he becomes determined to discover who she truly is. Because if Abby really is the honest, kind, and determined woman she seems to be, she is everything Dylan has ever dreamed of but never hoped to find.\nRoberts has written a wonderful tale here, filled with powerful emotions, captivating romance, and engaging characters. &quot;The Last Honest Woman&quot; is truly a Nora Roberts gem.\n\nThe second half of &quot;Born O&amp;#039;Hurley&quot; delves into the life of the youngest triplet, Maddy O&amp;#039;Hurley. Maddy is an incredibly vibrant and open young woman, and she is a character you can&amp;#039;t help but love. After leaving her role as the lead of a Broadway hit, Maddy has taken on a new and challenging role in another musical.\nAnd when Maddy meets the financial backer of the production, Reed Valentine of Valentine Records, she finds herself drawn to him. Reed and Maddy are polar opposites in almost every way. He&amp;#039;s conservative and completely focused on business, she&amp;#039;s full of life and colour and wears her emotions on the surface for the world to see.\nAnd though Reed finds himself irresistibly attracted to Maddy, he has a troubled past and issues with trust that stem from his childhood. So while Maddy has fallen head over heels in love with Reed, she realizes that he may never be able to overcome his past and give her what she needs, his heart.\nBoth the effervescent Maddy and the reserved Reed will pull at your heart and you will feel for each of them as they struggle to find a way to each other. Infused with sizzling romance, energetic dance sequences, and the family unity and dynamics that Nora is such a master of &quot;Dance to the Piper&quot; is a triumph.\n\n&quot;Born O&amp;#039;Hurley&quot; comes with my top recommendation so if you&amp;#039;ve never read the stories of Abby and Maddy, buy this delightful omnibus today. I&amp;#039;ve also had the chance to read the other two O&amp;#039;Hurley novels; Chantel&amp;#039;s tale in &quot;Skin Deep&quot; and the prodigal brother Trace&amp;#039;s story in &quot;Without a Trace&quot; and they are equally wonderful. Look for them to be re-printed in &quot;O&amp;#039;Hurley&amp;#039;s Return&quot; in February 2005.\nI promise that you will love this incredible family as much as I do, so don&amp;#039;t miss out on getting to know them! ","torrent":{"xt":"urn:btih:2fafd69637c36abd2ffca1c1a70e305521bfd3ee","amp;dn":"Nora+Roberts+-+the+O%5C%27Hurley+saga+books+1-4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2fafd69637c36abd2ffca1c1a70e305521bfd3ee","infoHashBuffer":{"type":"Buffer","data":[47,175,214,150,55,195,106,189,47,252,161,193,167,14,48,85,33,191,211,238]},"announce":[],"urlList":[]}}