{"title":"Soldier of Fortune Gold with Updates","uid":14964110,"size":680584784,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2fe86de71b76c32fa709dd9709ae5dcab8a1bb0c&amp;dn=Soldier+of+Fortune+Gold+with+Updates&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xbox06032","files":237,"time":1466174523,"description":"Comes with v1.07 Update (Full not Beta) Which means you can play like Quake 2 or Quake 3. CTF, Deathmatch and other Game Types :) Originally the game comes with &quot;WON&quot; which is closed. Now it comes with it's very own Server you can run and host. As well as play. I understand you can run Bots on SOF Gold too. Theres lots fo things I could explain. Anyways heres the Information about the game below.\r\n**If you love FPS Shooters. THIS Game if for you!\r\nInfo on Patch Update: Fixes/changes in this patch:\r\n* No longer generates configsheet.cpp\r\n* Removed WON\r\n* Added GameSpy\r\n* Fixed a few minor issues with dm_flags\r\n-----------------------------------------------------------------------------------\r\nSoldier of Fortune is a first-person shooter video game created by Raven Software and published by Activision on February 29, 2000 for Microsoft Windows. It was later released for the PlayStation 2 as well as the Dreamcast, while Loki Software also made a port for Linux.\r\n\r\nSoldier of Fortune was best known for its graphic depictions of firearms dismembering the human body. This graphic violence is the game's main stylistic attraction, much like the destructible environments of Red Faction or bullet time of Max Payne. The GHOUL engine enables depiction of extreme graphic violence, in which character models are based on body parts that can each independently sustain damage (gore zones). There are 26 zones in total: a shot to the head with a powerful gun will often make the target's head explode, leaving nothing but the bloody stump of the neck remaining; a close-range shot to the stomach with a shotgun will leave an enemy's bowels in a bloody mess, and a shot to the nether regions will cause the victims to clutch their groin in agony for a few seconds before kneeling over dead. It is possible to shoot off an enemy's limbs (head, arms, legs) leaving nothing left but a bloody torso. In the last mission there is also a fictional microwave weapon, causing the enemies to fry or explode, depending on the firing mode. However, nonviolence is a possibility, if the player is a good shot it is possible to shoot an enemy's weapon out of their hand, causing them to cower on the floor to surrender.\r\n-----------------------------------------------------------------------------\r\nRemember this game has great weapons and bad ass for Multiplayer and Single Player Alike. Prepare to have fun!","torrent":{"xt":"urn:btih:2fe86de71b76c32fa709dd9709ae5dcab8a1bb0c","amp;dn":"Soldier+of+Fortune+Gold+with+Updates","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2fe86de71b76c32fa709dd9709ae5dcab8a1bb0c","infoHashBuffer":{"type":"Buffer","data":[47,232,109,231,27,118,195,47,167,9,221,151,9,174,93,202,184,161,187,12]},"announce":[],"urlList":[]}}