{"title":"Korngold: Symphony, The Sea Hawk - OSy, James DePreist (1998)","uid":14451601,"size":311252474,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:30db1bf62a834bd7d66f9b68d1a7c1d6d6248b2f&amp;dn=Korngold%3A+Symphony%2C+The+Sea+Hawk+-+OSy%2C+James+DePreist+%281998%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Scheheraz","files":25,"time":1461757136,"description":"ERICH WOLFGANG KORNGOLD (1897-1957)\r\nThe Sea Hawk\r\nSymphony in F-Sharp\r\n\r\nAllMusic:\r\n&quot;In just about every way, this performance of Korngold's F Sharp Symphony is superior to the recent one on EMI by Franz Welser-Möst with the Philadelphia Orchestra. DePreist's reading is more atmospheric, offers better balances, features crisper and more potent attacks, has greater passion and romance in the Adagio, and--dare I suggest?--serves up playing from his Portland-based group with more character and robustness than heard on the EMI disc. How, you ask, can this be? Search me--I only report what I hear. To an extent, one might explain the apparent disparity by observing that the Philadelphia strings are lusher, to be sure, but corrupt the sonic perspective somewhat with their domineering presence, and, superior though they may generally be to the impressive strings of the Oregon Symphony, actually work against the performance, in certain places, to a minor degree. Still, I like the EMI effort, but it's not in the same class as this utterly stunning new one from Delos.\r\nDePreist not only sharply etches the urgency and menace in the opening movement about as incisively as you're likely to hear them, but deftly captures the vivacity and brilliance of the finale as well, probably the work's most difficult movement to bring off effectively, owing mainly to the quotations and innovative developments of previous material. I'm not sure I'm fond of the composer's rather malapropos evocation of the spirit of Till Eulenspiegel in this movement. That might be my only criticism of this splendid work, however, and that judgment, I must confess, might be tainted by my general indifference to the music of Richard Strauss.\r\nThe Sea Hawk is comprised of music from the 1940 film classic, and breaks down into three sections: &quot;Main Title,&quot; &quot;Reunion,&quot; and &quot;Finale.&quot; I'm not sure by whose hand nearly two hours worth of music was distilled into this 8:06 suite, but the job was well done in that more of this colorful, splashy, light score might have yielded less artistically. Here we get an interesting filler that contains much tuneful material in splendid orchestration that evokes an era of swashbucklers, cliff-hangers, story-book romance, and happy endings.\r\nDePreist is a conductor whose work has garnered considerable praise, but praise for performances usually in the concert world's byways, and often covered only in arcane journals and less widely read newspapers. Thus he hasn't been accorded the acclaim he deserves. He should be conducting a world-class ensemble (some would say he is now with this Portland group-and on the basis of this effort I wouldn't challenge that assertion), and should have a hundred recordings to his credit. Count me among his fans. Delos provides extremely vivid sound and excellent notes. Highly recommended.&quot; --Robert Cummings\r\n\r\nThe Sea Hawk\r\n1. Main Title / Reunion / Finale (8:06)\r\nSymphony in F-Sharp, Op. 40\r\nDedicated to the memory of Franklin Delano Roosevelt\r\n2. I. Moderato ma energico (15:20)\r\n3. II. Scherzo: Allegro molto (10:33)\r\n4. III. Adagio: Lento (16:57)\r\n5. IV. Finale: Allegro (11:04)\r\nTotal playing time: 62:00\r\n\r\nThe Oregon Symphony\r\nJames DePreist\r\n\r\nRecorded: November 12 &amp; 13, 1997, Baumann Auditorium, George Fox University, Newberg, Oregon\r\nExecutive Producers: Amelia S. Haygood, Carol Rosenberger\r\nRecording Producer: Ramiro Belgardt\r\nRecording Engineer: John M. Eargle\r\nAssociate Engineer: Jeff Mee\r\nEditing: Ramiro Belgardt\r\nPrinted &amp; Manufactured in USA\r\n© 1998 Delos International, Inc.\r\nDE 3234","torrent":{"xt":"urn:btih:30db1bf62a834bd7d66f9b68d1a7c1d6d6248b2f","amp;dn":"Korngold%3A+Symphony%2C+The+Sea+Hawk+-+OSy%2C+James+DePreist+%281998%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30db1bf62a834bd7d66f9b68d1a7c1d6d6248b2f","infoHashBuffer":{"type":"Buffer","data":[48,219,27,246,42,131,75,215,214,111,155,104,209,167,193,214,214,36,139,47]},"announce":[],"urlList":[]}}