{"title":"Coast to Coast AM March 18 2013","uid":8281494,"size":55252096,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:31fe74c7ff554ba07a0d8e8a3e364abcbef33cab&amp;dn=Coast+to+Coast+AM+March+18+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1363852436,"description":"e.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t03-18-13\nHost: \tGeorge Noory\nGuests: \tMarshall Masters, Cris Putnam\n\nAuthor and publisher Marshall Masters specializes in Planet X and ancient civilizations. He discussed evidence for an object on the other side of the sun, which could be Planet X, and how this ties in with Hopi and other types of prophecy, as well as ancient texts including the Kolbrin Bible. He also related his research to that of the late Zecharia Sitchin known for his '12th Planet' theory, and a US Naval Observatory astronomer named Robert Harrington, who died suddenly after coming forward with information about possibly sighting Planet X. The Kolbrin Bible contains an allegory about how a celestial body flies by Earth, creating a large amount of volcanic activity, and leads to the destruction of Atlantis, Masters detailed. The so-called Lost Book of Nostradamus includes a prophecy about a harbinger of doom that will appear in the constellation of Ophiuchus, he continued.\n\nMasters believes that an &quot;object of interest&quot; captured in webcam photos of the Turrialba Volcano in Costa Rica is possibly a harbinger to the arrival of Planet X. He nicknamed the object &quot;Bluebonnet&quot; because of its bluish color and said that it appears before sunset near the ecliptic of the sun. Bluebonnet, he reported, may be planet-sized but can only be observed from high altitudes above the cloud cover during certain times of the day, such as sunset. He further suggested that this object could be the Blue Kachina prophesied by the Hopi that will be followed by a far more destructive Red Kachina. View a related video Masters shared with us.\n\nThe topic of Planet X keeps coming back because it's the only thing that explains all the extreme climate changes we've been undergoing, he contended, adding that he's concerned about seabeds rising and falling, and undersea volcanism. While Planet X won't hit the Earth, the biggest problem will be its interaction with our sun-- we may see catastrophic earth changes such as the pole shift that Edgar Cayce predicted, Masters warned. Further, he believes Planet X could be arriving this year. &quot;2012 was the warm-up band, and 2013 is the headline act,&quot; he commented.\nVatican &amp; ET Disclosure\n\nFirst hour guest, biblical prophecy expert Cris Putnam talked about the possibility that the Vatican is preparing for an ET savior. He cited the research being done at the Vatican Astronomical Technology Telescope in Arizona, which may tie in with a Vatican announcement about the existence of ETs, and he also noted that the Vatican astronomers in Arizona are members of the Jesuits, just like the newly elected Pope Francis. In their new book Exo-Vaticana, Putnam, along with with co-author Tom Horn, lay out the case that ET disclosure will part of an end-times deception prophesied in the Bible. More here.\n\nNews segment guests: Catherine Austin Fitts, John R. Lott\nWebsite(s):\n\n    yowusa.com\n    logosapologia.org\n    exovaticana.com\n\nBook(s):\n\n    Planet X Forecast and 2012 Survival Guide\n    Crossing the Cusp: Surviving the Edgar Cayce Pole Shift\n    Petrus Romanus: The Final Pope Is Here\n    Exo-Vaticana\n\n","torrent":{"xt":"urn:btih:31fe74c7ff554ba07a0d8e8a3e364abcbef33cab","amp;dn":"Coast+to+Coast+AM+March+18+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31fe74c7ff554ba07a0d8e8a3e364abcbef33cab","infoHashBuffer":{"type":"Buffer","data":[49,254,116,199,255,85,75,160,122,13,142,138,62,54,74,188,190,243,60,171]},"announce":[],"urlList":[]}}