{"title":"(Folk) Planxty Live 2004 DVDRip-AVC","uid":7263631,"size":2055426857,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:3220b72e917fa4070af9b9d26c0cdf0399226554&amp;dn=%28Folk%29+Planxty+Live+2004+DVDRip-AVC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":5,"time":1336812244,"description":"Genre: Folk / Irish Traditional\nDuration:\n\nDescription:\nPlanxty seemed to have disbanded in the early 80s, but rehearsals and a low-key gig in Lisdoonvarna led to gigs in Dublin and Clare in 2004, and Live 2004 captures the magic of those nights. It includes 14 classics from one of the most influential traditional bands of all time, with liner notes by Leagues O'Toole. Planxty was born in 1972 from the recording of Christy Moore's second album Prosperous. The core members were Christy, his old school mate Donal Lunny, piper extraordinaire Liam O'Flynn, and Andy Irvine. The four enjoyed each others company so much during the recording of Prosperous that they decided to have a go at making it a full-time adventure. They released a highly acclaimed single, &quot;The Cliffs of Dooneen&quot;, and over the following years the group grew to huge status in Ireland, Britain and throughout Europe. They recorded two other albums in the next two years and then split up leaving only The Planxty Collection (a collection of their first three albums) behind them. The original line-up of Christy, Andy, Liam and Donal reformed Planxty in 1979. They recorded three further albums including After the Break and The Woman I Loved So Well. In 1983, Christy Moore and Donal Lunny left to concentrate on Moving Hearts, with Liam and Andy pursuing solo careers. For many that was the end of Planxty, but Live 2004 shows the flame still burns.\n\nAttention! This rip is probably better than the USA DVD. It has been reconverted to PAL, in the DVD there's ugly ghosting.\n\nContainer: MKV\nVideo: 716x480 (~16:9), 1437 kbps, 25 fps\nAudio: AAC 2.0, 305 kbps, 48 kHz\nChapters: named\nBonus files have the same quality-based video and audio settings. Though the 'talk' parts have AC3 192 kbps from the DVD.\nMore info in .txt","torrent":{"xt":"urn:btih:3220b72e917fa4070af9b9d26c0cdf0399226554","amp;dn":"%28Folk%29+Planxty+Live+2004+DVDRip-AVC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3220b72e917fa4070af9b9d26c0cdf0399226554","infoHashBuffer":{"type":"Buffer","data":[50,32,183,46,145,127,164,7,10,249,185,210,108,12,223,3,153,34,101,84]},"announce":[],"urlList":[]}}