{"title":"Mike West Discography","uid":8607372,"size":518062852,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:322e542acefc18334994ecec28d4f6781ccde209&amp;dn=Mike+West+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Rewzilla","files":161,"time":1372049654,"description":"===========================================================\n\nMike West Discography\n\n===========================================================\n\n\n\nmixed mp3 and ogg\n\nAlbums...\n - Interstate 10\n - Home\n - Race That Train\n - 10 Easy Songs for Drill and Banjo\n - Econoline\n - New South\n - Oddities and Rarities (Volumes 1 and 2)\n - Redneck Riviera\n - The Man Who Could Fall Backwards\n\n\n\n===========================================================\n\n\n\nFrom http://www.mikewest.net/bio/index.html ...\n\n\n\n\nMike West rips on a banjo and sings songs that hit close, sometimes too close, to home. His eighth CD, &quot;New South&quot;(Binky/Squirrel Records), takes a tour through the new Confederacy. Roaring up from the Gulf coast to the Ozark mountains in a truck with no muffler, West tells stories against a backdrop of busted refrigerators and stripped down muscle cars. With a quick wit and fast fingers, he rolls together humor, politics, love, loss and foot stomping music.\n\n&quot;Splendid, wry and skewed American songs... a belting mix of Country, good time jug band and plain energy.&quot; -- Folk Roots, UK\n\n&quot;West's delta guitar, banjo and lyrics rattle and shake with an unmistakable energy that's simply outrageously good music, under any flag&quot; -- Crossroads, USA\n\nWest lives in New Orleans, where he plays the French Quarter clubs from sunset to sun-up. But the skinny troubadour also shows up on stages in Holland, England and Australia. West gigs three hundred nights a year across three continents, performing at festivals, schools and bars from Chicago to Wagga Wagga. Exceptional song writing and musicianship have earned him accolades including The Big Easy Entertainment Award for &quot;Best Country/Folk Artist&quot; and several awards for &quot;Best Album&quot; and &quot;Best Artist&quot; from Off Beat Magazine.\n\n&quot;West always succeeds in making you laugh until you cry or cry until you laugh.&quot; -- Dirty Linen, USA\n\n&quot;Although (the songs) sound as if they came from long ago, their up-to-the-minute insights reveal their modernity.&quot; -- No Depression, USA\n\nTen years ago, the Australian born singer came to America with a toothbrush, two clean shirts and a taste for hillbilly music. &quot;As a kid, I strummed guitar for loose change in train stations.&quot; says West, &quot;One day I heard a guy picking a banjo in the street so loud that it drowned out the traffic noise. I knew then that it was the instrument for me.&quot; West settled in the Ninth Ward of New Orleans, took up banjo and mandolin, and began writing songs about his neighborhood. He has built an international reputation as an energetic entertainer who can get a Mardi Gras crowd clogging, and as an insightful lyricist with a skewed but accurate view of life in South Louisiana.\n\n&quot;Every day tales of marginal folks, imbued with wit and humanity... Mike West is a story teller par excellence.&quot; -- City Life Magazine, UK\n\n&quot;A maverick talent.... the bastard son of Uncle Dave Macon and Tom Lehrer&quot; -- Rock 'n' Reel, UK\n\nIn spite of a rigorous touring schedule, West finds time to record with other artists, such as Shawn Mullins (Columbia), Chuck Brodsky (Red House) and Kirk Rundstrum (Bloodshot). He also produces many up-and-coming songwriters at his studio. &quot;Dubbed the Allen Toussaint of the lower Ninth Ward, Mike West has gone from idiosyncratic folk singer to indispensable producer&quot; (The Gambit). On rare days off, he picks mandolin on the steps of his shot gun house, down river from the casino and up river from the oil refinery.\n\nMike West has performed at: the New Orleans Jazz &amp; Heritage Festival, Louisiana; Festivale International, Louisiana; Port Fairy Folk Festival, Australia; Tamworth Country Music Festival, Australia; Folk Roots Festival, Holland; The Naked Song Songwriter Festival, Holland; Broadstairs Folk Week, UK; Severn Revels, UK; Wild Flower Songwriter Festival, Texas. Woody Guthrie Fest, Oklahoma; Cherokee Nation Folk Fest, Oklahoma; Frank Brown Songwriter Festival, Alabama; road houses and honky tonks everywhere.\n\nHis CDs are played on public, college and commercial stations in the USA, Australia, Canada, Belgium, Britain, Denmark, France, Germany, Holland, Ireland, Italy, Japan, New Zealand, Slovenia, Sweden &amp; Yugoslavia.","torrent":{"xt":"urn:btih:322e542acefc18334994ecec28d4f6781ccde209","amp;dn":"Mike+West+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"322e542acefc18334994ecec28d4f6781ccde209","infoHashBuffer":{"type":"Buffer","data":[50,46,84,42,206,252,24,51,73,148,236,236,40,212,246,120,28,205,226,9]},"announce":[],"urlList":[]}}