{"title":"Ultrasound - Everything Picture, Disc 1 [1999]","uid":9738638,"size":277228075,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3274c3968ec8224441ad56fd075d64e26a94f396&amp;dn=Ultrasound+-+Everything+Picture%2C+Disc+1+%5B1999%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GenXRock","files":-1,"time":1394474782,"description":"Review by Dean Carlson  [-]\nA bad storm can be a good thing. Following a torrent of hype and anticipation, Ultrasound unleashed this two-part album full of discordant songcraft and angular vocals. Lead singer Tiny Wood is the voice amidst this whirl of distortion, but instead of creating a rolling contrast to the musical typhoon (as bassist Vanessa Best does so well in her solo and backing vocals), he can't quite hold it all together. Everything Picture is an immense release in a number of ways: immodest song lengths, uncountable layers of production, and the fact that it takes two parts to state its case. If one is prepared for the abrasive onslaught, however, the album is actually quite powerful. The triumphant buildup of a fan-rallying song like &quot;Stay Young&quot; shows that Tiny and company know their music, and more importantly, that they know what it's like to love it all. The sprawling &quot;Aire and Cader&quot; also rolls along with such tattered pride that it's impossible to hate, while the re-worked &quot;Floodlit World&quot; is quiet class. Unfortunately, the album can be too much at times. Anybody craving a &quot;relaxed&quot; night of listening will have their eardrums shredded. Luckily, even when it's about to crack on its own self-belief (&quot;My Impossible Dream&quot;), Everything Picture blows its own flaws out of the water. The album's final song, the title track, is a growling masterpiece: a frantic, crushing breakdown controlled by Vanessa's wails and cries. The musical and emotional collapses are so moving, so stirring, that it sounds like the pessimistic turn to just about every soaring, triumphant song ever found on the planet. This reason alone serves as a singular, important experience. So while you might feel like that poor local weatherman in a yellow slicker getting pelted when you listen to this album, by the time the final track fades out you realize it was worth every last, sonic droplet.","torrent":{"xt":"urn:btih:3274c3968ec8224441ad56fd075d64e26a94f396","amp;dn":"Ultrasound+-+Everything+Picture%2C+Disc+1+%5B1999%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3274c3968ec8224441ad56fd075d64e26a94f396","infoHashBuffer":{"type":"Buffer","data":[50,116,195,150,142,200,34,68,65,173,86,253,7,93,100,226,106,148,243,150]},"announce":[],"urlList":[]}}