{"title":"Chris Isaak - Chris Isaak Christmas","uid":6063507,"size":293783567,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:32f8fca232bbbff307a799eab344759639768982&amp;dn=Chris+Isaak+-+Chris+Isaak+Christmas&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ddawg","files":-1,"time":1293225813,"description":" &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51FvJcu5ImL._SS500_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51FvJcu5ImL._SS500_.jpg&lt;/a&gt;\n\n\nTitle: Chris Isaak Christmas\nArtist: Chris Isaak\nAudio CD (October 4, 2005)\nOriginal Release Date: October 12, 2004\nNumber of Discs: 1\nGenre: Christmas\nFormat: Free Lossless Audio Codec\n\n\nTrack Listing:\n\n01. Rudolf the Red-Nosed Reindeer\n02. Have Yourself a Merry Little Christmas\n03. Santa Claus Is Coming to Town\n04. Washington Square\n05. Blue Christmas\n06. The Christmas Song\n07. Hey Santa!\n08. Let It Snow\n09. Christmas on TV\n10. Pretty Paper\n11. White Christmas\n12. Mele Kalikimaka\n13. Brightest Star\n14. Last Month of the Year\n15. Gotta Be Good \n16. Auld Lang Syne \n17. Santa Bring My Baby Back\n\n\nAmazon Review:\nThere are those who will argue that Chris Isaak's Christmas is worth the sticker price for its rendition of &quot;Blue Christmas&quot; alone, and you'll be hard-pressed to find a pack of listeners to debate them. Isaak has always seemed the second coming of Elvis in surfer shorts, and on that track he so handily conjures the King it's both beautiful and creepy. But to pin this disc's merits on that chestnut alone is to sell it way, way short. There's the duet with Stevie Nicks on &quot;Santa Claus is Coming to Town&quot; to consider (she curtails her diva impulses and lets him steer, and though it's challenging to imagine, their voices weave well); plus the skill with which he incorporates his hula, rockabilly and country leanings (most obviously on &quot;Mele Kalikimaka,&quot; but also in instrumentation throughout); plus the five originals he assembled for this disc. So few original carols find an audience and keep them that to pen that many for a 16-track CD seems like yuletide suicide, but those who embrace Isaak's essential quirkiness can be counted on to resuscitate them for years to come. Standouts among the five include &quot;Washington Square&quot; which, as a lament for a faraway loved one, picks up where &quot;Blue Christmas&quot; leaves off, and &quot;Hey Santa,&quot; which subs for &quot;Jingle Bell Rock&quot; as this record's reason to rock the night away.\n\nAllmusic Review:\nIf you're going to invite a hipster recording artist into your home for Christmas, it may as well be Chris Isaak -- he's cool but he's also well-mannered, and can act sly enough for your thinks-she's-bohemian sister without scaring your Grandmother in the process. Like no small number of veteran recording artists, Isaak has cut an album of holiday tunes, cleverly called Chris Isaak Christmas, and while like most similar projects you get the sense that Chris didn't put quite the same amount of work into this that would of gone into a &quot;real&quot; album, he thankfully didn't skimp on quality control along the way. Isaak wrote five new tunes for this project, and &quot;Washington Square&quot; and &quot;Christmas on TV&quot; are solid contributions to his catalog of bummed-out love songs, while &quot;Gotta Be Good&quot; is a likable nugget of blues-flavored growl. Elsewhere, Isaak has thrown in a solid selection of Christmas standards, which he and his band have given an easygoing but full-bodied treatment that's solidly in the style of his best work, favoring the playful over the cloying. On the cool scale, Chris Isaak Christmas sure won't replace your copy of the Phil Spector Christmas album, but as background music for your Christmas party it makes for a happening switch from treacle like Kenny G or Mannheim Steamroller, and you know you can count on a surfer to sing &quot;Mele Kalikimaka&quot; like he already knows what it means. Just don't let Chris get too close to the mistletoe. The guy has a reputation, you know.","torrent":{"xt":"urn:btih:32f8fca232bbbff307a799eab344759639768982","amp;dn":"Chris+Isaak+-+Chris+Isaak+Christmas","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32f8fca232bbbff307a799eab344759639768982","infoHashBuffer":{"type":"Buffer","data":[50,248,252,162,50,187,191,243,7,167,153,234,179,68,117,150,57,118,137,130]},"announce":[],"urlList":[]}}