{"title":"Modem Booster 5.0(speeds up your internet) - greek43","uid":5285774,"size":3453870,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:340b6cb09fef3f389af719385daca8364e266bc6&amp;dn=Modem+Booster+5.0%28speeds+up+your+internet%29+-+greek43&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"greek43","files":2,"time":1263716797,"description":"\nModem Booster uses a revolutionary Ping technology to fine tune your modem settings to the exact value customized to your ISP for maximum throughput. It tests and optimizes your hidden Windows connection settings for Maximum Internet Speed!\n\nAfter this systematic fine-tuning process, Modem Booster tells you your expected speed boost in percentage terms, and tunes up your modem settings automatically.\n\nSo you now can DOUBLE your download speed, play online games SMOOTHLY, and DRAMATICALLY speed up your surfing activities on your local ISP or AOL, CompuServe 2000, MSN, NetZero, Prodigy &amp; AT&amp;T etc.\n\nHow do I use Modem Booster &amp; what does it do to my connection?\n\nEven if you're a novice user, a simple mouse-click is all Modem Booster needs to run the diagnostics and tune-up automatically.\n\nNO EXPERIENCE NEEDED. You don't need to have any technical knowledge! Just click on the Modem Booster icon to use the optimized settings.\n\nIf you're an advanced user, and are familiar with terms like MTU, RWIN, TTL and Cachesize, you can select Manual Tune Up to optimize the different components.\n\nAt the end of the speed tests, Modem Booster will tell you the Percentage Boost it has given your modem speed!\n\nBe surprised at the speed difference as web pages load in no time and files download faster than ever!\n\nplease seed after download \n&amp;\ndont forget to thank the uploader, cheers!!","torrent":{"xt":"urn:btih:340b6cb09fef3f389af719385daca8364e266bc6","amp;dn":"Modem+Booster+5.0%28speeds+up+your+internet%29+-+greek43","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"340b6cb09fef3f389af719385daca8364e266bc6","infoHashBuffer":{"type":"Buffer","data":[52,11,108,176,159,239,63,56,154,247,25,56,93,172,168,54,78,38,107,198]},"announce":[],"urlList":[]}}