{"title":"USB Safely Remove 4.2.4.845 Final (serial)","uid":5137813,"size":3617210,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:344c891886d0c757edf5d1f3380064fd4996797e&amp;dn=USB+Safely+Remove+4.2.4.845+Final+%28serial%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"aoloffline","files":-1,"time":1256603924,"description":"\nUSB Safely Remove 4.2 is publicly available! In the new version we have invested heavily in UI improvements, stability and Windows 7 compatibility. Find below the full list of changes. \nWindows may assign different drive letters to a certain device, so you are not sure what drive letter will have your flash drive on this connection. Usually it's a bit annoying but do not prevent you working. The problem will arise when you need to start non-portable applications from the flash drive or you wish to ask a desktop application to store data to your external drive. In this case the device must have a fixed drive letter that aren't changed amongst diferent connections.\n\nUSB Safely Remove 4.2 resolves that problem allowing you to fix drive letter to a device. Just open your device properties, switch &quot;Drive properties&quot; tab, choose required drive letter and check &quot;Fix drive letter&quot;. Starting from this moment your device will always stay with this drive letter and no one of other devices will occupy this letter even when your device is not connected. \n\nUSB Safely Remove get on well not only with USB drives, but with SATA (eSATA) devices as well. However some eSATA drives cannot be autodetected by Windows on connection. You have to run &quot;Scan For Hardware Changes&quot; from Windows Device Manager in order to see your drive in Explorer. You know it's a boring to do many clicks in order to get to Device Manager so we added this ability to the quick stop menu. \n\nWe have conducted extensive testing of the program under the newest version of Windows and now you can get benefit from using USB Safely Remove under both Windows 7 64 and 32-bit versions. \n\nVersion: 4.2 final\nSize: 3.4 MB\nOS: Win 2000XP2003\nVistaWin7, 3264 bit","torrent":{"xt":"urn:btih:344c891886d0c757edf5d1f3380064fd4996797e","amp;dn":"USB+Safely+Remove+4.2.4.845+Final+%28serial%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"344c891886d0c757edf5d1f3380064fd4996797e","infoHashBuffer":{"type":"Buffer","data":[52,76,137,24,134,208,199,87,237,245,209,243,56,0,100,253,73,150,121,126]},"announce":[],"urlList":[]}}