{"title":"Witches and the Grinnygog (MP4) Old VHS Rip","uid":6117518,"size":1631198157,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:356a23206509d1293da279a741f5d5a5f75af071&amp;dn=Witches+and+the+Grinnygog+%28MP4%29+Old+VHS+Rip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Muddyshoes","files":1,"time":1295619878,"description":"After not being able to find this for many years, I located a TV recorded copy on an old VHS tape from a friend. As the recording is 18 years old, the tape had started to demagnetize so it's about what you would expect from an old VHS tape.\n\nHopefully there will be higher resolution copy available soon!\n\n=============\n\nAdapted from Dorothy Edwards' children's novel of the same title, The Witches and the Grinnygog is an intelligent story of mediaeval witchcraft crossing into the modern world (as a survival of pre-Christian traditions), folklore, ghosts and time-slips. When an ancient English church is moved to a new site, one stone - a strange statue - is found to be missing. \n\nIts disappearance coincides with the arrival in the town of three eccentric old women who seem to be looking for something lost many years before, and a nervous, &quot;other-worldly&quot; child. The townsfolk find themselves looking into their collective past but it takes a group of children to put the pieces of the puzzle together and make amends for an ancient injustice. \n\nNotable for its portrayal of witches as something other than evil old hags, and helped by fine performances, The Witches and the Grinnygog is a haunting tale of the supernatural which has inexplicably never been repeated in the UK and is not available on video or DVD. It's high time it was.\n\n\n--------------------------------------------------------------------------------\n","torrent":{"xt":"urn:btih:356a23206509d1293da279a741f5d5a5f75af071","amp;dn":"Witches+and+the+Grinnygog+%28MP4%29+Old+VHS+Rip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"356a23206509d1293da279a741f5d5a5f75af071","infoHashBuffer":{"type":"Buffer","data":[53,106,35,32,101,9,209,41,61,162,121,167,65,245,213,165,247,90,240,113]},"announce":[],"urlList":[]}}