{"title":"Fixmer McCarthy - Into The Night (2008)","uid":4209550,"size":83184078,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:35e88b04966192f24814f6ad3ac19d5543197163&amp;dn=Fixmer+McCarthy+-+Into+The+Night+%282008%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"abuzaind","files":17,"time":1211992537,"description":"A project from Terence Fixmer and Douglas McCarthy (Nitzer Ebb).\n\nAfter many years of silence Douglas McCarthy, the legendary voice of Nitzer Ebb, is ready for a new electronic WAR ! ! He has joined forces with Terence Fixmer to create Fixmer /McCarthy - a new project that combines both their strengths.\n\nTerence in charge of the music, bringing his energised analogue sequences, Douglas in charge of the vocals, bringing his own unique energy and powerful voice.\n\nTerence Fixmer, a world renound techno artist , has been involved in the techno scene for more than 10 years. In 1998 he signed to Gigolo Records and has gone on to have many hits such as &quot;Electrostatic&quot;, &quot;Body Pressure&quot;, &quot;Electric Vision&quot; and the album &quot;Muscle Machine&quot; (voted as the top 3 album of the year for Groove Mag). He also has remixed tracks for amoungst others Sven Vath Dave Clarke and Hell. Terence became famous through his live performance - a kind of mixture of EBM and Techno, i.e. full of energy and power. When you see a Terence Fixmer show you never forget it ! His sound is unique and instantly recognisable as his own. He has played at the biggest events such as I Love Techno, May Day, Nature One, and the biggest festivals such as Pukkelpop, Dour Festival, Benicassim as well as appearing at the best techno clubs all over the world.","torrent":{"xt":"urn:btih:35e88b04966192f24814f6ad3ac19d5543197163","amp;dn":"Fixmer+McCarthy+-+Into+The+Night+%282008%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35e88b04966192f24814f6ad3ac19d5543197163","infoHashBuffer":{"type":"Buffer","data":[53,232,139,4,150,97,146,242,72,20,246,173,58,193,157,85,67,25,113,99]},"announce":[],"urlList":[]}}