{"title":"Scott Adams - Stick to Drawing Comics, Monkey Brain - 160 kBs","uid":4106132,"size":586318360,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:363d68201e07da4e894bfe94dbddb27965a1ee98&amp;dn=Scott+Adams+-+Stick+to+Drawing+Comics%2C+Monkey+Brain+-+160+kBs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"paulyearwig","files":262,"time":1206814195,"description":"\n\n\nSynopsis:  The creator of Dilbert ventures into hilarious new territory.\n\n\n\nEveryone knows Scott Adams as the king of workplace humor. No office is complete without a few Dilbert strips on the wall. And if you compare a VP to the Pointy-Haired Boss, no further description is necessary.\n\nBut why should a humorist stick to the workplace when there are so many other great subjects to explore? What about politics? Religion? Malfunctioning underpants?\n\nDespite some fans who wish he would ?Stick to Drawing Comics, Monkey Brain!? Adams now offers more than 150 short pieces on every slice of human existence, from airport fiascos to wedding planning, from his doughnut theory of the universe to the menace of car singing. Like George Carlin or Jerry Seinfeld, Adams isn?t afraid to ask the really big questions. For instance:\n\n---If a Finnish teenager hacks into our voting machines and picks the next president, would that really make things worse?\n\n---How can you know for sure that Charles Schwab didn?t take all of your money and spend it on hookers and cocaine?\n\n---Is it okay to think your own thoughts during the gaps between the words when your wife is talking?\n\n---How much would it cost to have your own army of Third World mercenaries? And would it be wrong to make them join coalitions just so you can hear the president say your name on TV?\n\n---Do you really need to respect the religious views of people who killed themselves to follow a comet? Or is pretending okay?\n\n---If you were a supermodel, would you sell your DNA to a billionaire who planned to raise your clone as a sex slave? \n\n\n\nFull Title.......: Stick to Drawing Comics, Monkey Brain!: Cartoonist Ignores Helpful Advice\nPub. Date........: November 2007\nGenre............: Humor / Business &amp; Professional / Essays\nAuthor...........: Scott Adams\nRead By..........: William Dufris\nLanguage.........: English\nUnabridged.......: Yes\n\nDistributor......: Tantor Media\nNo. of Discs.....: 8 Compact Discs\nTotal Length.....: 10 Hours\nISBN-10..........: 1400105498\nISBN-13..........: 1400105496\n\nAudio............: MPEG-1 Layer 3  44100 Hz  (192kBit Variable)\nCodec............: LAME 3.97\nProgram Used.....: Exact Audio Copy v0.99pb3\n\n\n","torrent":{"xt":"urn:btih:363d68201e07da4e894bfe94dbddb27965a1ee98","amp;dn":"Scott+Adams+-+Stick+to+Drawing+Comics%2C+Monkey+Brain+-+160+kBs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"363d68201e07da4e894bfe94dbddb27965a1ee98","infoHashBuffer":{"type":"Buffer","data":[54,61,104,32,30,7,218,78,137,75,254,148,219,221,178,121,101,161,238,152]},"announce":[],"urlList":[]}}