{"title":"My.Dream.Home.s03e11.PDTV.x264.Hector.mp4","uid":9683343,"size":385754195,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:378cc5d0052cb6622c69f6d1e47f121f63bedb76&amp;dn=My.Dream.Home.s03e11.PDTV.x264.Hector.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GaryBradbury2012","files":-1,"time":1393706686,"description":"This show is called &quot;Property Brothers&quot; in some countries.\nPlease note that the episodes will soon be uploaded in a rather random order as that is the way Foxtel (my TV service) presents them! Luckily, you don't need to watch episode 8 before episode 9 etc!\n\nHaving sold their downtown condo, Caitlin and Steve are wearing out their welcome with friends in the 'burbs. They want a big, open concept, eco-home within walking distance of all amenities. The Property Brothers come to the rescue helping them find a budget-friendly dream home that can be renovated on time. \nWith a budget that doesn't match the couple's expectations, Drew and Jonathan struggle to sell the potential of a fixer-upper. The couple must make tough choices right away when a higher price eats into the reno budget. \nJonathan plays with luck by testing an old superstition during the demo. \nPlumbing issues add to Caitlin and Steve's stress as they live through the chaotic construction. But things really come to a head when Jonathan gets ready to tackle the kitchen. With time ticking away, the couple struggles to keep cool as they tackle additional obstacles and disagreements.\n\nIf you see &quot;Hector&quot; on the end of a file it means I capped it.\nEnjoy, Gaz/Hector :)","torrent":{"xt":"urn:btih:378cc5d0052cb6622c69f6d1e47f121f63bedb76","amp;dn":"My.Dream.Home.s03e11.PDTV.x264.Hector.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"378cc5d0052cb6622c69f6d1e47f121f63bedb76","infoHashBuffer":{"type":"Buffer","data":[55,140,197,208,5,44,182,98,44,105,246,209,228,127,18,31,99,190,219,118]},"announce":[],"urlList":[]}}