{"title":"Fractional Calculus with Applications for Nuclear Reactor Dynami","uid":14535056,"size":23453102,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:37c7916322ac26d461040fb0d9f74c2e473e406c&amp;dn=Fractional+Calculus+with+Applications+for+Nuclear+Reactor+Dynami&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1462487764,"description":"Fractional Calculus with Applications for Nuclear Reactor Dynamics - Santanu Saha Ray (CRC, 2016).pdf\r\n\r\nISBN 978-1-4987-2728-0\r\n\r\nIntroduces Novel Applications for Solving Neutron Transport Equations\r\n\r\nWhile deemed nonessential in the past, fractional calculus is now gaining momentum in the science and engineering community. Various disciplines have discovered that realistic models of physical phenomenon can be achieved with fractional calculus and are using them in numerous ways. Since fractional calculus represents a reactor more closely than classical integer order calculus, Fractional Calculus with Applications for Nuclear Reactor Dynamics focuses on the application of fractional calculus to describe the physical behavior of nuclear reactors. It applies fractional calculus to incorporate the mathematical methods used to analyze the diffusion theory model of neutron transport and explains the role of neutron transport in reactor theory.\r\n\r\nThe author discusses fractional calculus and the numerical solution for fractional neutron point kinetic equation (FNPKE), introduces the technique for efficient and accurate numerical computation for FNPKE with different values of reactivity, and analyzes the fractional neutron point kinetic (FNPK) model for the dynamic behavior of neutron motion. The book begins with an overview of nuclear reactors, explains how nuclear energy is extracted from reactors, and explores the behavior of neutron density using reactivity functions. It also demonstrates the applicability of the Haar wavelet method and introduces the neutron diffusion concept to aid readers in understanding the complex behavior of average neutron motion.\r\n\r\nThis text:\r\n\r\nApplies the effective analytical and numerical methods to obtain the solution for the NDE\r\nDetermines the numerical solution for one-group delayed neutron FNPKE by the explicit finite difference method\r\nProvides the numerical solution for classical as well as fractional neutron point kinetic equations\r\nProposes the Haar wavelet operational method (HWOM) to obtain the numerical approximate solution of the neutron point kinetic equation, and more\r\n\r\nFractional Calculus with Applications for Nuclear Reactor Dynamics thoroughly and systematically presents the concepts of fractional calculus and emphasizes the relevance of its application to the nuclear reactor","torrent":{"xt":"urn:btih:37c7916322ac26d461040fb0d9f74c2e473e406c","amp;dn":"Fractional+Calculus+with+Applications+for+Nuclear+Reactor+Dynami","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37c7916322ac26d461040fb0d9f74c2e473e406c","infoHashBuffer":{"type":"Buffer","data":[55,199,145,99,34,172,38,212,97,4,15,176,217,247,76,46,71,62,64,108]},"announce":[],"urlList":[]}}