{"title":"AoA Audio Extractor Platinum 2.2.9 [ak]","uid":6408076,"size":7784166,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:38a0f847291b2d8daf83bc232f416bca334dcb93&amp;dn=AoA+Audio+Extractor+Platinum+2.2.9+%5Bak%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anacondaz","files":-1,"time":1305881227,"description":"AoA Audio Extractor Platinum 2.2.9\n\nAoA Audio Extractor provides you a handy tool to extract audio/sound or background music from video files. Comparing to the free version, AoA Audio Extractor Platinum has more features, such as Audio Conversion, Sound Recording, Voice Changer and Karaoke Sound Recording. It also supports much more audio and video formats.\n\nKey Features:\nAudio Extractor: Extract audio tracks from AVI, MPEG, MPG, FLV (Flash Video), Youtube, DAT, WMV, MOV, MP4, 3GP video files and save them as MP3, WAV, iPhone Ringtone, WMA and AC3 formats.\nIt can also be used to save any portion of the audio of a video file.\nAudio Conversion: Convert audio files between different formats, such as MP3, WMA, WAV, M4A, iPhone Ringtone, OGG and AC3.\nSound Recording (Capture Audio): Record your voice or any sound from microphone, CD/DVD player and any other input line available with your sound card. Save sound recordings directly to MP3, WAV.\nVoice Changer: Change your voice in real time by dragging the slider.\nKaraoke Song Recording You can select a popular song (WAV,MP3) and sing along with the song. AoA Audio Extractor Platinum records your voice while singing, process your voice with real time voice effects.\n\nHome Page - http://www.aoamedia.com/\n\n","torrent":{"xt":"urn:btih:38a0f847291b2d8daf83bc232f416bca334dcb93","amp;dn":"AoA+Audio+Extractor+Platinum+2.2.9+%5Bak%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38a0f847291b2d8daf83bc232f416bca334dcb93","infoHashBuffer":{"type":"Buffer","data":[56,160,248,71,41,27,45,141,175,131,188,35,47,65,107,202,51,77,203,147]},"announce":[],"urlList":[]}}