{"title":"The Band - The Night They Drove Old Dixie Down (Xvid-2nafish)","uid":6015891,"size":72855358,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:38a6951c6ccc4429e343a4d8b489b27e63553475&amp;dn=The+Band+-+The+Night+They+Drove+Old+Dixie+Down+%28Xvid-2nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1291635040,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:04:15\n\n[Video]\nResolution : 640x360\nCodec : XviD MPEG-4 codec\nFPS : 29.97\nBitRate : 2152 Kbps\nQuality Factor : 0.32 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 44100 Hz\nBitRate : 128 Kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;The Night They Drove Old Dixie Down&quot; is a song written by Canadian musician Robbie Robertson, first recorded by The Band in 1969 and released on their self-titled second album.\n\nThe lyrics tell of the last days of the American Civil War and its aftermath. Confederate soldier Virgil Caine &quot;served on the Danville train&quot;, the main supply line into the Confederate capital of Richmond, Virginia. General Robert E. Lee's Army of Northern Virginia is holding the line at the Siege of Petersburg. As part of the offensive campaign, Union Army General George Stoneman's forces &quot;tore up the track again&quot;. The siege lasted from June 1864 to April 1865, when both Petersburg and Richmond fell, and Lee's troops were starving at the end (&quot;We were hungry / Just barely alive&quot;). Virgil relates and mourns the loss of his brother: &quot;He was just eighteen, proud and brave / But a Yankee laid him in his grave&quot;.\n\nSome later versions of the song have the line &quot;Virgil, quick, come see, there goes the Robert E. Lee&quot; appears to reference the steamboat of the same name, constructed in 1866. The original versions of the lyrics read &quot;...there goes Robert E. Lee&quot; but the odds of a farmer in Tennessee seeing the steamboat would be considerably higher than those of spotting the Civil War general himself.\n\nThe Band is the eponymous second album by The Band, released on September 22, 1969. It is often called The Brown Album, in the spirit of the Beatles' The White Album.\n\nThe Band peaked at #9 on Billboard's Pop Albums chart. In 2000, it recharted on Billboard's Internet Albums chart, peaking at #10. The singles &quot;Rag Mama Rag&quot; and &quot;Up on Cripple Creek&quot; peaked on the Pop Singles chart at #57 and #25 respectively.\n\nThe album includes many of The Band's best-known and critically acclaimed songs, including &quot;The Night They Drove Old Dixie Down&quot;, which Rolling Stone named the 245th greatest song of all time. In 2003, the album was ranked number 45 on Rolling Stone magazine's list of the 500 greatest albums of all time. In 1998 Q magazine readers voted The Band the 76th greatest album of all time. TIME magazine included it in their unranked 2006 list of the 100 greatest albums.\n\nAccording to the liner notes to the 2000 reissue of &quot;The Band&quot; by Rob Bowman, the album, &quot;The Band&quot;, has been viewed as a concept album, with the songs focusing on people, places and traditions associated with an older version of Americana.\n\nThus, the songs on this album draw from historic themes for &quot;The Night They Drove Old Dixie Down&quot; , &quot;King Harvest (Has Surely Come)&quot; and Richard Manuel's &quot;Jawbone&quot; (which was composed in the unusual 6/4 time signature.)\n\nThe album was reissued in 2009 by Audio Fidelity as a limited edition gold CD. Remastered for the first time on CD from the original master tapes (which Capitol evidently no longer possesses), the album also included a single b-side &quot;Get Up Jake&quot; as a bonus track. Originally slated for the album &quot;Get Up Jake&quot; was dropped from the original album line-up at the last minute because the band felt it was too similar to another track on the album.\n\nIn 2009, the album was preserved into the National Recording Registry because the album was &quot;culturally, historically, or aesthetically important, and/or informs or reflects life in the United States.&quot;\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:38a6951c6ccc4429e343a4d8b489b27e63553475","amp;dn":"The+Band+-+The+Night+They+Drove+Old+Dixie+Down+%28Xvid-2nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38a6951c6ccc4429e343a4d8b489b27e63553475","infoHashBuffer":{"type":"Buffer","data":[56,166,149,28,108,204,68,41,227,67,164,216,180,137,178,126,99,85,52,117]},"announce":[],"urlList":[]}}