{"title":"Outsim SynthMaker v1.1.1","uid":4359316,"size":15295839,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:38cfa795c54be6481001cd910f14716e797bcd5f&amp;dn=Outsim+SynthMaker+v1.1.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Jodyanne","files":5,"time":1219573195,"description":"Screenshot: &lt;a href=&quot;\nhttp://jody.hopto.org/imagehost/images/jody/utsimsynthmakerv1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://jody.hopto.org/imagehost/images/jody/utsimsynthmakerv1.jpg&lt;/a&gt;\n\nInfo:\nOutsim has announced the release of version 1.1 of SynthMaker. This release focuses on reliability and contains more than 60 important bug fixes and enhancements. But it&amp;#039;s not all bug fixes - some new components and modules are also included. Most notable is the iFFT. This is a triggered version of iFFT not stream but it allows for some interesting possibilities. It is used in the new Additive Oscillator module which allows you to draw waveforms in the frequency domain. Outsim also added components for getting the MAC address and Hard Disk id of the host PC. These are much requested moddules that will allow you to build simple copy protection systems into your creations should you wish to do that. Finally there is a new De-zipper primitive that works more efficiently and solves some of the problems in the old De-zipper module when used with MIDI CC.\n\nNew Components:\n\n    * iFFT\n    * FFT\n    * Real/Img to Magnitude/Phase\n    * Magnitude/Phase to Real/Img\n    * Float Array Resample\n    * MAC Address\n    * Hard Disk Serial\n    * Wave Read Hop\n    * De-zipper\n\nNew Modules:\n\n    * Additive Osc\n\nAdditions and Fixes:\n\n    * Added new triggered FFT and iFFT components plus converters for complex to magnitude and phase.\n    * New Additive Oscillator module.\n    * New components for finding the MAC address and Hard Disk id of the host PC.\n    * Midi reinitialising is much faster now.\n    * Fixed a problem that was causing the compiled code to reach the defined limit.\n    * The Init stage was not being run after a relink which was affecting the behaviour of some exported VSTs.\n    * Fixed a possible crash due to the Signal Analyser not compiling correctly on loading.\n    * Fixed some window repainting issues particularly when using external MIDI controllers.\n    * Fixed a problem with the code limit being reached sometimes when using Signal Analysers.\n    * Dragging (and drag selecting) modules that have been copied or are synced is much faster now in large schematics.\n    * Changed the loading message so that it indicates when SynthMaker is updating after loading.\n    * The Multi LFO and Multi OSC modules now use the full sawtooth not the half bandwidth version in the Square wave.\n    * Module syncing now takes account of the position of items. This was causing strange positional displacements.\n    * Performing the Make module command on selections containing a selector was sometimes losing links and types.\n    * Buses passing streams were sometimes being set up with the incorrect types resulting in undefined numbers.\n    * Fixed a problem in drawing for the GraphLines component that was causing audio glitches.\n    * Fixed a bug in the IntArray component which caused crashes when assigning ints.\n    * Fixed a an infinite loop caused by chaining modules with no insts inside them.\n    * Fixed the sync in the wave table read component.\n    * Fixed a problem with changing presets in Live and also crashing when looping notes.\n    * Changed the behaviour of the PALines component so that it treats the X and Y axis input data the same.\n    * Deleted the unused components from the Push Button module.\n    * Stopped the MIDI Splitter component from sending triggers when sysex events are received.\n    * The Float Inverse component now returns zero instead of minus zero when zero is input.\n    * Updated all slider modules to set the mouse hidden option according to fine tune so the slider doesn&amp;#039;t stop when moving in this mode.\n    * Set the default number of steps to 5 and the default value to 0.5 in all knobs and sliders.\n    * Fixed a problem with fistp not colouring correctly in the assembler component.\n    * Fixed a problem with crashing in Reaper when switching presets.\n    * Corrected a bug in the mix part of the Reverb module.\n    * Fixed a memory overwrite problem in the stream pitch to freq component.\n    * Corrected a problem which occurs when morphing presets in exported VSTs in Orion Platinum.\n    * New option to include or remove DC offset when processing waves.\n    * Added a new resample component.\n    * The Selector component title now reads Selector and not Select.\n    * Fixed a bug in the Bus that was causing held notes with envelopes when outputs are not connected at a Bus End.\n    * Fixed an audio glitch problem with the Float Array Sample and Hold component.\n    * The Is Editor Open component wasn&amp;#039;t working in exported VSTs.\n    * Made an improvement to editing speed in the Assembler component.\n    * Fixed a Redraw glitch which was causing the background to sometimes disappear in some exported VSTs.\n    * The andps opcode was not highlighting correctly the Assembler component when the 2nd parameter was a register.\n    * Fixed an infinite loop caused by relinks and triggers through a bus.\n    * Fixed a problem caused by deleting sub modules that are displayed on an open properties panel above. Saving would then result in warning messages on reload. This would also cause a crash on close.\n    * Sometimes deleted sub modules containing property items were not being reflected if the propertied panel was open.\n    * Fixed a crash that could occur when dragging modules into a schematic which contain selectors or multiplexers that work on stream data.\n    * Fixed a bug in copy and paste that was causing crashes.\n    * Added a new Wave Read Hop component to allow you to do more efficient reads when a per sample lookup is not necessary.\n    * The old Wave Table Read component now uses the new code for better compatibility - no need to replace the component now.\n    * The Wave Display component now initialises after loading.\n    * Added an extra input to the Wave Table primitive to allow you to preserve the DC component instead of setting it to zero.\n    * Made some changes to improve stability when loading presets from text files.\n    * Corrected a graphical glitch that shows up when using exported plugins that open a File Dialog.\n    * Superceded components now show with a red and white border so you can identify them &amp; the help text provides extra clarification.\n    * MIDI messages were being sent out incorrectly to external devices if the channel was set to zero.\n    * Adding a Readout module under certain conditions was causing a crash.\n    * The sample index counter stored in ecx was being reset after each buffer pass.\n    * Changed the mono readout to use mono to float.\n    * Fixed some graphical glitches preventing redraws in certain circumstances in some hosts.\n    * In an exported VST, after a relink (caused by selector changes in stream sections) strange audio drop outs or peaks could occur.\n    * The Search Bar now searches through the help text of a component or module.\n    * MIDI to Poly module updated to provide a better portamento range.\n    * Corrected an issue that was causing crashes in some hosts when adding float arrays.\n\nUpdated Modules:\n\n    * Reverb\n    * Multi LFO\n    * Multi OSC\n    * Animated Knob\n    * Bitmap Knob\n    * Readout Knob\n    * Split Knob\n    * Vector Knob\n    * Push Button\n    * Horizontal Slider\n    * Vector Slider\n    * Vertical Slider\n    * MIDI to Poly\n    * Mono Readout\n    * De-zipper\n    * Plus all modules that use de-zippers\n\n","torrent":{"xt":"urn:btih:38cfa795c54be6481001cd910f14716e797bcd5f","amp;dn":"Outsim+SynthMaker+v1.1.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38cfa795c54be6481001cd910f14716e797bcd5f","infoHashBuffer":{"type":"Buffer","data":[56,207,167,149,197,75,230,72,16,1,205,145,15,20,113,110,121,123,205,95]},"announce":[],"urlList":[]}}