{"title":"Tony White's Animator's Notebook (gnv64)","uid":8552590,"size":23971551,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:38d3e8fe0d2c5245173f9662e7dfdfab5a723d77&amp;dn=Tony+White%27s+Animator%27s+Notebook+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"gnv65","files":-1,"time":1370685254,"description":"Tony White's Animator's Notebook \nby Tony White\nElsevier | 2012 | ISBN 978-0-240-81307-3 | xiv+246 pages | PDF | 22.6 mb &lt;a href=&quot;\nhttp://www.amazon.com/Tony-Whites-Animators-Notebook-ebook/dp/B005I48TOM&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Tony-Whites-Animators-Notebook-ebook/dp/B005I48TOM&lt;/a&gt;\n\nApprentice yourself to a master of classical animation techniques with this beautiful handbook of insider tips and techniques. Apply age-old techniques to create flawless animations, whether you're working with pencil and animation paper or a 3D application. Author Tony White starts with the basics, and expands his discussion to more advanced topics, like how to animate quadrupeds, working with fluidity and flexibility, and dialogue. White brings years of production experience and even more time as an instructor to the book, ensuring that The Animator's Notebook will serve well as your mentor in a book. The art from the book comes to life in the clips available on the book's web site. You'll get:\n\n* An associated website, which brings all the drawings in the book to life to show the presented principles in action \n* A look into the private notebook of a master animator\n* Essential classical techniques condensed into a beautiful handbook\n\nAbout the Author &lt;a href=&quot;\nhttp://www.tonywhiteanimation.com/uploads/6/5/3/8/6538416/4743441.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tonywhiteanimation.com/uploads/6/5/3/8/6538416/4743441.jpg&lt;/a&gt;\nTony White, renowned animator, director, professor, lecturer, and author, has been in the animation industry for over 30 years, and currently teaches 2D animation and oversees principal animation production classes at DigiPen Institute of Technology. White began his career working with legendary industry professionals like award-winning illustrator Ralph Steadman, animation gurus Ken Harris, Art Babbit (original lead animator on Pinocchio, Fantasia, and others at Disney). He also personally assisted, then directed/animated for Richard Williams (3-time Oscar winner and author of The Animator's Survival Kit). In addition to being the Dean of Fine Art and Animation at DigiPen, White founded and presides over The Animaticus Foundation, which he formed to preserve, teach and evolve the art form of traditional 2D animation. ","torrent":{"xt":"urn:btih:38d3e8fe0d2c5245173f9662e7dfdfab5a723d77","amp;dn":"Tony+White%27s+Animator%27s+Notebook+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38d3e8fe0d2c5245173f9662e7dfdfab5a723d77","infoHashBuffer":{"type":"Buffer","data":[56,211,232,254,13,44,82,69,23,63,150,98,231,223,223,171,90,114,61,119]},"announce":[],"urlList":[]}}