{"title":"Nation Forsaken, A - F Michael Maloof - ISBN 1936488566 &amp; 97","uid":7989393,"size":2843298,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:38fa0d7110130e3fac45c9afa7b47c67af760603&amp;dn=Nation+Forsaken%2C+A+-+F+Michael+Maloof+-+ISBN+1936488566+%26amp%3B+97&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RecycledElectrons","files":1,"time":1357376507,"description":"Book A Nation Forsaken\n\nF Michael Maloof \n\nISBN 1936488566 &amp; 978-1936488568\n\nOCRed text under the page image\n\nPublication Date: January 3, 2013\nThe United States is more vulnerable than ever to an EMP attack that could shut down the country overnight, resulting in tens of millions of deaths and a 19th-century lifestyle for Americans for the foreseeable future, says a new book, &quot;A Nation Forsaken,&quot; written by a long-time national security expert.\n\nEven worse, the threat doesn't just come from terrorists, but from unpreventable solar activity -- and a new peak period is on the way, threatening the economic and national security of the entire country, writes F. Michael Maloof.\n\nAlthough presidential candidates such as Newt Gingrich and congressmen such as Roscoe Bartlett have warned for years about the danger posed by an EMP, the government is ignoring simple, inexpensive steps that could safeguard critical infrastructure from an attack. Incredibly, even while the idea of an EMP has entered the public consciousness through pop culture events like NBC's new show &quot;Revolution,&quot; the federal government is ignoring its own reports and not taking it seriously.\n\nThe reality of a potentially devastating electromagnetic pulse event is brought home by Maloof in &quot;A Nation Forsaken.&quot; He reveals the nature of the EMP threat, describing how a nuclear detonation in low orbit creates an electromagnetic pulse that can disable all electronics throughout the entire country. The result would be a complete breakdown of the delivery and distribution of food, medicine and other essential supplies.\n\nThe author also describes the plausibility of such an attack, noting that several nations already have the means and motivation to use such weapons. Even more terrifying, Maloof describes how a &quot;natural&quot; EMP caused by solar flares is becoming ever more likely -- with increased likelihood in the first quarter of 2013.\n\nMaloof exposes the self-interested actions of the energy industry in preventing simple reforms that could potentially save millions of lives. Most importantly, Maloof provides a practical guide for how individuals and families can prepare for the day when the lights go out for good.\n","torrent":{"xt":"urn:btih:38fa0d7110130e3fac45c9afa7b47c67af760603","amp;dn":"Nation+Forsaken%2C+A+-+F+Michael+Maloof+-+ISBN+1936488566+%26amp%3B+97","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38fa0d7110130e3fac45c9afa7b47c67af760603","infoHashBuffer":{"type":"Buffer","data":[56,250,13,113,16,19,14,63,172,69,201,175,167,180,124,103,175,118,6,3]},"announce":[],"urlList":[]}}