{"title":"Cerita Kita","uid":8291986,"size":357372003,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3aed01696dd3b9fe04690255ae2376b3af68d7a7&amp;dn=Cerita+Kita&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Zaini711","files":-1,"time":1364066311,"description":"Release Date: 07 Mar 2013\n\nLanguage:Malay\n\nGenre:Romance\n\nRunning Time: 89 minutes\n\nDirector:Pierre Andre\n\nCast:Pekin Ibrahim, Yana Samsudin, Fezrul Khan\n\n\nKehidupan KAMAL yang dulunya pencuci kereta, kini berubah atas nasihat IKA, gadis yang dicintai Kamal dalam diam. Kerana terlalu sayangkan Ika, Kamal sanggup mengambil risiko dengan meminjam wang daripada ceti haram untuk membuka sebuah kedai burger tanpa pengetahuan Ika. Setelah berjaya membuka kedai burger, perniagaan Kamal berjalan dengan lancar dan Ika berasa lega dengan pencarian baru Kamal itu. \n\nKamal yang memang dari dulu mengidamkan Ika, sentiasa berusaha untuk memikat hati Ika sehingga sanggup mencari barang kesukaan Ika. Ika yang pada awalnya berasa selesa dengan Kamal, mula melupakan Kamal setelah pertemuan pertamanya dengan jejaka kaya bernama MALIK. Malik yang merupakan kawan kepada Kamal, turut mempunyai perasaan terhadap Ika sejak pertama kali mereka bertemu di satu kemalangan ringan. Ika mula tertarik dengan jejaka kaya itu dan mula melupakan Kamal. Kamal yang melihat perubahan Ika, mula berasa sedih dan kecil hati. Kamal cuba menasihati Ika ,jangan terlalu rapat dengan Malik, kerana Malik suami orang. \n\nIka mula berasa sangsi dan berfikir bahawa Kamal sengaja mereka cerita. Kamal terusan menasihati sehingga Ika berasa keliru dengan perasaannya. Jadi adakah Ika akan tetap memilih Malik? Atau sejauh manakah benar kenyataan Kamal ? ","torrent":{"xt":"urn:btih:3aed01696dd3b9fe04690255ae2376b3af68d7a7","amp;dn":"Cerita+Kita","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3aed01696dd3b9fe04690255ae2376b3af68d7a7","infoHashBuffer":{"type":"Buffer","data":[58,237,1,105,109,211,185,254,4,105,2,85,174,35,118,179,175,104,215,167]},"announce":[],"urlList":[]}}