{"title":"Contra A Copa- The Other Side of Brazil's World Cup","uid":10367375,"size":713487097,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3b14c29e5fd2e1ac8e4e0ebbb93d77b05e6cdc66&amp;dn=Contra+A+Copa-+The+Other+Side+of+Brazil%27s+World+Cup&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dcti6xtrm","files":1,"time":1402885367,"description":"In 2007, FIFA chose Brazil to host the World Cup. It seemed like brilliant idea hosting the World Cup in the most football-fanatic country on the planet. Little did they expect that it would become the focus of some of the largest protests Brazil has seen in decades. This mass civil uprising began in June of 2013 and it surprised even the most jaded Brazilians.\n\nHundreds of thousands of people paralyzed the cities across the country over a 20 cent increase in bus fares. The police response was brutal in the beginning. Elite military-police units trained to pacify real slums were brought to quell demonstrations. But the police violence drove more people into the streets. For the first time anyone can recall the people began to lose the fear of the police.\n\nThe protests have been remarkable for another reason. The public outrage bridged the wide class differences in Brazil. Rio's college-educated kids are fighting side by side with the protesters from the favela who are very familiar with the brutality of the police force. Thanks to the World's Cup they now have a common enemy - FIFA, the world governing body of football and the capitalism that it represents.\n\nIn exchange for hosting the World Cup, FIFA demanded upgrades to Brazil's infrastructure and internal security that's ballooned into the most expensive in football history - some 15 billion dollars. The government insists that all of this spending is worth it, but the past year has shown that the population is fed up. This outrage can only be contained through a massive mobilization of troops. 170,000 military and police are being deployed to secure the games.\n\nNew laws have granted the military and police special powers to arrest demonstrators. In a country emerging from decades of military dictatorship FIFA and the World Cup have given the police and armed forces a new reason to flex their muscles. This is not about football anymore.\n\nRUNTIME - 36 mins.","torrent":{"xt":"urn:btih:3b14c29e5fd2e1ac8e4e0ebbb93d77b05e6cdc66","amp;dn":"Contra+A+Copa-+The+Other+Side+of+Brazil%27s+World+Cup","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b14c29e5fd2e1ac8e4e0ebbb93d77b05e6cdc66","infoHashBuffer":{"type":"Buffer","data":[59,20,194,158,95,210,225,172,142,78,14,187,185,61,119,176,94,108,220,102]},"announce":[],"urlList":[]}}