{"title":"The traveling wilburys collection","uid":4025493,"size":516603529,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3ca18e3c850da34989aefadd32f244e748af7857&amp;dn=The+traveling+wilburys+collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"raw-head-rex","files":1,"time":1202860976,"description":"History\n\nInitially starting at a meal between Roy Orbison, George Harrison, and Jeff Lynne, they got together at Bob Dylan\\&amp;#039;s studio at Santa Monica, California to record an additional track as a B-side for the single release of Harrison\\&amp;#039;s \\&quot;This Is Love\\&quot;. Tom Petty\\&amp;#039;s involvement was by chance as Harrison had left his guitar at Petty\\&amp;#039;s house. The song they came up with was \\&quot;Handle with Care\\&quot;. However, the record company immediately realized it was too good to be released as a \\&quot;single filler\\&quot;.\n\nThey enjoyed working together so much that they decided to create an album together. Written by all its members, the album was recorded over a ten-day period in May 1988 because Dylan was due to go on tour. Released on October 18, 1988 (under various pseudonyms as half-brothers, supposed sons of Charles Truscott Wilbury, Sr.), the album Traveling Wilburys Vol. 1 was in 1989 ranked #70 on Rolling Stone magazine\\&amp;#039;s list of the 100 greatest albums of the 1980s. It was later nominated for a Grammy under the category Album of the Year. The death of band member Roy Orbison (on December 6, 1988) prevented further full collaborations; however, the band continued without him. The band even finished the video for \\&quot;End of the Line\\&quot;. In the scene where the verse is sung by Orbison, the viewer is shown Orbison\\&amp;#039;s guitar in a rocking chair followed by a photo of the late artist.\n\n\\&quot;Wilburys\\&quot; was a slang term coined by Harrison and Lynne during the recording of Cloud Nine as a reference to recorded \\&quot;flubs\\&quot; that could be eliminated during the mixing stage[1] (i.e. \\&quot;\\&amp;#039;We\\&amp;#039;ll bury\\&amp;#039; them in the mix\\&quot;). The term was used again when the entire group was together. Harrison suggested \\&quot;The Trembling Wilburys\\&quot; as the group\\&amp;#039;s name, but Lynne suggested using \\&quot;Traveling\\&quot; instead. Everyone agreed.","torrent":{"xt":"urn:btih:3ca18e3c850da34989aefadd32f244e748af7857","amp;dn":"The+traveling+wilburys+collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ca18e3c850da34989aefadd32f244e748af7857","infoHashBuffer":{"type":"Buffer","data":[60,161,142,60,133,13,163,73,137,174,250,221,50,242,68,231,72,175,120,87]},"announce":[],"urlList":[]}}