{"title":"Tesla - Love Song (2nafish)","uid":6065811,"size":144975876,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:40669ac53bbea084ce1e320045390f3cea2dcb6e&amp;dn=Tesla+-+Love+Song+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"2nafish","files":-1,"time":1293350743,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Love Song&quot; is a power ballad by the band Tesla, from the album The Great Radio Controversy, released in 1989. When the video was placed in heavy rotation on MTV, the song rocketed to number ten on the U.S. charts, becoming one of the group's biggest hits.\n\nThe music video was filmed in the band's home town of Sacramento at the former Cal Expo amphitheater. Old 93 Rock banners can be seen hanging in the back ground.\n\nThe single and video version removes the classical guitar intro, reducing the song length to about 4:09.\n\nThe Great Radio Controversy is the second album by American rock band Tesla, released in 1989. The songs combine 1980s metal with some blues-influenced elements, as well as the occasional love ballad. The record features many two-part counterpoints provided by guitarists Frank Hannon and Tommy Skeoch, on both electric and acoustic guitars.\n\nThe hit single &quot;Love Song&quot; received considerable MTV airplay and rocketed the band to stardom. Many tracks on this album later received acoustic versions on their follow-up album, Five Man Acoustical Jam, a precursor of the Unplugged trend.\n\nThe album is titled after the controversy about the identity of the inventor of radio. It is posed that Serbian engineer Nikola Tesla (whom the band is named after) is the true inventor of radio, while the Italian Guglielmo Marconi took the credit and is widely regarded as having the title. The album's inner sleeve recounts this story.\n\nTesla is an American hard rock band formed in Sacramento, California in 1984. They have sold 14 million albums in the United States.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:40669ac53bbea084ce1e320045390f3cea2dcb6e","amp;dn":"Tesla+-+Love+Song+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40669ac53bbea084ce1e320045390f3cea2dcb6e","infoHashBuffer":{"type":"Buffer","data":[64,102,154,197,59,190,160,132,206,30,50,0,69,57,15,60,234,45,203,110]},"announce":[],"urlList":[]}}