{"title":"The Freddie Mercury Tribute [Mp3 320 kbps DVD enc.] TNT Village","uid":6568590,"size":254280516,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:40dccd39a7cc24413d78e6f317e0794ed02fc0c4&amp;dn=The+Freddie+Mercury+Tribute+%5BMp3+320+kbps+DVD+enc.%5D+TNT+Village&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"l.diliberto","files":3,"time":1311847672,"description":"The Freddie Mercury Tribute [Mp3 320 kbps DVD enc.] TNT Village\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=66386&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=66386&lt;/a&gt;\n\nIl Freddie Mercury Tribute Concert ÃƒÂ¨ stato un concerto in ricordo di Freddie Mercury, mitico frontman dei Queen scomparso prematuramente il 24 novembre 1991, tenutosi il 20 aprile 1992, lunedÃƒÂ¬ di Pasquetta, al Wembley Stadium di Londra, trasmesso in televisione in tutto il mondo. I proventi ell'evento furono devoluti in beneficenza per dare vita all'associazione The Mercury Phoenix Trust.\n\nNel febbraio 1992 alla cerimonia annuale dei Brit Awards, Brian May e Roger Taylor, rispettivamente chitarrista e batterista della band, annunciarono il desiderio di organizzare un grande evento per rendere omaggio alla vita ed alla carriera di Freddie Mercury.\n\nIl giorno seguente vennero messi in vendita i biglietti per il concerto e tutti i 72.000 tagliandi andarono esauriti in sole due ore, nonostante ancora non fosse stato diffusa la minima informazione su chi avrebbe suonato oltre ai componenti restanti dei Queen.\n\nLo show fu l'ultimo concerto del bassista John Deacon con la band, fatta eccezione per un'apparizione live nel 1997 con May, Taylor ed Elton John al Bejar Ballete del pavaroyyi and friends nel 2001\n\nDopo una prima uscita in VHS, nell'aprile 2002 il concerto ÃƒÂ¨ stato distribuito in DVD, raggiungendo immediatamente la posizione numero 1 della classifica del Regno Unito. Il DVD ÃƒÂ¨ stato comunque molto criticato poichÃƒÂ© manca di tutta la prima parte dello spettacolo.\n\nGli artisti che si esibirono al concerto furono (seguiti dalle canzoni che eseguirono):\n\nMetallica - Enter Sandman, Sad But True, Nothing Else Matters\nExtreme - Queen Medley, Love Of My Life, More Than Words\nDef Leppard - Animal, Let's Get Rocked, Now I'm Here (con Brian May)\nBob Geldof -Too Late God\nSpinal Tap - The Majesty of Rock\nGuns N' Roses - Paradise City, Knockin' on Heaven's Door\nElizabeth Taylor - Discorso\nDurante la prima parte dello show vennero proiettati diversi filmati mentre i tecnici cambiavano il palco per l'esibizione dell'artista successivo. Innuendo non venne inclusa nel DVD su richiesta di Robert Plant, poichÃƒÂ© ritenne che, a causa delle cattive condizioni di salute, la sua performance fosse di basso livello. Inoltre, quando il concerto venne trasmesso su MTV, gli U2 dedicarono a Freddie una performance via satellite dalla California dal vivo di Until The End Of The World, anch'essa assente.Anche le esibizioni degli Extreme sono state omesse.\n\nMp3 320 Kbs, 44100 Mhz. Dvd audio encoding\n105 Minuti, Singola traccia\n\n.: Cover :.\n &lt;a href=&quot;\nhttp://img289.imageshack.us/img289/2896/freddietributecopiakj5.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img289.imageshack.us/img289/2896/freddietributecopiakj5.jpg&lt;/a&gt;\n\n.: TrackList :.\n\nQueen e Joe Elliott/Slash - Tie Your Mother Down\nQueen e Roger Daltrey (con Tony Iommi) - Heaven And Hell (intro), Pinball Wizard (intro), I Want It All\nQueen e Zucchero - Las Palabras de Amor\nQueen e Gary Cherone (con Tony Iommi) - Hammer To Fall\nQueen e James Hetfield (con Tony Iommi) - Stone Cold Crazy\nQueen e Robert Plant - Innuendo (con estratti da Kashmir), Thank You (intro), Crazy Little Thing Called Love\nQueen (Brian May con Spike Edney) - Too Much Love Will Kill You\nQueen e Paul Young - Radio Ga Ga\nQueen e Seal - Who Wants To Live Forever\nQueen e Lisa Stansfield - I Want To Break Free\nQueen e David Bowie/Annie Lennox - Under Pressure\nQueen e Ian Hunter/David Bowie/Mick Ronson/Joe Elliot/Phil Collen - All the Young Dudes\nQueen e David Bowie/Mick Ronson - Heroes/The Lord's Prayer\nQueen e George Michael - 39\nQueen e George Michael/Lisa Stansfield - These Are The Days Of Our Lives\nQueen e George Michael - Somebody to Love\nQueen e Elton John/Axl Rose - Bohemian Rhapsody\nQueen e Elton John (con Tony Iommi) - The Show Must Go On\nQueen e Axl Rose - We Will Rock You\nQueen e Liza Minnelli/Cast - We Are The Champions ","torrent":{"xt":"urn:btih:40dccd39a7cc24413d78e6f317e0794ed02fc0c4","amp;dn":"The+Freddie+Mercury+Tribute+%5BMp3+320+kbps+DVD+enc.%5D+TNT+Village","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40dccd39a7cc24413d78e6f317e0794ed02fc0c4","infoHashBuffer":{"type":"Buffer","data":[64,220,205,57,167,204,36,65,61,120,230,243,23,224,121,78,208,47,192,196]},"announce":[],"urlList":[]}}