{"title":"Superman - World of New Krypton","uid":5455507,"size":223450398,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:412e496ca71633a7b3a8606096e9021e322b2087&amp;dn=Superman+-+World+of+New+Krypton&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ParrowJack","files":-1,"time":1269307337,"description":"Superman: World of New Krypton is a twelve-issue limited series produced by DC Comics.  It is written by the team of James Robinson and Greg Rucka and illustrated by artist Pete Woods.\n\nWorld of New Krypton takes place after the Superman: New Krypton story-arc, in which approximately 100,000 Kryptonians and their city of Kandor are saved by Superman from the alien Brainiac and restored to existence. After spending time on Earth, the Kryptonians raise the city into space where they form the planet New Krypton in Earth's solar system.\n\nIn the build-up to this series, Superman apparently agrees to a deal with his aunt Alura  that he renounce his allegiance to Earth and severs ties there in order to live on New Krypton with his people.   He does not truthfully renounce all ties to his adopted home, as he tells his wife Lois Lane.  He instructs his friend Mon-El to &quot;take over for him,&quot; and has conversations with the Guardian and Jimmy Olsen before disembarking for New Krypton.   Superman intends to live amongst the Kryptonians in the hopes of easing tensions with Earth and teaching them to use their powers responsibly.  But how will he fit into Kryptonian society when he has been brought up on Earth?\n\n\nTracked by http://comicpirates.info\n","torrent":{"xt":"urn:btih:412e496ca71633a7b3a8606096e9021e322b2087","amp;dn":"Superman+-+World+of+New+Krypton","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"412e496ca71633a7b3a8606096e9021e322b2087","infoHashBuffer":{"type":"Buffer","data":[65,46,73,108,167,22,51,167,179,168,96,96,150,233,2,30,50,43,32,135]},"announce":[],"urlList":[]}}