{"title":"Kiss the Sky (2014) Krista Ritchie (multi)","uid":9549203,"size":1749873,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:41fde48b0e359f722629e34908ddb1e615127c4d&amp;dn=Kiss+the+Sky+%282014%29+Krista+Ritchie+%28multi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"7","files":-1,"time":1391203963,"description":"\nKiss the Sky by Krista Ritchie\n\n\nFormat: mobi/epub/azw3\nLength: 407 pages\nGenre: New Adult Romance\nDate: 24 January 2014\n\nThis New Adult Standalone Romance can be described as Friends meets The Real World. Expect fist fights, drugs, sex of varying degrees, crude humor and competitive alpha males. Definitely for mature audiences only.\n\nVirgin. Sex addict. Daredevil. Alcoholic. Smartass...Jackass. Her five friends are about to be filmed. Reality TV, be prepared.\n\nRose Calloway thought she had everything under control. At twenty-three, she's a Princeton graduate, an Academic Bowl champion, a fashion designer and the daughter of a Fortune 500 mogul. But with a sex addict as a sister and roommate, nothing comes easy.\n\nAfter accepting help from a producer, Rose agrees to have her life filmed for a reality television show. The Hollywood exec is her last chance to revive her struggling fashion line, and boundaries begin to blur as she's forced to make nice with a man who always has his way.\n\nTwenty-four-year-old Connor Cobalt is a guy who bulldozes weak men. He's confident, smart-as-hell and lives with his equally ambitious girlfriend, Rose Calloway. Connor has to find a way to protect Rose without ruining the show. Or else the producer will get what Connor has always wanted?Rose's virginity.\n\nAuthor:\n\nKrista Ritchie has a clone...or someone who looks exactly like her. If she's not writing books with her twin sister, she's pouring over entertainment news and ingesting copious amounts of pop culture. She likes tennis, that thing called the TV, and beating Becca (her clone) on Sega Genesis.","torrent":{"xt":"urn:btih:41fde48b0e359f722629e34908ddb1e615127c4d","amp;dn":"Kiss+the+Sky+%282014%29+Krista+Ritchie+%28multi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41fde48b0e359f722629e34908ddb1e615127c4d","infoHashBuffer":{"type":"Buffer","data":[65,253,228,139,14,53,159,114,38,41,227,73,8,221,177,230,21,18,124,77]},"announce":[],"urlList":[]}}