{"title":"Quartz - Live Quartz [1980] UK HARD ROCK / NWOBHM","uid":4300943,"size":57658145,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:42a252259c2101bc88e57f29d19c6934c216a103&amp;dn=Quartz+-+Live+Quartz+%5B1980%5D+UK+HARD+ROCK+%2F+NWOBHM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sweetthing","files":7,"time":1216311645,"description":"Quartz - Live Quartz [1980]\n\n1  Street Fighting Lady\n2  Good Times\n3  Mainline Riders\n4  Belinda\n5  Count Dracula\n6  Around &amp; Around\n7  Roll Over Beethoven\n\nRecorded Live at Digbeth Civic Hall, Birmingham, UK [1st December 1979]\n\n\nMike Taylor - vocals \nMike Hopkins - guitar \nGeoff Nicholls - guitar/keyboard \nDerek Arnold - bass \nMalcolm Cope - drums \n\n\nINFO ON QUARTZ\n\n\nQuartz formed in 1976 with the original line up of Derek Arnold (Bass), Malcolm Cope (Drums), Geoff Nicholls (Keyboards/Guitar), Mike Taylor (vocals) and Mike Hopkins (Guitar). Geoff left to join Sabbath on keyboards and is now working with Tony Martin. Mick Taylor is living the more sedate lifestyle in Dorset occasionally returning and doing gigs. \n\nThe band released several albums, but the most successful of these albums was \\&quot;Quartz\\&quot; produced by Tony Iommi (of Black Sabbath fame) in 1976. Other albums include \\&quot;Stand Up And Fight\\&quot; (Derek Lawrence Producer), \\&quot;Quartz Live\\&quot;, \\&quot;Against All Odds\\&quot;, \\&quot;Anthology\\&quot; and \\&quot;Resurrection\\&quot;. \n\nThe band toured with Black Sabbath, Ian Gillan, Rush, Def Leppard, AC/DC, Saxon and many other successful bands and artists of that era. \n\nQuartz also appeared at the Reading festival with Elton John, Slade and the Doobie Brothers, and have also made various TV appearances. \n\n\nWIKIPEDIA INFO\n\nQuartz dates back to as early as 1974 when they were known as Bandy Legs. They signed to Jet Records in 1976 and supported Black Sabbath and AC/DC. The band changed their name to Quartz for their 1977 debut album, Quartz. The album was produced by Tony Iommi and Quartz toured with Black Sabbath to support this release. Queen guitarist Brian May handled guitar on \\&quot;Circles,\\&quot; which also features Ozzy Osbourne on backing vocals. This track did not appear on the album but would turn up as the b-side to the \\&quot;Stoking the Fires of Hell\\&quot; single.\n\nQuartz toured heavily during this time, playing the Reading Festival thrice (1976, 1977 and 1980) and touring in support of some of the larger NWOBHM and Hard Rock bands of the time (Iron Maiden, Saxon, UFO and Rush).\n\nQuartz released their second studio album, Stand Up and Fight, in 1980 and their third, Against All Odds, in 1983 before calling it quits. In 1979 Geoff Nicholls left to join Black Sabbath. He contributed keyboards and songwriting from 1980s Heaven and Hell on.\n\nIn 2004, doom metal band, Orodruin covered \\&quot;Stand Up and Fight\\&quot; on their album \\&quot;Claw Tower\\&quot;.\n\n","torrent":{"xt":"urn:btih:42a252259c2101bc88e57f29d19c6934c216a103","amp;dn":"Quartz+-+Live+Quartz+%5B1980%5D+UK+HARD+ROCK+%2F+NWOBHM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42a252259c2101bc88e57f29d19c6934c216a103","infoHashBuffer":{"type":"Buffer","data":[66,162,82,37,156,33,1,188,136,229,127,41,209,156,105,52,194,22,161,3]},"announce":[],"urlList":[]}}