{"title":"Joan of Arc - Testimonium Songs (2013) [FLAC]","uid":8914324,"size":199352902,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:42cefc9aa009934475797d1150deddadbdcb1ed3&amp;dn=Joan+of+Arc+-+Testimonium+Songs+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"politux","files":-1,"time":1379101893,"description":"\n  Joan of Arc - Testimonium Songs (2013) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Experimental, Indie Rock, Post-Rock, Emo\n  Source: WEB\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 \n\n  01 Amelia \n  02 I'd Expect Babies Should Fly, If Not at Least Float Away\n  03 Mosaic of Bolts\t\n  04 Stephen's Song\n  05 The Bird's Nest Wrapped Around the Security Camera\n  06 Jury Duty\n\n  Chicago avant rock act Joan of Arc has seen many permutations under the guidance of bandleader Tim Kinsella, from acoustic-leaning post-emo poetics to strange concept albums. Testimonium Songs definitely falls into the more conceptual field of Joan of Arc's discography, with the six movements here written for a live performance to accompany experimental theater group Every House Has a Door in an interpretation of poet Charles Reznikoff's Testimony, a work that collaged courtroom transcripts of cases of workplace negligence between 1885 and 1915. A concept this involved might be too arty or pretentious in the hands of a different band, but Kinsella has never shied away from the obtuse or the complicated, and Testimonium Songs takes Joan of Arc's trademarks of melodic repetition and surreal lyricism and intertwines them with more involved compositional arrangements than anything heard by the band before. \n\n  A power trio of Kinsella on guitar and vocals, bassist Bobby Burg, and drummer Theo Katsaounis is joined by some of the bigger names in the Chicago avant-garde scene, including David Grubbs, Fred Lonberg-Holm, and vocalist Melina Ausikaitis. The set begins with the acoustic and home-recorded-sounding &quot;Amelia,&quot; a nightmarish tale of a young sweatshop worker whose hair gets pulled into a stitching machine. Kinsella tells this horrific story in graphic detail, and it's the album's pop-friendliest moment. Gears shift frequently over the rest of the album, from the dark rock of &quot;Mosaic of Bolts&quot; to the minute-long weirdo would-be jazz of &quot;Stephen's Song&quot; moving into the brilliantly choreographed composition of album centerpiece &quot;The Bird's Nest Wrapped Around the Security Camera.&quot; The undertones of darkness and physical pain of the lyrical subjects crystallize on &quot;Bird's Nest,&quot; with various fragmented sections of the 13-plus-minute piece moving from spacious drumming to repetitive waves of group playing, breaking into a crescendo of outraged melody and muttering electronics near the end. Perhaps the most tightly performed Joan of Arc material, Testimonium Songs feels less like a proper album and more like a sidebar, deeply aligned with the harsh tones of Reznikoff's bleak poems. It's a bold move, even from a band whose oeuvre is made up of bold moves, and it's another fascinating chapter in the group's twisting saga.","torrent":{"xt":"urn:btih:42cefc9aa009934475797d1150deddadbdcb1ed3","amp;dn":"Joan+of+Arc+-+Testimonium+Songs+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42cefc9aa009934475797d1150deddadbdcb1ed3","infoHashBuffer":{"type":"Buffer","data":[66,206,252,154,160,9,147,68,117,121,125,17,80,222,221,173,189,203,30,211]},"announce":[],"urlList":[]}}