{"title":"2020: Our Common Destiny - Communitarianism","uid":5353104,"size":69660533,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:437f1467e725ca9950f8a357037ccf7f4b668396&amp;dn=2020%3A+Our+Common+Destiny+-+Communitarianism&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bluecarvw","files":2,"time":1265844743,"description":"Niki Raapana - 2020: Our Common Destiny\n\nThere is an old social theory that in order to create a healthier planet, people everywhere must learn the value of collectivism. Its many proponents insist that individual rights and liberties pose a real threat to the health and safety of the &quot;community at large. If we will just put the community before self-centered concerns, mankind can eliminate war and poverty. To many, it is our evolutionary destiny and our moral duty to comply with the spirit of community.\n\nThe founders of the Communitarian Network began &quot;shoring up the moral, social and political environment&quot; in the early 1990s. Today the communitarian theory is the basis for hundreds of new global rules and regulations eliminating individual rights, yet fewer than one percent of the affected population knows about it.\n\nCommunitarianism was embraced by leaders in every nation after it was financed by the international banking elite. Today the theory of community influences all aspects of life: news, science, money, law, land use, health, education, policing and employment, not to mention the arts, fashion, fundraising, causes and entertainment. Community is the buzzword on everybody's lips these days.\n\nSkeptics claim that an enormous system of control is impossible. Government officials regulary deny that there are plans for national integration at the regional global levels. But community government is real, and as the year 2020 approaches, world domination looks less like an episode of Pinky and the Brain all the time.\n\nEvidence of a supranational government is so abundant that it would take years to study everything about it. &quot;2020: Our Common Destiny&quot; is the true story of how two American women followed a paper trail from their lowly Seattle neighborhood to the United Nations. Lies and twisted ideology could not hide what they were destined to uncover: our common destiny, a hellish vision of mandatory communitarian utopia. &lt;a href=&quot;\nhttp://nord.twu.net/acl/books.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://nord.twu.net/acl/books.html&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.conspiracyresearch.org/forums/Niki-Raapana-2020-Our-Common-Destiny-t46121.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.conspiracyresearch.org/forums/Niki-Raapana-2020-Our-Common-Destiny-t46121.html&lt;/a&gt;\n","torrent":{"xt":"urn:btih:437f1467e725ca9950f8a357037ccf7f4b668396","amp;dn":"2020%3A+Our+Common+Destiny+-+Communitarianism","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"437f1467e725ca9950f8a357037ccf7f4b668396","infoHashBuffer":{"type":"Buffer","data":[67,127,20,103,231,37,202,153,80,248,163,87,3,124,207,127,75,102,131,150]},"announce":[],"urlList":[]}}