{"title":"IMPACT COMICS (DC imprint) (1991-1993) Complete REQUESTED","uid":8237715,"size":1484405950,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:440691a476a5dcef67cf9d7d53470041c14d3024&amp;dn=IMPACT+COMICS+%28DC+imprint%29+%281991-1993%29+Complete+REQUESTED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"STFmaryville","files":-1,"time":1362882381,"description":"From Wikipedia:\n\nImpact Comics was an imprint of DC Comics that was aimed at younger audiences. It was begun in 1991 and ended by 1993. (The initial &quot;I&quot; in the logo looked like an exclamation point.)\n\nIts titles featured the adventures of altered versions of superheroes licensed from Archie Comics including the Fly, the Comet, the Shield, the Jaguar, the Web, and the Black Hood. Changes included making the new Jaguar a woman and making the Web an organization instead of a solo hero. This was a second attempt to revive the old Archie heroes, the other one being the Red Circle line of comics in the early 1980s.\n\nIn an effort to reach out to kids who were not aware of the direct market system, DC Comics attempted to sell Impact Comics titles through newsstands, however that never happened. The imprint eventually collapsed due to poor sales. A final series The Crucible was initially intended to relaunch the line, but instead served as its finale.\n\n------\n\nThis fills a request for Mothra67. Enjoy and please seed and share with our friends here on TPB.\n\nI think I've compiled every Impact comic ever, and it's all thanks to joshua13 and his MTCDC project.\n\nI would actually dispute that they didn't distribute for the first 4 to 6 months at newsstands, as I remember fairly clearly that I bought some of these on grocery store spinner racks 20 years ago. Later, like many low-selling DC titles, they went direct-sales only.\n\nThere are some amazing creators working on these books, especially in the 1991 issues. It was all headed up by Mike Gold, Mark Waid, Len Strazewski, and Jim Owsley (a.k.a. Christopher Priest). Later, Crusaders launched with covers by Dan Jurgens, and Crucible with covers by Joe Quesada.\n\nAll in all, this was probably my favorite major imprint when I was a kid. It's more cohesive than Epic or Vertigo, better than the New Universe, way better than early Image (which began as a Malibu imprint), and more fun than the Ultimate Universe. --STFmaryville","torrent":{"xt":"urn:btih:440691a476a5dcef67cf9d7d53470041c14d3024","amp;dn":"IMPACT+COMICS+%28DC+imprint%29+%281991-1993%29+Complete+REQUESTED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"440691a476a5dcef67cf9d7d53470041c14d3024","infoHashBuffer":{"type":"Buffer","data":[68,6,145,164,118,165,220,239,103,207,157,125,83,71,0,65,193,77,48,36]},"announce":[],"urlList":[]}}