{"title":"Pat Metheny - What's It All About (FLAC)","uid":6479245,"size":255034521,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:442b7cc2029832099ce19f30254969203273efc5&amp;dn=Pat+Metheny+-+What%5C%27s+It+All+About+%28FLAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tiddler22","files":14,"time":1308432701,"description":"\n\nReview by Thom Jurek (AMG):\nThe jazz tradition has long taken pop songs, reimagined and reinvented them harmonically and rhythmically and re-presented them as vehicles for improvisation. Pat Metheny has done something different on What's It All About, his second Nashville-tuned baritone acoustic guitar record (with a handful of other acoustic instruments and no overdubs, but there are edits). Here he performs ten pop songs that have long been part of his personal arcana and recorded them so that we might hear what's inside these songs -- as songs. Recorded on a single day in February of 2011, Metheny interprets well-known songs by Paul Simon, Antonio Carlos Jobim, Lennon &amp; McCartney, Henry Mancini, the Ventures, Burt Bacharach, Paul Williams, Terry Kirkman, Carly Simon, Thom Bell, and others across the pop spectrum. His approach is deliberate; his interest here is in the subtlety of melody; its nuance, suggestion, and mystery; he finds the places he hears inside the music before these songs even begin, or just after they end, through a unique series of tunings he employs between A-flat and C. &quot;The Sound of Silence&quot; opens the set by suggesting the tones of a Japanese koto in its intro (courtesy of his 42-string Pikasso guitar). When the melody commences, its languorous richness and rhythmic balance are so perfect, we hear it not only as the pop song we remember by Simon &amp; Garfunkel, but as a lyric invention that is almost magical in its possibility. The version of Kirkman's &quot;Cherish&quot; (a big hit by the Association), is equally profound. He finds the space where the human voice inserts itself in the harmonic structure and opens it with his guitar. There is slightly more improvisation in &quot;Alfie,&quot; but it's open, spacious, and full of hinted-at dimensions in the crafting of the song's parameters. &quot;Girl from Ipanema,&quot; played as discovers suggestions of other -- darker and moodier -- melodies inside it. He pulls out both the implied elegance in &quot;That's the Way I've Always Heard It Should Be,&quot; and the quietly majestic variety of it in &quot;Rainy Days and Mondays.&quot; &quot;Betcha by Golly, Wow&quot; stands as a revelation: its truly inventive harmonies and jazz syncopations are -- and one suspects they always have been -- inherent in the tune's basic architecture. In closer &quot;And I Love Her&quot; are the direct implications of bossa that Lennon and McCartney had no doubt taken note of at the time. Ultimately, What's It All About is an intimate work revealing Metheny's investigation of composition itself. The notion of song is inherent in everything he does, and he reveals that inspiration in spades here. \n\n\n01. The Sound Of Silence\n02. Cherish  \n03. Alfie  \n04. Pipeline  \n05. Garota de Ipanema \n06. Rainy Days And Mondays \n07. Thats The Way Ive Always Heard It Should Be  \n08. Slow Hot Wind \n09. Betcha By Golly, Wow\n10. And I Love Her\n\n  ","torrent":{"xt":"urn:btih:442b7cc2029832099ce19f30254969203273efc5","amp;dn":"Pat+Metheny+-+What%5C%27s+It+All+About+%28FLAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"442b7cc2029832099ce19f30254969203273efc5","infoHashBuffer":{"type":"Buffer","data":[68,43,124,194,2,152,50,9,156,225,159,48,37,73,105,32,50,115,239,197]},"announce":[],"urlList":[]}}