{"title":"MajorMinor","uid":12943248,"size":981419441,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4592516ca0a125a5c5c9a7fcb88788e4571e1add&amp;dn=Major%5CMinor&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dauphong","files":1,"time":1449649238,"description":"A wave of murder and suicide has been hitting the country, but all of the cases share the same aspect; they happen exactly at the stroke of midnight. You play as one of the &quot;Lucky Two&quot;, winners of a contest that give you the opportunity to travel the world with the international pop idol, Klace. But arriving in Japan just as this wave of incidents gets out of control, you quickly get caught up in a larger scheme. The launch of his worldwide tour promptly becoming the least of your concerns.\r\n\r\nYou and your team must uncover the mystery behind The Midnight Deaths, and in doing so -- you will uncover shocking truths. Balance your social life, relationships and friendships during the day -- because at night you will be whisked away to an unfamiliar and hostile world. But with this second world being the key to saving Earth, you can't help but delve deeper into dangerous territory.\r\n\r\nWith multiple characters, the ability to go on dates, and socialize with a large cast of characters -- every choice you make has an impact. A simple choice could lead to the salvation or destruction of both worlds; and all of those around you. Choose wisely, and enjoy your journey","torrent":{"xt":"urn:btih:4592516ca0a125a5c5c9a7fcb88788e4571e1add","amp;dn":"Major%5CMinor","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4592516ca0a125a5c5c9a7fcb88788e4571e1add","infoHashBuffer":{"type":"Buffer","data":[69,146,81,108,160,161,37,165,197,201,167,252,184,135,136,228,87,30,26,221]},"announce":[],"urlList":[]}}