{"title":"Ciara feat. Petey Pablo - Goodies","uid":4626065,"size":141250564,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:4617e40edac6890fc72e82f82c33afc4105dfcf5&amp;dn=Ciara+feat.+Petey+Pablo+-+Goodies&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1231216709,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Goodies&quot; is a pop song recorded by American R&amp;B singer Ciara and rapper Petey Pablo for Ciara's debut album Goodies (2004) and written by Ciara, Sean Garrett, LaMarquis Jefferson, Craig Love and Jonathan Smith. &quot;Goodies&quot; is a combination of crunk and R&amp;B. The song's lyrics are about female empowerment and virginity. The protagonist does not want to an object, while performing over a complex beat. The song's protagonist rejects a male's sexual advances, proclaiming that he will never get her &quot;goodies&quot; because &quot;they stay in the jar&quot;.\n\n&quot;Goodies&quot; was released as the album's lead single in third and fourth quarters of 2004, and first quarter of 2005. As the album's opening track, the song made a successful debut single, becoming Ciara's first number one single on the Billboard Hot 100, and stayed number one for seven consecutive weeks. The song charted well on international markets. It was certified gold in the United States.\n\nThe music video for &quot;Goodies&quot; was directed by Benny Boom. It shows Ciara and her friends driving in a Oldsmobile 442 convertible along the Atlanta, Georgia streets to the local car wash. It features cameo appearances by BoneCrusher, Monica, Rasheeda, Jazze Pha, Young Jeezy, Lil Jon and among others. Ciara filmed the video for 27 straight hours with director Benny Boom.\n\nShe gave her first performance ever of &quot;Goodies&quot; on BET's 106 &amp; Park.\n\nThe music video beigns with Ciara leaving her house, and her friend screams out; &quot;What Up Dawg&quot;, with Ciara replying the same way. Then Ciara's sister, runs outside saying that Jazze Pha is on the phone. Jazze tells Ciara that they are going to the carwash to hang out and Ciara says she will also be coming along. She then gives the phone back to her sister and tells her to stay out of her room. The song then begins with Ciara singing her intro and Petey Pablo, rapping his verse. During this intro, we see Ciara going along with her friends driving to the carwash. On her way there she meets a few young men and invites them also to the carwash. She then arrives to the carwash and meets up with different people, including Monica During the song, Ciara is in front of a blue and white back ground with Jazze Pha at the end, and with her backup dancers at the in the beginning, during, and at the end of the song.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:4617e40edac6890fc72e82f82c33afc4105dfcf5","amp;dn":"Ciara+feat.+Petey+Pablo+-+Goodies","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4617e40edac6890fc72e82f82c33afc4105dfcf5","infoHashBuffer":{"type":"Buffer","data":[70,23,228,14,218,198,137,15,199,46,130,248,44,51,175,196,16,93,252,245]},"announce":[],"urlList":[]}}