{"title":"Black Eyed Peas Discography","uid":5746319,"size":1793682181,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4716f5bcdf974443a612178aeb13cdfda97d2988&amp;dn=Black+Eyed+Peas+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ddawg","files":-1,"time":1281235426,"description":"Black Eyed Peas Discography\nGenre: Hip-Hop\nFormat: flac\n\n\n[1998] Behind the Front (Missing Requested)\n[2000] Bridging the Gap (Missing Requested)\n[2003] Elephunk\n[2005] Monkey Business\n[2009] E.N.D. (Energy Never Dies)\n\n\nFormed 1995 in Los Angeles, California\n\nAllmusic Biography:\nPositive messages and breakdancing are integral parts of hip-hop culture, but by 1990 those elements had been temporarily eclipsed by the tough gangsta image and bleak but compelling lyrics of West Coast groups like N.W.A. However, despite sharing a zip code, Black Eyed Peas' vision goes beyond the cracked-sidewalk vignettes and sampled gunfire of Los Angeles' gangsta style. The socially conscious group's earliest connections go back to high school, when will.i.am and apl.de.ap were part of Tribal Nation, a breakdancing crew. Eventually the pair focused more on music -- hip-hop, specifically -- and split off into their own as Atban Klann, their esoteric name an acronym for A Tribe Beyond a Nation. Eazy-E's Ruthless Records signed the group in 1992, but many in the Ruthless camp were puzzled by the group and the enthusiasm of Eazy, who had no problem reconciling his own gangsta style with the peace-minded breakdancing of Atban. Although an album was recorded, Ruthless shelved it, unsure how to market a group whose style wasn't dependent on violent braggadocio like N.W.A.\n\nThe death of Eazy-E in 1995 signaled the end of any further deals with Ruthless. Undaunted by the experience, will and apl recruited another dancer/MC, Taboo, and reappeared as Black Eyed Peas. BEP began playing shows around L.A., impressing hip-hop fans with their mike skills and dazzling them with their footwork as well. In 1998 their debut, Behind the Front, was released to critical acclaim -- not only for the trio of MCs, but for their live band and backing vocalist Kim Hill as well. Featuring guest appearances from Jurassic 5's Chali 2na, De La Soul, and Macy Gray, BEP's sophomore effort, Bridging the Gap, was released in 2000. The group's third album, 2003's Elephunk, featured a new member (Fergie, who replaced Kim Hill) and became their biggest hit yet, storming the Top 40 with three singles (&quot;Where Is the Love?,&quot; &quot;Hey Mama,&quot; &quot;Let's Get It Started&quot;). Two years later, the quartet returned with a heavily crossover date, Monkey Business, which pushed them into the stratosphere courtesy of the hit singles &quot;Don't Phunk with My Heart&quot; and &quot;My Humps.&quot; Fergie released a solo album, Dutchess, in 2006. It was executive produced by will.i.am who released his own solo album, Songs About Girls, in 2007. Two years later, the hit single &quot;Boom Boom Pow&quot; announced the group's return for The E.N.D. (Energy Never Dies). \n \n","torrent":{"xt":"urn:btih:4716f5bcdf974443a612178aeb13cdfda97d2988","amp;dn":"Black+Eyed+Peas+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4716f5bcdf974443a612178aeb13cdfda97d2988","infoHashBuffer":{"type":"Buffer","data":[71,22,245,188,223,151,68,67,166,18,23,138,235,19,205,253,169,125,41,136]},"announce":[],"urlList":[]}}