{"title":"WCW BASH AT THE BEACH 95 MED HOA HOA O BRUNO O FRANK ANDERSON","uid":8014483,"size":1523262916,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:476d57b9e977a3696fe5ddfb148f7cba9d0ff850&amp;dn=WCW+BASH+AT+THE+BEACH+95+MED+HOA+HOA+O+BRUNO+O+FRANK+ANDERSON&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nesperi","files":1,"time":1358078160,"description":"WCW BASH AT THE BEACH 950810 TV1000 Med Hoa Hoa och Bruno och Frank Andersson\n\nMain Event match: Road Warrior Hawk vs  Mark Star\n\nMain Event match: Dick Slater and Bunkhouse Buck vs  Marcus Bagwell and Alex Wrigh. The winners of the match would get a shot at the WCW World Tag Team Championship on WCW Saturday Night.\n\nSting vs  Meng to retain the WCW United States Heavyweight Championship.\n\nThe Renegade vs  Paul Orndorff to retain the WCW World Television Championship.\n\nKamala vs  Jim Duggan.\n\nDiamond Dallas Page vs Dave Sullivan(with the Diamond Doll and Max Muscle)\n\nHarlem Heat (Booker T and Stevie Ray) and The Nasty Boys (Brian Knobs and Jerry Sags) and The Blue Bloods (Lord Steven Regal and Earl Robert Eaton) in a Triangle match to retain the WCW World Tag Team Championship.\n\nRandy Savage vs Ric Flair in a Lifeguard match.\nThe match was fought under Lumberjack rules but billed as a &quot;Lifeguard match&quot; due to taking place on the beach. \nThe &quot;Lifeguards&quot; who surrounded the ring were: Arn Anderson, Booker T, Brian Knobs, Bunkhouse Buck, Chris Kanyon, Dave Sullivan, Diamond Dallas Page, Dick Slater, Jim Duggan, Jerry Sags, Johnny B. Badd, Mark Starr, Max Muscle and Stevie Ray.\n\nHulk Hogan vs Vader in a Steel cage match to retain the WCW World Heavyweight Championship\n\nVHS-RIP \n950810 TV1000 \nSVENSKT OCH ENKELSKT TAL\n\nHOPPAS NI TYCKER OM DEN HÃ„R KOMMER FÃ–RSÃ–KA LÃ„GGA UT NÃ…GRA TILL I Ã…R DET BEROR PÃ… OM JAG HITTAR DEM PÃ… DEM GAMMLA BANDEN JAG HAR.\n\nVAR SNÃ„LL OCH SEEDA EFTER ER SÃ… FLER KAN LADDA NER.","torrent":{"xt":"urn:btih:476d57b9e977a3696fe5ddfb148f7cba9d0ff850","amp;dn":"WCW+BASH+AT+THE+BEACH+95+MED+HOA+HOA+O+BRUNO+O+FRANK+ANDERSON","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"476d57b9e977a3696fe5ddfb148f7cba9d0ff850","infoHashBuffer":{"type":"Buffer","data":[71,109,87,185,233,119,163,105,111,229,221,251,20,143,124,186,157,15,248,80]},"announce":[],"urlList":[]}}