{"title":"The Making of the Modern Refugee - Peter Gatrell","uid":12833932,"size":2012150,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:496d05adc877c3488c75d289fc91d3f41a5577d0&amp;dn=The+Making+of+the+Modern+Refugee+-+Peter+Gatrell&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1448418081,"description":"The Making of the Modern Refugee - Peter Gatrell (Oxford University Press, 2013).pdf\r\n\r\nThe Making of the Modern Refugee is a comprehensive history of global population displacement in the twentieth century. It takes a new approach to the subject, exploring its causes, consequences, and meanings. History, the author shows, provides important clues to understanding how the idea of refugees as a 'problem' embedded itself in the minds of policy-makers and the public, and poses a series of fundamental questions about the nature of enforced migration and how it has shaped society throughout the twentieth century across a broad geographical area - from Europe and the Middle East to South Asia, South-East Asia, and sub-Saharan Africa. Wars, revolutions, and state formation are invoked as the main causal explanations of displacement, and are considered alongside the emergence of a twentieth-century refugee regime linking governmental practices, professional expertise, and humanitarian relief efforts.\r\n\r\nThis new study rests upon scholarship from several disciplines and draws extensively upon oral testimony, eye-witness accounts, and film, as well as unpublished source material in the archives of governments, international organisations, and non-governmental organisations. The Making of the Modern Refugee explores the significance that refugees attached to the places they left behind, to their journeys, and to their destinations - in short, how refugees helped to interpret and fashion their own history","torrent":{"xt":"urn:btih:496d05adc877c3488c75d289fc91d3f41a5577d0","amp;dn":"The+Making+of+the+Modern+Refugee+-+Peter+Gatrell","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"496d05adc877c3488c75d289fc91d3f41a5577d0","infoHashBuffer":{"type":"Buffer","data":[73,109,5,173,200,119,195,72,140,117,210,137,252,145,211,244,26,85,119,208]},"announce":[],"urlList":[]}}