{"title":"Signs of Life v0.23","uid":9566100,"size":270026670,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:497458668face4cc80bed227c9e1fb107d2e1aac&amp;dn=Signs+of+Life+v0.23&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Betelo","files":1,"time":1391474198,"description":"About the Game \n\nSigns of Life is a sci-fi survival sandbox platformer with a combination of procedurally generated and hand-crafted content. You'll explore mysterious locations, Mine blocks for resources, and meet strange (and some familiar) creatures, some of which don't even want to kill you and eat your corpse. Along the way, you'll be able to craft armor, weapons, gadgets and more to assist you in surviving in an inhospitable environment. \n\nChange Log:\n\nVersion 0.18\n- Capped the width/power of the laser pistol\n- You can now swing melee weapons through platforms\n- Project window amount font switched to the small font\n- Throwable objects rotate while thrown now\n- More craftable tiles (Mud Brick, Brick, some additional steel/wood/stone/brick tiles)\n- Changed brick crafting, bricks are now a material\n- Added a better crash logger\n- Fixed a crash\n- Throwable bricks (http://www.playsignsoflife.com/images/brickThrow.gif)\n\nVersion 0.19\n- Possible fix for some items not getting saved (smelters, containers) or getting lost\n- Some fixes for the crash logger\n\nVersion 0.20\n- Fixed a bug with trying to equip certain items that shouldn't be equippable\n- Brick oven now requires bricks instead of brick slabs to craft\n- More fixes for the crash logger\n\nVersion 0.21\n- Fixed a crash with the power socket gump\n- Possible fix for crashes related to foreign languages and the chat window\n- Possible fix for crashes related to landing the pod during generation/load\n- Possible fix for crash related to moving the crafting window off screen\n\nVersion 0.22\n- Fixed another crash related to foreign languages and the chat/console window\n- Pod no longer generates on worlds after you've destroyed it\n- Tweaked mobs to make them spawn in less annoying places (Shouldn't spawn in the pod or on inorganic materials)\n- Fixed some issues with respawning, mostly aesthetic\n- Added item drop on death toggle, press &quot;t&quot; to open the console, then type /toggledropitems\n\nVersion 0.23\n- Maybe fixed a bug that would rarely cause items to disappear near growing trees","torrent":{"xt":"urn:btih:497458668face4cc80bed227c9e1fb107d2e1aac","amp;dn":"Signs+of+Life+v0.23","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"497458668face4cc80bed227c9e1fb107d2e1aac","infoHashBuffer":{"type":"Buffer","data":[73,116,88,102,143,172,228,204,128,190,210,39,201,225,251,16,125,46,26,172]},"announce":[],"urlList":[]}}