{"title":"Westbrook - America's Oldest Secret - The Talisman of the Unite","uid":3494288,"size":5392542,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:49c9dc86a086decdb9948476c89975bc09c86e23&amp;dn=Westbrook+-+America%5C%27s+Oldest+Secret+-+The+Talisman+of+the+Unite&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1149938858,"description":"This is Charles L. Westbrook&amp;#039;s rare and explosive book with the full title America&amp;#039;s Oldest Secret - The Talisman of the United States - The Mysterious Street Lines of Washington DC - Signature of the Invisible Brotherhood (1990) which exposes in detail how a secret society planned and build the whole city of Washington DC according to their philosophy which originates thousands of years in the past. Westbrook&amp;#039;s pioneer research into the esoteric meaning behind the map of Washington DC and other cities reveals an astonishing secret known only to a select few while remaining completely unknown to most of Americans. Are the dizzy road patterns which make up the map of Washington DC really a coincidence of ignorant city planners or is there an occult meaning behind it all? As the author clearly proves, Washington DC and many other cities across the globe have been accurately planned according to the occult philosophy of a secret society known as Freemasons. This fascinating book sheds light on the role of symbols in art and architecture in seeding, nurturing, and guiding a new social organism. What do Washington, Rome and Jerusalem have in common? The answer is: the same brotherhood which layed plans for all these cities and more. Find out who is really behind the founding of America and how they cleverly layed out their signs which only an initiated few can fully understand. But not so anymore. 130 pages, many pictures. A must read for everyone.\n\nMore info: &lt;a href=&quot;\nhttp://freemasonry.bcy.ca/anti-masonry/washington_dc/washington_dc.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://freemasonry.bcy.ca/anti-masonry/washington_dc/washington_dc.html&lt;/a&gt;\n","torrent":{"xt":"urn:btih:49c9dc86a086decdb9948476c89975bc09c86e23","amp;dn":"Westbrook+-+America%5C%27s+Oldest+Secret+-+The+Talisman+of+the+Unite","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49c9dc86a086decdb9948476c89975bc09c86e23","infoHashBuffer":{"type":"Buffer","data":[73,201,220,134,160,134,222,205,185,148,132,118,200,153,117,188,9,200,110,35]},"announce":[],"urlList":[]}}