{"title":"Millions Saved by Amanda Glassman Miriam Temin KS49 epub mobi","uid":15227281,"size":9564017,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4a1b4d52ca4a0076fdb6a75d9ce786bffdc41eb7&amp;dn=Millions+Saved+by+Amanda+Glassman+Miriam+Temin+KS49+epub+mobi&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"KiwiSue49","files":3,"time":1467779118,"description":"TITLE:\r\n\r\nMillions Saved: New Cases of Proven Success in Global Health by Amanda Glassman and Miriam Temin\r\n\r\n\r\nDESCRIPTION:\r\n\r\nOver the past fifteen years, people in low- and middle-income countries have experienced a health revolution—one that has created new opportunities and brought new challenges. It is a revolution that keeps mothers and babies alive, helps children grow, and enables adults to thrive.\r\n\r\nMillions Saved: New Cases of Proven Success in Global Health chronicles the global health revolution from the ground up, showcasing twenty-two local, national, and regional health programs that have been part of this global change. The book profiles eighteen remarkable cases in which large-scale efforts to improve health in low- and middle-income countries succeeded, and four examples of promising interventions that fell short of their health targets when scaled-up in real world conditions. Each case demonstrates how much effort—and sometimes luck—is required to fight illness and sustain good health.\r\n\r\n\r\nThe epub has been tested in Calibre for PC [Windows], and Moonplus Reader for Android; the mobi file has been tested in Mobipocket Reader for Windows, Kindle for Windows and Kindle for Android","torrent":{"xt":"urn:btih:4a1b4d52ca4a0076fdb6a75d9ce786bffdc41eb7","amp;dn":"Millions+Saved+by+Amanda+Glassman+Miriam+Temin+KS49+epub+mobi","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a1b4d52ca4a0076fdb6a75d9ce786bffdc41eb7","infoHashBuffer":{"type":"Buffer","data":[74,27,77,82,202,74,0,118,253,182,167,93,156,231,134,191,253,196,30,183]},"announce":[],"urlList":[]}}