{"title":"Oir.a.Chuain.Shiair-Facing.the.Atlantic--BBC-Alba--3Ep--468p","uid":12627600,"size":1692006501,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4b4c617b57edaba14939f40ac4b50cfe4db98123&amp;dn=Oir.a.Chuain.Shiair-Facing.the.Atlantic--BBC-Alba--3Ep--468p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"uggauga","files":3,"time":1445793173,"description":"Oir a' Chuain Shiair/Facing the Atlantic \r\n\r\nDocumentary taking a look at the wildlife and landscape of Europe's western coast. \r\n\r\nShown on Scottish Gaelic language channel BBC Alba. \r\nOriginally shown in 2011 (I think). \r\n\r\nMore info: http://www.bbc.co.uk/programmes/b04jlrf8 \r\n\r\n832x468 resolution (the best I can download older shows from the BBC) \r\n\r\nScottish Gaelic with English subtitles. \r\n____________________________________________________________________ \r\n\r\nOir a' Chuain Shiair/Facing the Atlantic - Episode 1 \r\nThe programme begins in the Azores, part of Portugal, and an archipelago of nine islands pushed up from the sea by volcanic eruption in the middle of the Atlantic Ocean. From here the team travels to Spain on the Sierra Morena uplands of Andujar to find the world's rarest big cat, the lynx, before visiting Europe's largest wetland in Coto Doñana National Park, near Seville. \r\n\r\n\r\nOir a' Chuain Shiair/Facing the Atlantic - Episode 2 \r\nTha a' phrògram a' toiseachadh tarsainn air na Pyrenees, anns an Fhraing. An uair sin, siubhlaidh sinn gu Eileanan a' Chaolais Shasannaich, far a bheil an sinn a' lorg gràineag bhàn annasach, agus an laghairt as dathaich san Roinn-Eòrpa. Cuideachd, tha saoghal fon uisge a tha làn de bheatha - beatha a tha comasach air sgàth 's uisgeachan blàtha Srutha a' Chamais. \r\nIn this programme, we begin our journey over the Pyrenees to France. Next up are the Channel Islands where the team encounters an unusual blonde hedgehog and the most colourful lizard in Europe, along with a rich underwater world which has been created by the warm waters of the Gulf Stream. Then it's on to the Isles of Scilly. \r\n\r\n\r\nOir a' Chuain Shiair/Facing the Atlantic - Episode 3 \r\nTha sinn a' gluasad gu Alba gus coimhead air aon dhe na calaidhean nàdarra as motha san t-saoghal. À sin, tha iad a' gluasad chun nan Eileanan Fàro, agus tìr bholcònach Innis-tìle. Tha an turas iongantach seo a' tighinn gu crìoch aig an loch as motha ann an Innis-tìle, far a bheil an t-uisge as glaine san t-saoghal, agus a tha a' toirt cothrom dha luchd-tadhail srucadh ann am mòr-thìrean Eòrpach agus Aimearaganach, 's gun iad ach meatair o chèile. \r\nIn the final programme, We travel to Scotland to view one of the world's largest natural harbours before setting off to experience the striking landscape of the Faroe Islands and the volcanic terrain of Iceland. \r\nThis incredible excursion ends at Iceland's largest lake which boasts the clearest water in the world and allows visitors the opportunity to touch both the European and American continents, just a metre apart","torrent":{"xt":"urn:btih:4b4c617b57edaba14939f40ac4b50cfe4db98123","amp;dn":"Oir.a.Chuain.Shiair-Facing.the.Atlantic--BBC-Alba--3Ep--468p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b4c617b57edaba14939f40ac4b50cfe4db98123","infoHashBuffer":{"type":"Buffer","data":[75,76,97,123,87,237,171,161,73,57,244,10,196,181,12,254,77,185,129,35]},"announce":[],"urlList":[]}}