{"title":"E.B. Sledge - With the Old Breed (mp3 unabridged) WWII Marine Me","uid":6637458,"size":722179400,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:4b7630b336ab3744b0496ec35895311b15151744&amp;dn=E.B.+Sledge+-+With+the+Old+Breed+%28mp3+unabridged%29+WWII+Marine+Me&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":5,"uploader":"rambam1776","files":-1,"time":1314614611,"description":"MP3 VBR - Unabridged - Books on Tape\n &lt;a href=&quot;\nhttp://bayimg.com/eaJNPaadM&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/eaJNPaadM&lt;/a&gt;\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/With_the_Old_Breed&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/With_the_Old_Breed&lt;/a&gt;\n\n\nWith the Old Breed: At Peleliu and Okinawa is a World War II memoir by Eugene Sledge, a United States Marine. Since its first publication in 1981, With the Old Breed has been recognized as one of the best first-hand accounts of combat in the Pacific during World War II. The memoir is based on notes Sledge kept tucked away in a pocket-sized Bible he carried with him during battles.\n\nBy his own account, Sledge began writing the memoir in 1944, &quot;immediately after Peleliu while we were in rest camp on Pavuvu Island&quot;, and continued working on it &quot;as soon as I returned to civilian life&quot; in 1946.[1] Nicknamed &quot;Sledgehammer&quot; by his comrades, Sledge experienced combat during the battles of Peleliu and Okinawa as a 60 mm mortarman while part of K Company, 3rd Battalion, 5th Marines, 1st Marine Division (K/3/5).\n\nThe book's working title was A Marine Mortarman in World War II, which Sledge later changed to Into The Abyss. The book was first published under its final title by the Presidio Press in 1981.\n\n\nSynopsis\n\nIn contrast to the European theater, Sledge's memoir gives a perspective on the Pacific campaign. His memoir is a front-line account of infantry combat in the Pacific War. It brings the reader into the island hopping, the jungle heat and rain, the &quot;banzai attack&quot; or full frontal assault used by his enemies. Sledge wrote starkly of the brutality displayed by American and Japanese soldiers during the battles, and of the hatred that both sides harbored for each other. In Sledge's words, &quot;this was a brutish, primitive hatred, as characteristic of the horror of war in the Pacific as the palm trees and the islands.&quot;\n\nSledge describes one instance in which he and a comrade came across the mutilated bodies of three Marines, including one Marine whose genitals had been cut off and stuffed into the corpse's mouth. He also describes the behavior of some Marines towards dead Japanese, including the removal of gold teeth from Japanese corpses (and, in one case, a severely wounded but still living Japanese soldier), as well as other disturbing trophy-taking.\n\nSledge describes in detail the sheer physical struggle of living in a combat zone and the debilitating effects of constant fear, fatigue, and filth. &quot;Fear and filth went hand in hand,&quot; he wrote. &quot;It has always puzzled me that this important factor in our daily lives has received so little attention from historians and is often omitted from otherwise excellent personal memoirs by infantrymen.&quot; Marines had trouble staying dry, finding time to eat their rations, practicing basic field sanitation (it was impossible to dig latrines or catholes in the coral rock on Peleliu), and simply moving around on the pulverized coral of Peleliu and in the mud of Okinawa.\n\nAdaptations\n\n2007: Ken Burns drew considerably from With the Old Breed for his World War II documentary The War.\n\n2010: HBO used With the Old Breed, along with Robert Leckie's Helmet for My Pillow, as the basis for the miniseries The Pacific, the successor to Band of Brothers.","torrent":{"xt":"urn:btih:4b7630b336ab3744b0496ec35895311b15151744","amp;dn":"E.B.+Sledge+-+With+the+Old+Breed+%28mp3+unabridged%29+WWII+Marine+Me","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b7630b336ab3744b0496ec35895311b15151744","infoHashBuffer":{"type":"Buffer","data":[75,118,48,179,54,171,55,68,176,73,110,195,88,149,49,27,21,21,23,68]},"announce":[],"urlList":[]}}