{"title":"Star Wars Republic Commando WITHCRACK","uid":6638733,"size":1159275170,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4c309f726b78977dcfb9e50fa4f5b19c3721781c&amp;dn=Star+Wars+Republic+Commando+WITHCRACK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"regen2100","files":4,"time":1314665114,"description":"STAR WARS REPUBLIC COMMANDO\n\nSIZE: 1.07 GB\n\nVERY SIMPLE STEPS TO PLAY REPUBLIC COMMANDO.\n\n1. UNRAR SWRC.RAR WHEREVER YOU LIKE\n2. TAKE THE CONTENTS OF SWRC - NOCD AND COPY TO YOUR INSTALL DIRECTORY, OVERWRITE EVERYTHING.\n3. IF IT EVER HAPPENS TO ASK FOR A KEY TRY THIS:\n      2FBD-CD82-21F5-E8CB-NA20\n\nCRACKED AND UPLOADED BY REGEN2100 \n\nStar Wars Republic Commando, as the title suggests, puts you in the shoes of an elite trooper during the height of the Clone Wars. You don't have a proper name, aside from &quot;Three-Eight,&quot; but nonetheless, you're tasked with commanding Delta squad on tough covert ops stretched across three different campaigns. The three other commandos of Delta are also numbered. They are: 07, 40, and 62. Despite the impersonal monikers, each member of your squad has a very unique and likable personality, and this comes across through the entertaining chatter each will dispense over the course of the game. \n\nWhile you're a clone, like the millions of other republic soldiers, you and your squadmates have been trained to be a little better than the other photocopies of Jango Fett. This means you'll also be outfitted with better weapons and armor than the regular soldiers you'll be fighting with periodically through the campaign. You'll start out with a standard assault rifle, but over the course of the game, you'll be introduced to special attachments that turn this same weapon into a sniper rifle and a grenade launcher. You'll also be able to pick up weapons from fallen enemies, ranging from heavy repeating blasters to submachine guns to rocket launchers. Should you run low on ammo, there's a laser handgun that recharges and never runs out of shots. But what's more fun than this is getting up close and personal with melee attacks. Melee strikes are powerful, and they count as one-hit kills on most standard opponents. So even if you do have plentiful ammo, you'll find yourself frequently stabbing Geonosian bugs and Trandoshan mercenaries in the face, mainly because it's both fun and extremely effective. Rounding out your armament is an array of grenades, like thermal detonators for soft targets and electrostatic grenades for mechanical enemies. \n","torrent":{"xt":"urn:btih:4c309f726b78977dcfb9e50fa4f5b19c3721781c","amp;dn":"Star+Wars+Republic+Commando+WITHCRACK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c309f726b78977dcfb9e50fa4f5b19c3721781c","infoHashBuffer":{"type":"Buffer","data":[76,48,159,114,107,120,151,125,207,185,229,15,164,245,177,156,55,33,120,28]},"announce":[],"urlList":[]}}