{"title":"Blue Crab","uid":5297806,"size":20512768,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:4e4653fb1ef156b4492cb283e110c76affaf7bde&amp;dn=Blue+Crab&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mac-Sparrow","files":1,"time":1264117519,"description":"Product Description:\n\nBlue Crab is a versatile program that you use to copy the contents of a web site to your computer, in whole or in part.\n\n    * Conduct fast offline browsing and searching without an internet connection.\n    * Perform batch downloads of URL's\n    * Create a snapshot of a website for historical archiving.\n    * Collect specific types of resources such as images or email addresses.\n    * Search current content more thoroughly than a search engine right on your own computer.\n    * Check a site for broken links, or generate an HTML sitemap\n    * Create full page images of URL's (JPEG, BMP, TIFF, PNG, PSD, etc.)\n\nWith Blue Crab you can download all the content including HTML, PDF, graphics, video, file archives, etc., or use selective filtering to restrict downloads to specific kinds of files. For example, you can choose to save only the JPEG images Blue Crab finds, or just the PDF's.\n\nBlue Crab is always gentle on the server, processing only one URL at a time. (You can even make it pause between successive downloads so as to not overwhelm the server.)\n\nThe demo version you download now is fully functionaly and runs for about ten days.\nWhat's new in this version:\n\n    * Improved the speed of the media grabber by avoiding unnecessary downloads (such as resources of other types or to display images for the slideshow.)\n    * The media grabber slideshow has been extended to work with media types movies and PDFs.\n    * Download progress of redirected urls is now displayed in the media grabber (and all &quot;quicker grabber&quot; windows in general.)\n    * Improved the &quot;completeness&quot; of the media grabber by extending the method of determining media of particular types.\n\nOperating System Requirements:\n\nThis product is designed to run on the following operating systems:\n\n    * Mac OS X 10.5 Intel\n    * Mac OS X 10.5 PPC\n    * Mac OS X 10.4 Intel\n    * Mac OS X 10.4 PPC\n\n\nSerial is included in the download","torrent":{"xt":"urn:btih:4e4653fb1ef156b4492cb283e110c76affaf7bde","amp;dn":"Blue+Crab","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e4653fb1ef156b4492cb283e110c76affaf7bde","infoHashBuffer":{"type":"Buffer","data":[78,70,83,251,30,241,86,180,73,44,178,131,225,16,199,106,255,175,123,222]},"announce":[],"urlList":[]}}