{"title":"Rick Ross featuring Robin Thicke - Lay Back","uid":5142933,"size":149835780,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:4eb673e1a8337f2e760d5ed96aaea133a05f6ad8&amp;dn=Rick+Ross+featuring+Robin+Thicke+-+Lay+Back&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1257049137,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nDeeper Than Rap is the third studio album by Rick Ross. It was released on April 21, 2009 and the first to be released under his own label, Maybach Music Group.\n\nRoss first announced plans to create Deeper Than Rap in May 2008. In addition to this album, Ross had been working on several mixtapes, freestyle tracks, and a collaboration with rapper Birdman titled The H. Controversy arose over photographs leaked in July 2008 of Ross (real name William Roberts) taken during his career as a corrections officer. Toward the end of a street track &quot;Kiss My Pinky Ring Curly&quot; that intended to attack rapper 50 Cent, Ross mentioned a possible release date of March 24, 2009. In early March 2009, the album release date was delayed to April 21, and Ross told MTV News about a possible charity concert for underprivileged neighborhoods of New York City. A listening party for this album was held at the Tribeca Grand Hotel in New York City on March 17. Prior to the release day, Ross had asserted in interviews with MTV that this album would be his best during his career. Rick Ross claimed that if &quot;Get Rich or Die Tryin'&quot; by '50 Cent sold 10 million copies, then my next record ('Deeper than Rap') will sell 12 million,' however this did not materialize, with the album selling less than a 30th of that amount.\n\nDeeper Than Rap debuted #1 on Billboard Chart selling 158,000 copies its first week, making it Rick Ross's third #1 album. His previous album Trilla sold 198,000 copies in its first week of release. The album has sold 392,000 copies to date in the U.S.\n\nWilliam Leonard Roberts II (born January 28, 1976), better known by his stage name Rick Ross, sometimes written as Rick Ro$$ is an American rapper. He took his stage name from the drug trafficker &quot;Freeway&quot; Ricky Ross, to whom he has no connection. Rick Ross has also founded his own record label Maybach Music Group, on which he released his third studio album Deeper Than Rap.\n\n\nSome lyrics are censored in this videos.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:4eb673e1a8337f2e760d5ed96aaea133a05f6ad8","amp;dn":"Rick+Ross+featuring+Robin+Thicke+-+Lay+Back","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4eb673e1a8337f2e760d5ed96aaea133a05f6ad8","infoHashBuffer":{"type":"Buffer","data":[78,182,115,225,168,51,127,46,118,13,94,217,106,174,161,51,160,95,106,216]},"announce":[],"urlList":[]}}