{"title":"NI Traktor DJ Studio 3.1.1 OSX Update","uid":3515539,"size":9670403,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:4ec0a29bd7a244f0fbeea24ba23315682096934d&amp;dn=NI+Traktor+DJ+Studio+3.1.1+OSX+Update&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Cain303","files":2,"time":1156379085,"description":"What's New in Version 3.1 \n\nGUI \nNew: Progress bar has been moved under the tree and can be activated individually \nNew: Shortcuts have been moved under the list and can be activated individually \nNew: Browser buttons labeled with icons \nNew: Better visibility of sorted colum in playlist \n\nUSABILITY \nNew: Loop lenghts, beatjumps and knob sensitivities recalled after restart \nNew: Shows selected track in Mac Finder / Windows Explorer \nNew: Shows playlists (NML) and mixfiles (NMX) in TRAKTOR Explorer \nNew: Autoplay proceeds in listed sequence \nNew: Undo function for sorting and for removal of tracks from playlists \nNew: Recalls Master Tempo after restart \nNew: Starts and pauses preview of selected track with a single command \nNew: Draging playlists on occupied shortcut slots replaces shortcut \nNew: Shift dragging playlists on occupuied shortcut slots appends their content \nNew: Shift+Up/Dn now works for group selection in playlists \nNew: Shows latest playlist as first \nNew: BPM search range narrowed to +/- 2.5 BPM \nNew: The &quot;Renumber&quot; button has been replaced by a &quot;Lock&quot; function in the context menu of each playlist. Locked playlists do not recall changes made to them during a Traktor session. Permanent changes to playlists have to be applied in unlocked mode. Sorting by the numbered column (#) restores the original sequence of the playlist. All old playlists are initially locked by default. \nNEW: Save option in context menu of playlists \nNEW: Controlling Phase Sync via mouse scroll wheel \n\nINFO \nNew: AAC (.m4a) metadata now fully supported (writes Traktor metadata into .m4a files) \nNew: Determines total track time during import \nNew: Shows number of tracks, total time and total size of selected playlist \n\nBUGFIXES \nFixed: Shifting beatgrids of AAC encoded files \nFixed: Untight mix recording when usind AAC encoded files \nFixed: Autoselection of stored loops and loop jump \nFixed: Missing backup folder on Mac \nFixed: Explorer does not sort playlists alphabetically \nFixed: Wrong estimation of variable bitrates \nFixed: Fade-In/Out markers do not work in autoplay \nFixed: Track history in mixed playlists not correctly displayed\n","torrent":{"xt":"urn:btih:4ec0a29bd7a244f0fbeea24ba23315682096934d","amp;dn":"NI+Traktor+DJ+Studio+3.1.1+OSX+Update","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ec0a29bd7a244f0fbeea24ba23315682096934d","infoHashBuffer":{"type":"Buffer","data":[78,192,162,155,215,162,68,240,251,238,162,75,162,51,21,104,32,150,147,77]},"announce":[],"urlList":[]}}