{"title":"jQuery Hotshot","uid":8864403,"size":3414789,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:52aaffbebdd18a7fbf55494854fc4f940552db3b&amp;dn=jQuery+Hotshot&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sigor10","files":-1,"time":1377822817,"description":"jQuery Hotshot - Dan Wellman\n\nEnglish | ISBN: 1849519102 | 2013 | 296 pages \n\n\nTen practical projects that exercise your skill, build your confidence, and help you master jQuery\n\nOverview\nSee how many of jQuery's methods and properties are used in real situations. Covers jQuery 1.9.\nLearn to build jQuery from source files, write jQuery plugins, and use jQuery UI and jQuery Mobile.\nFamiliarise yourself with the latest related technologies like HTML5, CSS3, and frameworks like Knockout.js.\n\nIn Detail\n\njQuery is used by millions of people to write JavaScript more easily and more quickly. It has become the standard tool for web developers and designers to add dynamic, interactive elements to their sites, smoothing out browser inconsistencies and reducing costly development time.\n\njQuery Hotshot walks you step by step through 10 projects designed to familiarise you with the jQuery library and related technologies. Each project focuses on a particular subject or section of the API, but also looks at something related, like jQuery's official templates, or an HTML5 feature like localStorage. Build your knowledge of jQuery and related technologies.\n\nLearn a large swathe of the API, up to and including jQuery 1.9, by completing the ten individual projects covered in the book.\n\nSome of the projects that we'll work through over the course of this book include a drag-and-drop puzzle game, a browser extension, a multi-file drag-and-drop uploader, an infinite scroller, a sortable table, and a heat map.\n\nLearn which jQuery methods and techniques to use in which situations with jQuery Hotshots.\n\nWhat you will learn from this book\nLearn how to use the latest version of jQuery (1.9) in real-world situations.\nCreate a jQuery plugin structured for organisation and maintainability.\nConstruct a custom version of jQuery using Node.js and Grunt.js, and learn how to run unit tests using qUnit.\nBuild on top of online services like Google Maps to create interactive interfaces.\nUse templating frameworks to easily and efficiently create repetitive areas of the page populated with data.\nGet started with the related jQuery-powered frameworks jQuery UI and jQuery Mobile.\nProduce interactive interfaces that respond to user interactions using the Model-View-View Model framework Knockout.js.\nUse the latest web standards like HTML5 and CSS3 to create attractive and semantic web pages.\n\nApproach\n\nThis book takes a hands-on, tutorial-style approach that walks you step -by -step through 10 individual projects that each focus on producing a specific, real-world product or application.\n\nWho this book is written for\n\nThis book is aimed primarily at front-end developers, preferably already with a little jQuery experience, or those people that simply want to build on their existing skills with jQuery.","torrent":{"xt":"urn:btih:52aaffbebdd18a7fbf55494854fc4f940552db3b","amp;dn":"jQuery+Hotshot","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52aaffbebdd18a7fbf55494854fc4f940552db3b","infoHashBuffer":{"type":"Buffer","data":[82,170,255,190,189,209,138,127,191,85,73,72,84,252,79,148,5,82,219,59]},"announce":[],"urlList":[]}}