{"title":"The Big Book Of Breasts by Dian Hanson (TASCHEN) [XXX]","uid":12095887,"size":109179702,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:531477cc3170144bf23c6f89c2da7dc57264756c&amp;dn=The+Big+Book+Of+Breasts+by+Dian+Hanson+%28TASCHEN%29+%5BXXX%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"djupload","files":9,"time":1436145094,"description":"Itï¿½ll knock both your eyes out! OK, imagine the best photos from the iconic first volume of the body parts series, The Big Book of Breasts, in their original 30 by 30 cm size, but popping off the page in state-of-the-art 3-D. An impossible dream? Not so, Luddites! In this wonderful modern world of digital magic, 90 photos from the original book, plus 18 stunning new photos, have been transformed from boring old last-century 2-D into cutting edge 21st century 3-D by Jon Schnitzer and The Brain Factory, the geniuses whipping up special effects for filmmakers such as Tim Burton. This 220-page special edition has a revised introduction, updated layout, and comes with two pairs of red/blue anaglyph viewing glasses so that you and a friend may marvel at the enhanced roundness of our big breasted models together. Unlike other 3-D pictures you may have seen before, the photos in The Big Book of Breasts 3-D do not look distorted when viewed without the glasses. The Brain Factoryï¿½s technique is so subtle itï¿½s hard to even detect the red/blue tint in many of the black and white photos, but when you put on your glasses the curves leap from the page, not in flat layers as in old-style 3-D, but as fully rounded body contours. It doesnï¿½t take a genius to guess that this will be the gift book of the year. As Playboyï¿½s Hugh Hefner recently observed, ï¿½What would people most like to see in 3-D? Probably a naked lady.ï¿½ We hear you Hef, and we deliver","torrent":{"xt":"urn:btih:531477cc3170144bf23c6f89c2da7dc57264756c","amp;dn":"The+Big+Book+Of+Breasts+by+Dian+Hanson+%28TASCHEN%29+%5BXXX%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"531477cc3170144bf23c6f89c2da7dc57264756c","infoHashBuffer":{"type":"Buffer","data":[83,20,119,204,49,112,20,75,242,60,111,137,194,218,125,197,114,100,117,108]},"announce":[],"urlList":[]}}