{"title":"One Piece Movie 12 : Z (2012) [1080p eng dub]","uid":11488399,"size":1203422264,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:535e6e4913658f70b39709df309e596664cd10ce&amp;dn=One+Piece+Movie+12+%3A+Z+%282012%29+%5B1080p+eng+dub%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"realpariah","files":1,"time":1416242748,"description":"This is my first attempt at this I had One Piece Film Z in 1080p with only Japanese Audio and I prefer dubs.  Well since the Dubbed version came out a couple months ago and no one has uploaded the torrent yet I could not find it in usual spots so I went and found the dubbed version on some embedded streaming site.  From there I was able to download the video extract the audio with ffmpeg and use MKVMerge to then add that Eng Dub Audio track in with all the Japanese 5.21 and Eng SSA subs tracks.  It worked rather well, and after test watching it is only maybe like an eighth to quarter second off and you won't really notice unless you know to look for it and stare at EVERYTHING.\n\nI can not remember who did the original 1080p mkv that I used to add the audio to and for that I am sorry if anyone knows and posts in comments who it belongs to massive shoutz to them :-)\n\nFile Specs I know\nFile Size: Was 1G even after adding English audio it is now 1.2G\nVideo:     1080p\nAudio:     English Stereo AC3 @ 192kbps and Japanese 5.1\nSubs:      English SSA subs\n\n\nPlot: \n\nThe film opens with Zephyr (who uses the nickname Z), commander of the Neo Marines, launching an all out assault on a Marine base. Z and his men infiltrate the base and steal the Dyna Stones, which are dangerous weapons that cause a massive explosion when they come into contact with oxygen. As the Neo Marines retreat, Kizaru, a Marine admiral, ambushes them. Z then crushes a Dyna Stone, causing an explosion that destroys the island. The Straw Hat pirates, which consists of, Zoro, Nami, Usopp, Sanji, Chopper, Robin, Franky and Brook, led by Luffy, their captain, are sailing on the sea and see Z floating in the water. They rescue him and Luffy and Z have a friendly chat. After discovering that Luffy and his crew are pirates, however, he attacks the ship. The Neo Marines arrive and Ain, a Neo Marine who possesses the power to reverse the age of anyone or thing by twelve years, turns Nami and Chopper into kids, and Robin into a teen. After losing to Z, the Straw Hats escape. The top Marines have gathered together and are discussing Zs motives. They figure that he is going to destroy the three End Points, which will blow up the world. They make Z their top enemy and declare they will stop him. Meanwhile, the Straw Hats have docked at a port, where Franky fixes the ship while Nami suggests they go the next island to gather information on Z. They learn from some Marines that Z is on the island, which turns out to be the second End Point. Luffy confronts him again and loses, while Z succeeds in destroying the island. After heading back to the port, the Staw Hats learn that Z is on a nearby island, which is the third and final End Point. Zoro defeats Ain, which returns Nami, Chopper and Robin to their proper ages. Luffy and Z confront each other again, where Luffy barely manages to defeat Z. The Marines show up to arrest Z and Luffy, but Z, having gained respect for Luffy during their fight, takes on the Marines alone. Luffy and his crew sail off in silence, while Z fights the Marines to his death. The scene then cuts to his crewmates weeping over his grave and we see a flashback to Zephyr as a child, where he defeats some bullies as the hero, Z","torrent":{"xt":"urn:btih:535e6e4913658f70b39709df309e596664cd10ce","amp;dn":"One+Piece+Movie+12+%3A+Z+%282012%29+%5B1080p+eng+dub%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"535e6e4913658f70b39709df309e596664cd10ce","infoHashBuffer":{"type":"Buffer","data":[83,94,110,73,19,101,143,112,179,151,9,223,48,158,89,102,100,205,16,206]},"announce":[],"urlList":[]}}