{"title":"Wondershare PDF Converter Pro 2.6.1.4 + Rus with PATCH","uid":6716305,"size":276274265,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:53c14ad4158b2d80bd1173186e3f9ebc2e8a4ca8&amp;dn=Wondershare+PDF+Converter+Pro+2.6.1.4+%2B+Rus+with+PATCH&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"chami1988","files":-1,"time":1317574034,"description":"Wondershare PDF Converter Pro includes all the features of AnyBizSoft PDF Converter, and also integrates new OCR technology, which can convert both normal and scanned PDF to text-based document formats.\nSupports OCR (Only available in Pro Version)\n\n Fast and accurate OCR recognition and transform;\n- Save image-based scanned PDF to text-based Word, Excel, PowerPoint, EPUB, HTML, and Text documents\n- Support 17 recognition languages: English, Turkish, Greek, German, French, Italian, Portuguese, Spanish, Russian, Polish, Czech, Slovak, Ukrainian, Bulgarian, Croatian, Romanian, and Catalan.\n\nBatch and Partial conversion modes\n- Batch conversion mode: Help you convert up to 200 PDF files at one time, save your time;\n- Partial conversion mode: Help you flexibly convert selected pages or page ranges in the PDF files to Word documents, Excel spreadsheets, PowerPoint presentations, EPUB eBooks, HTML pages or Text files.\n\nConvert encrypted PDF files\n- PDF Converter also can convert encrypted PDF files which are protected from printing, editing, and copying;\n- For the password-protected PDF files from opening, you need to type the password in the pop-up dialog box, and then the PDF Converter can do the conversion work for you.\n\nExport 6 formats accurately\n- PDF Converter can convert PDF files to Word documents, Excel spreadsheets, PowerPoint presentations, EPUB eBooks, Text files and HTML pages;\n- After conversion, all the original text, images, graphics, tables, hyperlinks, layout and formatting are exactly preserved;\n- Support Microsoft Office 2010/2007/2003\n\nWhat OCR can do for you?\n- Recognize text from scanned, image-based PDF files\n- Enable you to search text within the scanned PDF files\n- Let you copy text and images from scanned PDF files\n- You can edit the text and images within the scanned PDF files if with a normal PDF Editor\n\nOS : Win XP/2000/Vista/Win 7\nLanguage : English/Russian","torrent":{"xt":"urn:btih:53c14ad4158b2d80bd1173186e3f9ebc2e8a4ca8","amp;dn":"Wondershare+PDF+Converter+Pro+2.6.1.4+%2B+Rus+with+PATCH","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53c14ad4158b2d80bd1173186e3f9ebc2e8a4ca8","infoHashBuffer":{"type":"Buffer","data":[83,193,74,212,21,139,45,128,189,17,115,24,110,63,158,188,46,138,76,168]},"announce":[],"urlList":[]}}