{"title":"Biker Rockstar series (Bec Botefuhr) (1-3)","uid":8881039,"size":656225,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:53c3377a8aa431d7d82956665994ce92d5153157&amp;dn=Biker+Rockstar+series+%28Bec+Botefuhr%29+%281-3%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":4,"time":1378321929,"description":"heart song\nTwo years have passed since the pain and heart ache Violet felt when her loved ones betrayed her, since she ran. Now she is heading back home. Travis has been on her mind for two years, and she wants to put her past to bed, but what happens when she comes back only to find he has changed? He is more dangerous for her now, yet, she can't seem to stay away. Then there is the crazy stalker that is less than impressed with her return, and the biker who is still after her. Did she make a mistake coming home?Travis lied; he knows he made a mistake. He wanted to make it better, but she just upped and left. Mischief was his life line, and now she is back and testing everything he ever felt for her, but his life is darker now. Drugs have taken over, and without them, he doesn't know how to cope. He lost the love of his life, and his ex won't let him see his daughter. How will he deal with everything happening at once?Come on the final journey with Travis and Violet, where they discover each other again. Will they find their happily ever after?\n\npheonix rockstar \nViolet has been raised in a world with bikers, rough men and separated parents. The only savior in her world, was her love for Travis, her best friend. They grew up together, creating a hopeless friendship against all odds. Then he left, with no goodbye, no explanation. Travis went on and became a successful rockstar, Violet moved on and thought she was finally over it. Then Travis returns and tugs on her heart strings all over again. She finds it hard to say no, she is different now...she isn't the girl he once adored; dark things have happened to her. What if she isn't what he believes he wants so badly? Come on Travis and Violet's journey of love, heartache and all the things in between. This book is erotica; it contains graphic sexual content and swearing - it is lusty, crazy, beautiful and in parts morally incorrect. It is one hell of a rollercoaster ride of love and heartache. It is action packed with drama, if this is not your thing, please don't purchase it. It does end with a cliff hanger but I promise the next book will be HEA! Please remember it is FICTION!!!\n\nchiefs angel \nou have followed Violet &amp; Travis in Phoenix Rockstar and Heart Song, now it is time for Chief's story.\n\nMandy (Angel) is a good girl, sick of living the perfect life. She is tired of fancy parties, forced dates and over controlling parents. Her world changes when she meets Caden.\n\nCaden (Chief) is part of a Motorcycle club, he is a bad boy and delves in dangerous things, but he captures her heart and soul. How will she ever go back to living a normal life, once she has experienced the happiness Chief can give her?","torrent":{"xt":"urn:btih:53c3377a8aa431d7d82956665994ce92d5153157","amp;dn":"Biker+Rockstar+series+%28Bec+Botefuhr%29+%281-3%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53c3377a8aa431d7d82956665994ce92d5153157","infoHashBuffer":{"type":"Buffer","data":[83,195,55,122,138,164,49,215,216,41,86,102,89,148,206,146,213,21,49,87]},"announce":[],"urlList":[]}}