{"title":"Humanism Betrayed (2001) by Graham Good","uid":10271372,"size":1288326,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:53cebd481226a7cf35c11f8fb55608caf424f8a9&amp;dn=Humanism+Betrayed+%282001%29+by+Graham+Good&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1401590218,"description":"Humanism Betrayed - Theory, Ideology, and Culture in the Contemporary University (2001) by Graham Good.pdf\n\nIn Humanism Betrayed Graham Good offers a defence of liberal humanism against the illiberal trends, political and intellectual, that dominate today's university. He uses the McEwen Report episode at the University of British Columbia to illustrate the current political climate in universities, showing how due process was neglected in favour of ideological inquisition. The intellectual trends Good discusses include what he calls the New Sectarianism, which rejects individuality in favour of collective identities based on race, gender, and sexual preference; Presentism, which rejects the notion of history as a continuous narrative in favour of seeing the past as interpretable in any way that suits the political interests of the present; and a Ahermeneutic of suspicion, in which literary texts are seen as masks for discreditable political motives. Good demonstrates that these trends culminate in the prison-like Acarceral vision of Michel Foucault and his followers: the view that culture is ideology and that culture does not free humans but incarcerates them. Good contrasts this view with the liberal vision of culture and society represented by Northrop Frye, concluding with an analysis of the relationship between anti-humanist theory among academics and the managerial practices of university administrations, which, he argues, neglect or reject basic humanistic values such as free individuality, aesthetic greatness, and autonomous inquiry.\n\n128 pages\nPublisher: Mcgill Queens Univ Pr (May 2001)\nLanguage: English\nISBN-10: 0773521879\nISBN-13: 978-0773521872","torrent":{"xt":"urn:btih:53cebd481226a7cf35c11f8fb55608caf424f8a9","amp;dn":"Humanism+Betrayed+%282001%29+by+Graham+Good","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53cebd481226a7cf35c11f8fb55608caf424f8a9","infoHashBuffer":{"type":"Buffer","data":[83,206,189,72,18,38,167,207,53,193,31,143,181,86,8,202,244,36,248,169]},"announce":[],"urlList":[]}}