{"title":"The Sims 3 + Keygen + Crack [Resource RG Games]","uid":4908945,"size":6011901136,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:540c49929da7043605c202d406ab7bf631f973aa&amp;dn=The+Sims+3+%2B+Keygen+%2B+Crack+%5BResource+RG+Games%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MidnightRowan","files":3,"time":1243044181,"description":"The Sims 3 + Keygen + Crack [Resource RG Games]\n\nThe freedom of The Sims 3 will inspire you endless creative possibilities and amuse you with unexpected moments of surprise and mischief!\n\nCreate over a million unique Sims and control their lives. Customize everything from their appearances to their personalities, and even the home of their dreams. Then, send your Sims out to explore new locations around town and to meet other Sims in the neighborhood.\n\nControl your Sims' Destinies!\n\n    * Face short- and long-term challenges and reap the rewards\n    * Your Sims can pursue random opportunities to get fast cash, get ahead, get even, and more\n    * Choose whether or not to fulfill your Sims' destinies by making their wishes come true. Will your Sims be thieves, rock stars, world leaders? You decide!\n\nCustomize Everything!\n\n    * Design and build your dream house and decorate it to fit your Sims' personalities\n    * Customize your Sims' possessions from clothing to furnishings or even their car\n\nExplore New Locations!\n\n    * Explore the ever-changing neighborhood -- and take your Sims to meet friends in the park, go on a date at the bistro, visit neighbors' homes, converse with less-than-savory characters in the graveyard, and more! Who knows what might happen?\n    * Admire the natural beauty of the beach, the mountains, and more\n\nCreate any Sim you can imagine and give them unique personalities!\n\nCreate millions of different personalities with traits such as evil, artistic, kleptomaniac, clumsy, insane, romantic, and more!\n\n    * Influence the behaviors of your Sims with the traits you've chosen. Will you create a neurotic romantic with a heart of gold, or a geeky super-genius with an evil streak?\n    * Create any Sim with easy-to-use design tools that allow for unlimited customization of facial features, hair color, eye color, and more\n    * Fine-tune your Sim's body shape from thin to curvy to muscular\n\nSystem Requirements:\n\nWINDOWS XP:\n\n    * 2.0 GHz P4 processor or equivalent\n    * 1 GB RAM\n    * 128 MB Video Card with support for Pixel Shader 2.0\n    * DirectX 9.0c\n    * Microsoft Windows XP Service Pack 2\n    * 6.1 GB Hard Drive space with at least 1 GB additional space for custom content and saved games\n\nWINDOWS VISTA:\n\n    * 2.4 GHz P4 processor or equivalent\n    * 1.5 GB RAM\n    * 128 MB Video Card with support for Pixel Shader 2.0\n    * Microsoft Windows Vista Service Pack 1\n    * 6.1 GB Hard Drive space with at least 1 GB additional space for custom content and saved games\n\nFor computers using built-in graphics chipsets under Windows:\n\n    * Intel Integrated Chipset, GMA-3 Series or above\n    * 2.6 GHz Pentium D CPU, or 1.8 GHz Core 2 Duo, or equivalent\n    * 0.5 GB additional RAM\n\nNotes:\n\n    * Install Instructions included in .torrent\n    * Install has been tested on both Vista x86 and XP\n    * Completely Clean\n\n\nEnjoy, and Keep Seeding!","torrent":{"xt":"urn:btih:540c49929da7043605c202d406ab7bf631f973aa","amp;dn":"The+Sims+3+%2B+Keygen+%2B+Crack+%5BResource+RG+Games%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"540c49929da7043605c202d406ab7bf631f973aa","infoHashBuffer":{"type":"Buffer","data":[84,12,73,146,157,167,4,54,5,194,2,212,6,171,123,246,49,249,115,170]},"announce":[],"urlList":[]}}