{"title":"Sorrows of Empire by Chalmers Johnson [ePub+Mobi+AudioBook]","uid":7239822,"size":326386428,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:544bec19d049778c7ca8323488c7572ceddfe8c4&amp;dn=Sorrows+of+Empire+by+Chalmers+Johnson+%5BePub%2BMobi%2BAudioBook%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"phillipm","files":-1,"time":1336102427,"description":"\nOriginal eBook Files, NOT Some Crappy PDF Conversion!\n\nIncludes ePub, Mobi, AND iTunes AudioBook!\n\n\nBook Description\nPublication Date: December 23, 2004 | ISBN-10: 0805077979 | ISBN-13: 978-0805077971\n&quot;Impressive . . . a powerful indictment of U.S. military and foreign policy.&quot;\n-Los Angeles Times Book Review, front page\n\nIn the years after the Soviet Union imploded, the United States was described first as the globe's &quot;lone superpower,&quot; then as a &quot;reluctant sheriff,&quot; next as the &quot;indispensable nation,&quot; and in the wake of 9/11, as a &quot;New Rome.&quot; In this important national bestseller, Chalmers Johnson thoroughly explores the new militarism that is transforming America and compelling us to pick up the burden of empire.\n\nRecalling the classic warnings against militarism-from George Washington's Farewell Address to Dwight Eisenhower's denunciation of the military-industrial complex-Johnson uncovers its roots deep in our past. Turning to the present, he maps America's expanding empire of military bases and the vast web of services that support them. He offers a vivid look at the new caste of professional militarists who have infiltrated multiple branches of government, who classify as &quot;secret&quot; everything they do, and for whom the manipulation of the military budget is of vital interest. \n\nAmong Johnson's provocative conclusions is that American militarism is already putting an end to the age of globalization and bankrupting the United States, even as it creates the conditions for a new century of virulent blowback. The Sorrows of Empire suggests that the former American republic has already crossed its Rubicon-with the Pentagon in the lead.\n\nFrom Publishers Weekly\nIn his prescient 2000 bestseller, Blowback, East Asia scholar Johnson predicted dire consequences for a U.S. foreign policy that had run roughshod over Asia. Now he joins a chorus of Bush critics in this provocative, detailed tour of what he sees as America's entrenched culture of militarism, its &quot;private army&quot; of special forces and its worldwide archipelago of military &quot;colonies.&quot; According to Johnson, before a mute public and Congress, oil and arms barons have displaced the State Department, secretly creating &quot;a military juggernaut intent on world domination&quot; and are exercising &quot;preemptive intervention&quot; for &quot;oil, Israel, and... to fulfill our self-perceived destiny as a New Rome.&quot; Johnson admits that Bill Clinton, who disguised his policies as globalization, was a &quot;much more effective imperialist,&quot; but most of the book assails &quot;the boy emperor&quot; Bush and his cronies with one of the most startling and engrossing accounts of exotic defense capabilities, operations and spending in print, though these assertions are not new and not always assiduously sourced. Fans of Blowback will be pleased despite Johnson's lack of remedies other than &quot;a revolution&quot; in which &quot;the people could retake control of Congress... and cut off the supply of money to the Pentagon.&quot;\n\n\nOriginal eBook Files, NOT Some Crappy PDF Conversion!\n\nIncludes ePub, Mobi, AND iTunes AudioBook!","torrent":{"xt":"urn:btih:544bec19d049778c7ca8323488c7572ceddfe8c4","amp;dn":"Sorrows+of+Empire+by+Chalmers+Johnson+%5BePub%2BMobi%2BAudioBook%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"544bec19d049778c7ca8323488c7572ceddfe8c4","infoHashBuffer":{"type":"Buffer","data":[84,75,236,25,208,73,119,140,124,168,50,52,136,199,87,44,237,223,232,196]},"announce":[],"urlList":[]}}