{"title":"Risky_Business_FullDvd","uid":3500686,"size":4466931759,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:55ca7b6fbce2c8adf26d57a521e29afdbde29f00&amp;dn=Risky_Business_FullDvd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"silvia-","files":12,"time":1152006263,"description":"Risky Business \n\n\nYear: 1983\nDirector: Paul Brickman\nCast: Tom Cruise, Rebecca De Mornay, Joe Pantoliano, Richard Masur, Bronson Pinchot, Curtis Armstrong, Nicholas Pryor, Janet Carroll\nOvertime: 98 mns.\nGenre: Comedy\nSystem: PAL, 16:9\nAudio: Dolby Surround: English, Mono: Spanish and German\nSubtitles:  English, German, Spanish, Swedish, Norwegian, Danish, Finnish, Portugese, Hebrew, Polish, Greek, Czech, Turkish, Hungarian, Icelandic, Croation, French, and Italian. English for the hearing impaired, German for the hearing impaired and Italian for the hearing impaired.\nInteractive Menus\nFilmographies\nScene access\n\nSynopsis: Joel Goodson is the type of teenager who makes his parents proud: he&amp;#039;s nice, handsome, intelligent, and even principled. But when Joel&amp;#039;s parents leave town for a few days, a series of events occur that will change Joel&amp;#039;s sheltered life. For starters, he meets Lana, a hooker who proceeds to deflower our young hero, and then suggests he turn his home into a house of prostitution for one evening. Joel agrees, and just as sexy hookers and randy guys turn Joel&amp;#039;s house upside down, a representative from Princeton University arrives, to interview Joel! How Joel handles this and other crises (losing his dad&amp;#039;s Porsche, the loss of all his furniture, falling in love with a prostitute) will alter Joel&amp;#039;s life forever. \n&quot;One of the best American comedies of recent years&quot; (Roger Ebert), Risky Business slyly explores the teen dilemma of growing up good-hearted but guilt-ridden. In his starmaking role as Joel, Tom Cruise is a charmer-with-conscience that foreshadows Jerry Maguire. Rebecca de Mornay makes a dynamic movie debut as liberated call girl Lana. They and writer/director Paul Brickman make Risky Business &quot;a first-class affair&quot; (People).\n\nFull DVD5\n\nMore Details: www.dvdquorum.es\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:55ca7b6fbce2c8adf26d57a521e29afdbde29f00","amp;dn":"Risky_Business_FullDvd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55ca7b6fbce2c8adf26d57a521e29afdbde29f00","infoHashBuffer":{"type":"Buffer","data":[85,202,123,111,188,226,200,173,242,109,87,165,33,226,154,253,189,226,159,0]},"announce":[],"urlList":[]}}