{"title":"Epub.mobile.books.28.05.2013","uid":8516501,"size":458956034,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:561635da2fff4f179da8ab760b9499469b8a7a89&amp;dn=Epub.mobile.books.28.05.2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"kPulsate","files":204,"time":1369754613,"description":"To Marry an English Lord: Or How Anglomania Really Got Started by Gail MacColl &amp; Carol Wallace\n\n\nFormat: mobi/epub\nGenre: History\nPrint Length: 416 pages\nRelease Date: 13 April 2012\n\nIn 1895, nine American girls, including a Vanderbilt (railroads), LaRoche (pharmaceuticals), Rogers (oil) and Whitney (New York trolleys), married peers of the British new money, among them, a duke, an earl, three barons and a knight. It was the peak year of a social phenomenon that began when the entrenched members of old New York snubbed these &quot;new money&quot; families after the Civil War, sending them off to England in quest of class and bequeathing to us Anglomania, Preppy, the Jet Set, and even Princess Di.\n\nHere is the American Heiress's story. Filled with tales of wealth and marriage, sex and snobbery - and 100-year-old gossip that's still scorching - To Marry an English Lord is a heavily illustrated and energetically presented popular history. A rich tapestry of essays, sidebars, fact-filled boxes, and lively anecdotes, combined with wealth of portraits, drawings, photographs, and other rare Victoriana - it chronicles the era of Mrs. Astor, Edith Wharton, King Edward VII, and the Marlborough House Set. \n\nFrom the Gilded Age until 1914, more than 100 American heiresses invaded Britannia and swapped dollars for titles - just like Cora Crawley, Countess of Grantham, the first of the Downton Abbey characters Julian Fellowes was inspired to create after reading To Marry An English Lord. This is the only book to tell how they did it. Filled with vivid personalities, gossipy anecdotes, grand houses and a wealth of period details. \n\n\n\nThis Man Trilogy by Jodi Ellen Malpas\n\n\nFormat: mobi/epub\nGenre: Contemporary Romance\nRelease Date: 2012-13\n\nThis Man (This Man #1) (2012)\n\nYoung interior designer Ava O'Shea has an appointment for a first consultation at The Manor with the owner, Mr Jesse Ward. She is expecting nothing more than an overweight, cravat wearing, well-to-do countryman, and on arrival, nothing would suggest otherwise. How wrong could she be? This Man is devastatingly handsome, charming and confident. \n\nHe is also a conceited, hedonistic playboy, who knows no boundaries. Ava desperately does not want to be attracted to him, but she can't control the overwhelming affect he has on her. Every instinct is telling her to run, so she does, but Jesse Ward is not so willing to let her go. He wants her and is determined to have her. She knows she is heading for heartbreak, but how can she run when he won't let her?\n\nBeneath This Man (#2) (2013)\nThis Man Confessed (#3) (2013)\n\nAuthor:\n\nJodi took a chance on a story with some intense characters and exploded onto the self-published author scene at the end of October 2012, sparking some incredible reactions from women all over the world. Within two months of self-publishing This Man, Jodi made the decision to leave her day job to concentrate on her new and very unexpected career in writing.\n\nThe second instalment of the This Man Trilogy, 'Beneath This Man' was published in January 2013 and fast became an Amazon Bestseller, holding #1 position in the chart of its genre for many weeks in both the US and UK.\n\n\n\nBannon and Clare Series #1-2 (plus Novella) Lilith Saintcrow\n\n\nFormat: mobi/epub\nGenre: Steampunk/Romance\nRelease Date: 2012 - 21 May 2013\n\nThe Iron Wyrm Affair (Bannon &amp; Clare, #1) (2012)\n\nEmma Bannon, forensic sorceress in the service of the Empire, has a mission: to protect Archibald Clare, a failed, unregistered mentath. His skills of deduction are legendary, and her own sorcery is not inconsiderable. It doesn't help much that they barely tolerate each other, or that Bannon's Shield, Mikal, might just be a traitor himself. Or that the conspiracy killing registered mentaths and sorcerers alike will just as likely kill them as seduce them into treachery toward their Queen.\n\nIn an alternate London where illogical magic has turned the Industrial Revolution on its head, Bannon and Clare now face hostility, treason, cannon fire, black sorcery, and the problem of reliably finding hansom cabs. \n\nThe Damnation Affair (#1.5) (Novella) (2012)\nThe Red Plague Affair (#2) (2013)\n\nAuthor:\n\nLilith Saintcrow was born in New Mexico, bounced around the world as an Air Force brat, and fell in love with writing when she was ten years old. She lives in Vancouver, Washington, in a house full of stray cats and children.\n\n\n\nPrivate Down Under (Private #6) (2013) James Patterson\n\n\nFormat: mobi/epub\nGenre: Thriller\nPrint Length: 368 pages\nRelease Date: 23 May 2013\n\nP.I. Craig Gisto, head of the latest branch of Private, is enjoying the glamorous launch party with his new team when their celebrations are interrupted by the bloodied arrival of a boy with his eyes gouged out.\n\nThe boy is the kidnapped son of one of Australia's richest men - but investigating his death isn't their only pressing case. The rock star Micky Stevens is convinced someone's trying to kill him, and believes Private are the only ones who can help.\n\nAs if that wasn't enough, someone is murdering the wealthy wives of the Eastern Suburbs, in the most brutal way imaginable. And if they don't catch the killer soon, the next victim could be someone close to Private.\n\nAuthor:\n\nJames Patterson is one of the best-known and biggest-selling writers of all time. He is the author of some of the most popular series of the past decade - the Alex Cross, Women's Murder Club and Detective Michael Bennett novels - and he has written many other number one bestsellers including romance novels and stand-alone thrillers. He lives in Florida with his wife and son.\n\n\n\nThe 30-Day Love Detox: Cleanse Yourself of Bad Boys, Cheaters, and Men Who Won't Commit - And Find A Real Relationship (2013) Wendy Walsh\n\n\nFormat: mobi/epub\nGenre: Self-Help/Relationships\nPrint Length: 272 pages\nRelease Date: 23 April 2013\n\nThere is no question the terrain has changed. We can do what we want and date who we want, but do we have the tools to navigate our hard-won sexual freedom? Now, from the dating doyenne of the Sex and the City generation comes a groundbreaking prescription for smart, savvy, slow-love. Dr. Wendy Walsh's outside-the-box approach to relationships turns traditional thinking on its head by using evolutionary psychology to offer advice that is both empowering and practical.\n\nIn The 30-Day Love Detox, Walsh offers a step-by-step, five-part attachment strategy with a 30-day 'detox' that helps weed out the bad boys and sets you up to meet the right guy, including:\n\nThe five sexual myths that keep women single\n\nWhen to say yes to s","torrent":{"xt":"urn:btih:561635da2fff4f179da8ab760b9499469b8a7a89","amp;dn":"Epub.mobile.books.28.05.2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"561635da2fff4f179da8ab760b9499469b8a7a89","infoHashBuffer":{"type":"Buffer","data":[86,22,53,218,47,255,79,23,157,168,171,118,11,148,153,70,155,138,122,137]},"announce":[],"urlList":[]}}