{"title":"HISTORY OF POP AND ROCK MUSIC - part 275","uid":5971598,"size":1046365874,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:56ab163e0dd600a6a997242abea52c680939644f&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+275&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zlatkopupovac","files":-1,"time":1290306274,"description":"                        PART  257\n\n\n          SANTANA  -  Evil Ways  (1969)  - Woodstock\n          SANTANA  -  Soul Sacrifice  (1969)  - Woodstock \n          SANTANA  -  Jingo  (1970)\n          SANTANA  -  Incident at Neshabur  (1970)\n          SANTANA  -  Samba Pa Ti  ( 1970)    \n          SANTANA  -  Jungle Strut (1971)\n          SANTANA  -  Black Magic Woman &amp; Gypsy Queen (1971)\n                     \n\n\n    &quot;Evil Ways&quot; is a song by Santana from their 1969 album &quot;Santana&quot;.Released as a single in late 1969, it became the band's first top forty and top ten hit in the U.S., peaking at number nine on the Billboard Hot 100 singles chart. Gregg Rolie performs the lead vocals and plays a Hammond organ solo in the middle section.&quot;Evil Ways&quot; is about a girl who is spiteful. &quot;You've got to change your evil ways, baby/Before I stop lovin' you.&quot; She tries to make her boyfriend jealous by associating with her friends. &quot;You hangin' 'round, baby/With Jean and Joan and-a who-knows-who.&quot;\n    &quot;Soul Sacrifice&quot; is an instrumental song by Santana. It was played by Santana at the 1969 Woodstock Festival. It was filmed and later released as a part of the iconic &quot;Woodstock&quot; documentary. The 1969 performance of &quot;Soul Sacrifice&quot; at Woodstock is best remembered for Michael Shrieve's elaborate drum solo; Shrieve's name has become synonymous with the early days of Santana and their performance at Woodstock. A studio version is included on their 1969 self titled debut album.\n    &quot;Jin-go-lo-ba&quot; (or Jingo) is a song by Nigerian percussionist Babatunde Olatunji. The song has been covered by Santana on their first album (1969),    \n    &quot;Incident at Neshabur&quot; is a song by Santana from their album &quot;Abraxas&quot; . It is the second studio album by Santana. Released in September 1970, the album's mix of rock, blues, jazz, salsa and other influences made it a classic that defined Santana's early sound, and showed a musical maturation from their first album.Often considered Santana's greatest album, it drew widespread acclaim for its mixture of Latin influences with familiar rock themes such as overdriven electric guitar, organ and heavy drums. The album also demonstrates Santana's stylistic versatility, including tracks such as &quot;Samba Pa Ti&quot; (a classic slow-burning, seductive piece) and &quot;Incident at Neshabur&quot;, both being instrumentals. \n    &quot;Samba Pa Ti (instrumental)  is a music piece from Carlos Santana's 1970 album &quot;Abraxas&quot; &quot;Samba Pa Ti&quot; translated into English means &quot;Samba for You&quot;.This instrumental was covered by JosÃƒÂ© Feliciano, who added lyrics.\n    &quot;Black Magic Woman&quot; is a song written by Peter Green that first appeared as a Fleetwood Mac single in various countries in 1968. It became a classic hit by Santana and sung by Gregg Rolie in 1970, reaching #4 in the U.S. and Canadian charts, after appearing on their &quot;Abraxas&quot; album, becoming more closely associated with Santana than Fleetwood Mac.The song became one of Santana's staples and one of their biggest hits. &quot;Abraxas&quot; reached #1 on the charts and hit quadruple platinum in 1986, partially thanks to &quot;Black Magic Woman.&quot; ","torrent":{"xt":"urn:btih:56ab163e0dd600a6a997242abea52c680939644f","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+275","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56ab163e0dd600a6a997242abea52c680939644f","infoHashBuffer":{"type":"Buffer","data":[86,171,22,62,13,214,0,166,169,151,36,42,190,165,44,104,9,57,100,79]},"announce":[],"urlList":[]}}