{"title":"Vitamins - Their Role in the Human Body{BBS}","uid":6663572,"size":8555403,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:56cf64d5c554565abf24f693903fc9e8556078f0&amp;dn=Vitamins+-+Their+Role+in+the+Human+Body%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1315605227,"description":"This single-source reference draws together the current knowledge of the vitamins' biological properties in the context of human nutrition. Vitamins are co-enzymes, antioxidants or precursors of hormones and are therefore involved in a great many biochemical and physiological processes. They play a vital role in the maintenance of health, and there is evidence that dietary sources of vitamins have beneficial effects in the prevention of heart-related diseases, bone diseases and possibly cancer.\n\n\n\nFollowing introductory chapters on historical and nutritional aspects of vitamins, the next four chapters cover relevant and detailed aspects of physiology and functional anatomy, biochemistry, immunology and the regulation of protein synthesis by nuclear hormone receptors. These background chapters, supported by a glossary of terms, provide the scientific principles upon which vitamin functions are based. The following thirteen chapters deal with each vitamin in turn. Subject areas include chemical structure, intestinal absorption, transport, metabolism, biochemical and physiological actions, immunoregulatory properties, deficiency-related diseases and potential toxicity. An extensive bibliography refers the reader to the original research literature.\n\n\n\nVitamins is aimed at nutritionists, biochemists, physiologists and physicians whether they be researchers, teachers or students. Food scientists, food technologists and many others working in the health professions will also find much of use and interest in the book. The inclusion of the theoretical principles in the background chapters makes the book an ideal starting point for those working outside the area who need a solid overview of the subject.\nBook Description\nThis important title looks in details at the role of vitamins in the human body and what actually happens to them once they have been ingested. The book covers nutritional, biochemical and physiological processes relevant to the biological action of vitamins and then individual chapters cover each major vitamin and vitamin group. A glossary and comprehensive index are included. The book is an invaluable source of reference for any scientist working in the field of vitamins.\nSee all Editorial Reviews\nProduct Details\n\n    * Hardcover: 448 pages\n    * Publisher: Wiley-Blackwell; 1 edition (November 29, 2004)\n    * Language: English\n    * ISBN-10: 0632064781\n    * ISBN-13: 978-0632064786","torrent":{"xt":"urn:btih:56cf64d5c554565abf24f693903fc9e8556078f0","amp;dn":"Vitamins+-+Their+Role+in+the+Human+Body%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56cf64d5c554565abf24f693903fc9e8556078f0","infoHashBuffer":{"type":"Buffer","data":[86,207,100,213,197,84,86,90,191,36,246,147,144,63,201,232,85,96,120,240]},"announce":[],"urlList":[]}}