{"title":"Stossel.2013.07.18.[Are We Rome].Fox Business.CF.avi","uid":8714384,"size":350203482,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:56e810358aebabb439c51e9d1353615499fed318&amp;dn=Stossel.2013.07.18.%5BAre+We+Rome%5D.Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"skJGZV6z","files":-1,"time":1374305378,"description":"----------\n\nSTOSSEL - [Are We Rome?] - Fox Business Network\n2013, July 18, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\nThis week my show comes from Las Vegas, Nevada, amidst FreedomFest, &quot;the world's largest gathering of free minds.&quot; Over a thousand libertarian-minded people debate the question: &quot;Are We Rome?&quot;\n\nMatt Kibbe, Freedomworks CEO, says America is following in the footsteps of Rome. Carl Richard, University of Louisiana History Professor, cites America's blatant disregard for the Constitution. Steve Forbes, Forbes Media Editor-in-Chief, believes that Americans are now more aware and involved, and things like the tea party movement may prevent us from collapsing like Rome.\n\nWelfare: Larry Reed, Foundation for Economic Education President, explains that Rome became a welfare state. Emperors tried bribe the angry masses by giving away free or subsidized grain, salt, pork and olive oil. Charles Murray of the American Enterprise Institute says why he wants to get rid of the entire Welfare bureaucracy.\n\nTaxes: In Rome, taxes steadily rose. Citizens who did not pay might be sold into slavery. Grover Norquist, Americans for Tax Reform President, says, &quot;Property taxes were so rough that people were actually abandoning their property.&quot; Steve Moore of the Wall Street Journal argues for a flat tax.\n\nInflation: Roman emperors devalued their currency by putting less silver in their coins. A bushel of wheat that once cost 8 Roman dollars cost 120,000 Roman dollars by the next century. Ben Powell, Independent Institute Senior Fellow and Jeffrey Tucker, Laissez Faire Books Executive Editor, make comparisons to the American dollar.\n\nSpectacle: Rome's rulers also bribed the people with &quot;bread and circuses.&quot; Kennesaw State University Economist, J.C. Bradbury, says that bribes continue in the form of subsidies for sports stadiums.\n\nIs America Rome? I don't think so. Rome's rulers were even more arrogant than ours:\n\nThe emperor Elagabalus set up a brothel in the palace.\n\nTiberius established an office of imperial pleasures, which gathered &quot;beautiful boys and girls from all corners of the world&quot; so, as Tacitus put it, the emperor &quot;could defile them&quot;.\n\nNero never wore the same clothes twice. And when he traveled, he traveled with 1,000 carriages.\n\nFree and prosperous is not the natural state of things. In human history, it's rare. With our debt, rising taxes, regulation, foreign wars, welfare state, and politicians' arrogant expansion of power, we become more like Rome.","torrent":{"xt":"urn:btih:56e810358aebabb439c51e9d1353615499fed318","amp;dn":"Stossel.2013.07.18.%5BAre+We+Rome%5D.Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56e810358aebabb439c51e9d1353615499fed318","infoHashBuffer":{"type":"Buffer","data":[86,232,16,53,138,235,171,180,57,197,30,157,19,83,97,84,153,254,211,24]},"announce":[],"urlList":[]}}