{"title":"Walter Brueggemann - The Prophetic Imagination (pdf)","uid":8201359,"size":2033965,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:58edac01e85f9aaa495d8aef3eb95adf07e0fb71&amp;dn=Walter+Brueggemann+-+The+Prophetic+Imagination+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmakate","files":-1,"time":1362023154,"description":"Walter Brueggemann - The Prophetic Imagination, Second Edition (Fortress, 2001). 151 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\nBy now this small book is a classic for anyone who believes in a radically countercultural Christianity committed to justice.\n\n&quot;If you only read one book this year, let it be The Prophetic Imagination by Walter Brueggemann ... We too live in a world characterized by the economics of affluence, the politics of oppression, the religion of immanence. Only prophetic passion, the passion and compassion of Jesus, can penetrate the numbness.&quot;\n\n--Irene Nowell, OSB. Benedictines\n\n\nIn this challenging and enlightening treatment, Brueggemann traces the lines from the radical vision of Moses to the solidification of royal power in Solomon to the prophetic critique of that power with a new vision of freedom in the prophets. Here he traces the broad sweep from Exodus to Kings to Jeremiah to Jesus. He highlights that the prophetic vision and not only embraces the pain of the people but creates an energy and amazement based on the new thing that God is doing. In this new edition, Brueggemann has completely revised the text, updated the notes, and added a new preface.\n\nAbout the Author\n\nWalter Brueggemann is William Marcellus McPheeters Professor of Old Testament at Columbia Theological Seminary, Decatur, Georgia. He is the author of more than thirty books and commentaries.","torrent":{"xt":"urn:btih:58edac01e85f9aaa495d8aef3eb95adf07e0fb71","amp;dn":"Walter+Brueggemann+-+The+Prophetic+Imagination+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58edac01e85f9aaa495d8aef3eb95adf07e0fb71","infoHashBuffer":{"type":"Buffer","data":[88,237,172,1,232,95,154,170,73,93,138,239,62,185,90,223,7,224,251,113]},"announce":[],"urlList":[]}}