{"title":"The Xcerts - In The Cold Wind We Smile -  2009","uid":4815252,"size":59132189,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5b8b74b6f435dc72aca78db806361df80b08809b&amp;dn=The+Xcerts+-+In+The+Cold+Wind+We+Smile+-++2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"aurez","files":-1,"time":1238519634,"description":"Aurez Release.\n\n\n320KBPS\n\nName \t                      &quot;In The Cold Wind We Smile&quot; \nLabel \t                      Xtra Mile \nRelease date                  30 March 2009\n\t\n\n\nTracks\n\nIn The Cold Wind We Smile\nHome Versus Home\nNightschool\nCool Ethan\nLost But Not Alone\nListen. Dont Panic\nCrisis In The Slow Lane\nDo You Feel Safe?\nJust Go Home\nAberdeen 1987\nI See Things Differently\nHidden Track \t\n\n\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Xcerts&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Xcerts&lt;/a&gt;\n\nInfo:\n\nThe Xcerts were originally formed by 13 year olds Murray Macleod and Jordan Smith after meeting in the headmasters room at their school in Aberdeen. After Ross joined on drums The Xcerts went on to record two EP's at the local recording studio Captain Tom's.\n\nAfter relocating to Brighton to progress as a band in 2006, The Xcerts parted ways with their old drummer Ross. A replacement was found in Tom Heron, originally from Exeter, who was living in Brighton with a mutual friend and had also become close friends with Murray and Jordan. With the newly formed trio created, the band began writing the songs that would start to spread the word of The Xcerts nationally.\n\nThe Xcerts then went on to release two singles through One Records in Glasgow. 'Breathtaking Fight', which was recorded at Ridge Farm with Ben Watkins, was then followed shortly after by 'My Book Laughs'. After the success of these two singles, the band were headhunted by Get Cape. Wear Cape. Fly frontman, Sam Duckworth, via MySpace who subsequently released two further singles - 'Just Go Home' and 'Do You Feel Safe?' - through his label, Mannequin Republic.\n\nRecorded at The Dog House by Adam Whittaker, 'Just Go Home' received regular airplay on MTV2, and the band recorded three acoustic tracks for MTV's 'Spanking New Sessions' series. The band have also recorded sessions for Tiscali, BBC Radio 1, BBC Radio Scotland, XFM Scotland and XFM London. Cover versions of Radiohead's 'All I Need' and The Pixies' 'Gigantic' featured in the XFM Scotland and XFM London sessions respectively.\n\n'Do You Feel Safe?' was recorded with Dave Eringa (Idlewild, Manic Street Preachers) and released in early 2008.\n\nThe Xcerts have toured with Get Cape. Wear Cape. Fly, Make Model, Fighting With Wire and Twin Atlantic, and performed at numerous festivals in 2008 including T in the Park, Rock Ness, Belladrum Tartan Heart Festival, Zoo8, Offset and Connect Music Festival.\n\nIn December 2008, The Xcerts completed a Scottish headline tour with support from Aberdeen band Right Hand Left.\n\nOn the 22nd January 2009, The Xcerts confirmed that their album, 'In The Cold Wind We Smile' will be released on the 23rd March 2009 through Xtra Mile (Reuben, Million Dead, Frank Turner) and King Tuts Recordings (The Dykeenies, Twin Atlantic). This date was however pushed back to the 30th. They also confirmed that they will release single 'Crisis In The Slow Lane' on the 9th of March at the end of their tour with Copy Haho.\n\nThe Xcerts debut album, In The Cold Wind We Smile, was released on 30 March 2009 through Xtra Mile. It was produced by Dave Eringa.\n\n\n","torrent":{"xt":"urn:btih:5b8b74b6f435dc72aca78db806361df80b08809b","amp;dn":"The+Xcerts+-+In+The+Cold+Wind+We+Smile+-++2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b8b74b6f435dc72aca78db806361df80b08809b","infoHashBuffer":{"type":"Buffer","data":[91,139,116,182,244,53,220,114,172,167,141,184,6,54,29,248,11,8,128,155]},"announce":[],"urlList":[]}}