{"title":"The 11th Hour (2007)","uid":6094220,"size":725922131,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5b8fe6497bdfc153e336f4a9c8021b774ed6b34c&amp;dn=The+11th+Hour+%282007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"remmerel","files":3,"time":1294695246,"description":"A look at the state of the global environment including visionary and practical solutions for restoring the planet's ecosystems. \n\nReview;\n\nKudos to Leonardo DiCaprio for putting his time and money into this outstanding documentary.\n\nLet's face it, any informed/intelligent/objective person already knows that we're on a greased path toward species extinction and that we must &quot;change course&quot;. &quot;The 11th Hour&quot; is an excellent vehicle for increasing the numbers of folks in that category (...and for reinforcing the knowledge base/commitment of those who think that that they &quot;already know this stuff&quot;).\n\n&quot;The 11th Hour&quot; goes way beyond simply pointing at problems. This wonderful documentary provides a fairly sharp focus on practical/viable solutions and serves up some inspiring/motivating ideas/insights.\n\nThe use of captivating cinematography and stunning images make for a powerful impact.\n\nI hope that the production company releases a book that details/documents the observations/assertions/conclusions of film's experts. Such a volume (if done well) would serve as an excellent part of any school curriculum.\n\nThe 11th hour is a must see if you...\n\n...care about whether or not there is a human race around in the next couple of hundred years.\n\n...care about the quality of life for your children and their children over the next 50 years.\n\n...are a young person who expects to be around for the next 60 to 80 years; then this is all about your future.\n\nAs one watches &quot;The 11th Hour&quot; it becomes painfully clear that it doesn't matter how rich or powerful one may be; there can be no escaping the inexorable consequences of the indefensibly insane/unsustainable global industrial/economic model; a model clearly based on little more than short term greed.\n\nAs effective/good as &quot;The 11th Hour&quot; is at conveying factual data in a way that holds your attention....it could have gone in a totally different direction.\n\nA dramatic feature film needs to be made that more fully captures/documents the emotional and existential impact of the consequences of current environmental policies: a kind of &quot;Erin Brockovitch&quot; of Global Warming/Climate Change. Clearly, this isn't the last word in this genre.\n\nThis is not a crisis that is &quot;out there&quot; in some vague future. Real people's lives are being destroyed now. There are many millions of &quot;canaries in the coal mine&quot; of our biosphere for whom climate change is life and death issue in the near term.\n\nBottom lines: &quot;The 11th Hour&quot; is a powerful documentary that manages to alarm without fear mongering and to paint a bleakly honest picture without engendering hopelessness.\n\nGo see/support this movie. The last half hour alone (which deals very positively with aspects of the political dimension) is worth the price of admission.\n\nIMDB: &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0492931/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0492931/&lt;/a&gt;","torrent":{"xt":"urn:btih:5b8fe6497bdfc153e336f4a9c8021b774ed6b34c","amp;dn":"The+11th+Hour+%282007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b8fe6497bdfc153e336f4a9c8021b774ed6b34c","infoHashBuffer":{"type":"Buffer","data":[91,143,230,73,123,223,193,83,227,54,244,169,200,2,27,119,78,214,179,76]},"announce":[],"urlList":[]}}