{"title":"Madonna - Everybody","uid":8788628,"size":52461704,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5bb8c00b96cb7c93d23c7e0cd7931b8152f89c22&amp;dn=Madonna+-+Everybody&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fiveofseven","files":1,"time":1375887031,"description":"(Quality is what it is. This rare video is a Web Rip)\n\nSire Records had marketed the &quot;Everybody&quot; single as if Madonna was a black artist. This misconception was cleared by the release of the music video for the song. Regarding the importance of shooting a music video for the song, Madonna commented that, &quot;If I didn't have a video, I don't think all the kids in the Midwest would know about me. It takes the place of touring. Everybody sees them everywhere. That really has a lot to do with the success of my album.&quot; She invited Sire Records executives, including Stein and Rosenblatt, to the New York nightclub Danceteria. She performed &quot;Everybody&quot; on the dancefloor, wearing a top hat and tails. On the night of the performance, Madonna's friend Haoui Montaug introduced her to the 300 strong audience. Cheered by them, Madonna and her dancers performed their choreographed dance moves, later described as a 'disco act backed by avant-garde dancers.' Seeing the performance, they also realised that Madonna appeared visually stunning. They ordered an in-house video of &quot;Everybody&quot; to be sent to the clubs around the country which used dance videos.\n\nRosenblatt contacted Ed Steinberg, who ran the Rock America video company and asked him if he could spare a few hours to make a music video for &quot;Everybody&quot; with Madonna on stage at her next performance in Danceteria. The idea was to play the video as promotion across the United States so that people will come to recognize an image of Madonna and her performance. Rosenblatt offered Steinberg $1,000 for the in-house production video, when artists like Duran Duran and Michael Jackson were spending six figure sums on videos. They finally agreed on $1,500. With the low-budget, the video was directed by Steinberg. Steinberg suggested shooting the video on location at the Paradise Garage, a downtown gay disco, instead of filming a live performance. Madonna's friend Debi Mazar did the makeup and joined her other backup dancers, namely Erika Belle and Bags Rilez. Mazar brought a few of her friends to act as a disco crowd in the video, including African-American graffiti artist Michael Stewart. Steinberg was impressed by Madonna's professionalism on the set and he helped to send copies of the tape to nightclubs across America which used dance music videos for their entertainment. This promotion helped the song to grow from being a dance hit in New York to a nationwide hit.\n\nThe video starts with Madonna and her two backup dancers dancing in a club while lights blink in the background. The shots continue while interspersing close-up shots of Madonna dancing while wearing a coat and junk jewelry. Author Douglas Kellner in his book Media Culture: Cultural Studies, Identity, and Politics Between the Modern and the Postmodern noted that already with her first video, Madonna was deploying fashion, sexuality and the construction of an individual image to present herself both as an alluring sex object and as a transgressor of established norms. The band Fab Five Freddy reminisce that with the video Madonna &quot;is attracting those who were more street, more savvy, more flavorful.&quot;\n\n\n\nFile Name:\nMadonna Everybody (edit)\n\nFile Format:\nmp4\n\nDuration:\n00:04:53\n\nBit Rate:\n1428k\n\nFile Size:\n50.03 MB\n\nVideo Codec:\nh264\n\nVideo Bitrate:\n1299k\n\nVideo Size:\n720x400\n\nAspect Ratio:\n1.80:1\n\nFrame Rate:\n29.97fps\n\nAudio Codec:\nmp3\n\nAudio Bitrate:\n128k\n\nChannels:\n2\n\nSample Rate:\n48000","torrent":{"xt":"urn:btih:5bb8c00b96cb7c93d23c7e0cd7931b8152f89c22","amp;dn":"Madonna+-+Everybody","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5bb8c00b96cb7c93d23c7e0cd7931b8152f89c22","infoHashBuffer":{"type":"Buffer","data":[91,184,192,11,150,203,124,147,210,60,126,12,215,147,27,129,82,248,156,34]},"announce":[],"urlList":[]}}