{"title":"Ben Weaver - Stories Under Nails [2004][EAC,log,cue. FLAC]","uid":8857236,"size":377916053,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5c123abe7b87dc6b62a1dd048be3825f77baa876&amp;dn=Ben+Weaver+-+Stories+Under+Nails+%5B2004%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"dickspic","files":15,"time":1377691078,"description":"Artist:Ben Weaver\nRelease:Stories Under Nails\nReleased: 2004\nLabel: Fargo Records\nCatalog#: FA20437\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: Europe\nStyle:Folk rock\n\n\n1\t Grieve All You Want\t4:23\t\n2\t Voice In The Wilderness\t5:40\t\n3\t Old Mission\t6:17\t\n4\t Sway With Me\t7:52\t\n5\t John Martin\t4:19\t\n6\t Cold House\t3:51\t\n7\t Like A Wound\t5:40\t\n8\t 40 Watt Bulb\t4:47\t\n9\t Handed Down\t5:00\t\n10\t Old Mule\t5:17\t\n11\t Broken By 2\t3:18\t\n12\t Ragged Words\t3:21\n\nBen Weaver appears to be from the eerier side of traditional or &quot;mountain&quot; music. Sounding like Steve Earle or Blanche with a bit of a hangover, Weaver gives a fine performance on the introductory &quot;Grieve All You Want,&quot; a rather simple but quite alluring piece of music that slowly builds as he neither sings nor speaks the lyrics, rather doing some semblance of the two. He moves into a relaxing country mold on &quot;Voice in the Wilderness,&quot; with his drawl selling the tune as well as the solid sway-inducing arrangement, ambling at a traditional country pace. Fans of groups like the Guthries would lap this music up immediately. &quot;Old Mission&quot; is a cross between Tom Waits and the Handsome Family, as Weaver is backed by guitar and a pedal steel that is heard at just the right times. Although the song itself is mundane, the singer pens some fabulous lines, especially &quot;Got pitchfork dreams and typewriter prayers/The wind catches and turns the spades of your windmill heart.&quot; The despair is only matched, if not surpassed, by the quality of the song. &quot;Sway With Me&quot; has a barroom feel thanks to the piano opening and the almost Dylan circa Time Out of Mind approach, instruments off in distance but still vital to the number. One aspect of the album is how Weaver is deliberate with each song, as some easily surpass five, six, or even seven minutes. The first minor miscue is the spoken word narrative entitled &quot;John Martin,&quot; as Weaver comes across more as a whiskey-soaked jazz singer than alt. country hero. A gem is &quot;Like a Wound,&quot; a song possessing the world-weary vocal, the dreary arrangement, and the joyful despair that it evokes in the listener. It's perhaps the best song Wilco never had a chance to perform. The organ-laced midtempo &quot;Handed Down&quot; is another strong song, reeking again of the alt. country or Americana flavor, with some of Weaver's best lyrics and singing. Townes Van Zandt can also be heard as an influence on the dark and crawling &quot;Old Mule.&quot; A troubadour to a fault, Weaver offers more of a contemporary folk mold with pop hues on &quot;Broken By 2,&quot; perhaps the lone radio-friendly track.","torrent":{"xt":"urn:btih:5c123abe7b87dc6b62a1dd048be3825f77baa876","amp;dn":"Ben+Weaver+-+Stories+Under+Nails+%5B2004%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c123abe7b87dc6b62a1dd048be3825f77baa876","infoHashBuffer":{"type":"Buffer","data":[92,18,58,190,123,135,220,107,98,161,221,4,139,227,130,95,119,186,168,118]},"announce":[],"urlList":[]}}