{"title":"ThinkFast V3.16","uid":3883666,"size":1018199,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5c23e3c36791427b3d795843de7ac9558c082867&amp;dn=ThinkFast+V3.16&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"avatar2012","files":1,"time":1194791131,"description":"ThinkFASTTM is an interactive software package that was designed to improve the mental functioning of adults, but the simplicity and nature of the exercises make it an excellent for strengthening key cognitive areas for children as well.  We have used ThinkFast for with our son for over two years and continue to use it on a regular basis with good results - in fact, our whole family plays this game! \n\nThinkFast exercises your brain to promote mental fitness. Then it analyzes your performance in a number of key areas and tells you which of your cognitive mechanisms are functioning well and which ones could use a little help. It suggests strategies to help improve your performance, then it tracks your progress. The harder you push, the more ThinkFAST challenges you.\n\nThinkFast consists of six games that give your brain a real workout and improve your performance like no other mental task because they automatically adjust their level of difficulty as you play.  It tracks your performance and displays it after every session: \n\n\n\nThinkFast consists of the following six games:\n\nGame 1 -- Physical Reflexes. Tests reaction time to a random stimulus. \nGame 2 -- Perceptual Reflexes. Tests alertness and visual acuity. \nGame 3 -- Cognitive Reflexes. Tests how quickly and accurately you can decide.  Strengthens up, down, left and right directional skill and bilateral hand coordination.  \nGame 4 -- Working Memory. Challenges your brain to compare information held in short-term memory with past experiences.  Must match words to pictures - sometimes must give opposite answer. \nGame 5 -- Tests your perceptual acuity, alertness and attention. Strengthens peripheral vision and patience. \nGame 6 -- Subliminal Awareness. Tests your ability to discern very brief, subtle stimuli.  Great for building short-term memory.  Must memorize rapidly disappearing letters or shapes.  \n\n*Zipped Installer with registration\n","torrent":{"xt":"urn:btih:5c23e3c36791427b3d795843de7ac9558c082867","amp;dn":"ThinkFast+V3.16","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c23e3c36791427b3d795843de7ac9558c082867","infoHashBuffer":{"type":"Buffer","data":[92,35,227,195,103,145,66,123,61,121,88,67,222,122,201,85,140,8,40,103]},"announce":[],"urlList":[]}}