{"title":"Demise.Rise.Of.The.Kutan.ShareReactor.rar","uid":3361423,"size":341650032,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5cce50e4c25ffcca76b6a85fc7ebf9a418c6cda1&amp;dn=Demise.Rise.Of.The.Kutan.ShareReactor.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ElectroEnceFaloGraficum","files":1,"time":1122400857,"description":"Game Description::\n\nWelcome to Demise: Rise of the Ku'tan! \nIn this world magic exists, mythical creatures roam the lands, and heroes of the past, present, and future, are created. \n\nFor years, I have enjoyed a wide variety of role-playing games on the PC platform, but always had the ambition and intent to create my own.  What you are about to begin is the result of that creation - based on new ideas, general concepts, and the creation of a large-scale system that is playable for hundreds of hours. Demise is the first game of its type to hit the Windows market.  I wish to thank all of those who helped make Demise what it is -- especially the testers that provided valuable feedback during the development of the game.  In the end, it was the players that shaped Demise to be what it is. \n\nBased on 'role-playing' with a fantasy setting where you create your own characters and take their roles in an 'alternate reality', the Demise On Line Information System has been written as to give you only the information you will need to start the game.  Demise is very large and can be explored for hundreds of hours by multiple characters that you have the ability to create, shape, and command as you see fit.  Once you start playing, you will realize just how little you really know about the world of Demise -- and how much there is for you to discover! \n\nOnce you're ready, you can embark even further into the game playing experience by talking, trading, and exploring with other people over the Internet.  This is the most exciting aspect of Demise, next to the customization features that allow players to create their own worlds. \n\nI recommend that you read the entire On-Line Information System thoroughly before playing the game.  As you become accustomed to the game, you will learn which sections contain the bits of information you will need from this On-Line Information System, so don't worry about all of the information - just suck in as much as you can and go for it! \n\nThe game may appear to be complex to the beginner, but don't be concerned - just dig in and enjoy!  It's an adventure! \n\nThank you very much for your interest and I hope you enjoy the game!  \n\n\nInstallation Description::\n\n1) Unpack the RAR-file\n2) Mount or burn the image (.img-file) using your fasvorite software\n3) Install the game.\n4) Install -&gt; DEMISEPatch1.00r3.1.EXE &lt;-\n5) Copy demise.exe &amp; demise.dll to the root over the install. Should overwrite only demise.exe \n\nEnjoy this great Dungeoncrawl/Dungeonhack, If you like these games, this will bring you countless hours of gameplay","torrent":{"xt":"urn:btih:5cce50e4c25ffcca76b6a85fc7ebf9a418c6cda1","amp;dn":"Demise.Rise.Of.The.Kutan.ShareReactor.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5cce50e4c25ffcca76b6a85fc7ebf9a418c6cda1","infoHashBuffer":{"type":"Buffer","data":[92,206,80,228,194,95,252,202,118,182,168,95,199,235,249,164,24,198,205,161]},"announce":[],"urlList":[]}}