{"title":"Save Me from Myself How I Found God, Quit Korn, Kicked Drugs, an","uid":4825489,"size":2865773,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5d0f4ccce1c7b245d8cf2584d718bb9a38b56307&amp;dn=Save+Me+from+Myself+How+I+Found+God%2C+Quit+Korn%2C+Kicked+Drugs%2C+an&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dodgerblue","files":1,"time":1238931916,"description":"Save Me from Myself: How I Found God, Quit Korn, Kicked Drugs, and Lived to Tell My Story EBOOK\n[IMG]http://i269.photobucket.com/albums/jj44/downarchive2/member2/000c2568.jpg[/IMG]\nSave Me from Myself: How I Found God, Quit Korn, Kicked Drugs, and Lived to Tell My Story\nHarperOne | 2008-07-01 | ISBN: 0061431648 | 240 pages | PDF | 2,7 MB\n\nThe incredible story of a controversial rock star, his secret addiction to methamphetamines, and his miraculous salvation through Jesus Christ. Candid and inspiring, Save Me from Myself is a rock 'n' roll journey unlike any other.\n\n&quot;Being a skeptic, when reading a book like this I am always wondering in the back of my mind how much of the story is sensationalized to make the story sound good. This is not the case in this book. This book is real, truthful, sometimes sad and most importantly written from the heart. It is fascinating. This is a very in depth look at the life of Brian Welch from his childhood days and family life growing up through his days as a rock star battling his addictions to drugs, alcohol, sex, pornography, anger and the love of money. The book also details about how drugs and his behavior destroyed the relationship with Rebekah, his girlfriend and the mother of his child. This is a great book to explain the mental and physical patterns of addictions. After failing to quit drugs time after time after time it was a true and authentic relationship with God that saved him from all these addictions.\n\nIn short this book showed me (and will show you) that if this guy can overcome his shortfalls and demons (and as you will read there are many)that there is hope for the rest of us all.&quot; - reader's review.\n","torrent":{"xt":"urn:btih:5d0f4ccce1c7b245d8cf2584d718bb9a38b56307","amp;dn":"Save+Me+from+Myself+How+I+Found+God%2C+Quit+Korn%2C+Kicked+Drugs%2C+an","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d0f4ccce1c7b245d8cf2584d718bb9a38b56307","infoHashBuffer":{"type":"Buffer","data":[93,15,76,204,225,199,178,69,216,207,37,132,215,24,187,154,56,181,99,7]},"announce":[],"urlList":[]}}