{"title":"Aid on the Edge of Chaos - Ben Ramalingam [Epub &amp; Mobi] [Sto","uid":9825932,"size":13055500,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5dea4535e9953f230fd097e8304df7f8daeb5d1e&amp;dn=Aid+on+the+Edge+of+Chaos+-+Ben+Ramalingam+%5BEpub+%26amp%3B+Mobi%5D+%5BSto&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"krystine","files":-1,"time":1395777478,"description":"Description\nAid on the Edge of Chaos: Rethinking International Cooperation in a Complex World\nAuthor: Ben Ramalingam\nPublished: 2013\nPublisher: OUP Oxford\nISBN: 9780199578023\nFormat: Retail Epub and Mobi\nReader Required:\nEpub- Adobe Digital Editions, Calibre, MoonReader for Android\nMobi- Kindle app, Calibre, MoonReader for Android\n\nTested on the above readers with no problems on laptop and Android tablet. \nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. \nPlease allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nEnjoy! \n\nIt is widely recognised that the foreign aid system - which today involves every country in the world - is in need of drastic change. But there are conflicting opinions as to what is needed. Some call for dramatic increases in resources, to meet long-overdue commitments, and to scale up what is already being done around the world. Others point to the flaws in aid, and bang the drum for cutting it altogether - and argue that the fate of poor and vulnerable people be best placed in \nthe hands of markets and the private sector. Meanwhile, growing numbers are suggesting that what is most needed is the creative, innovative transformation of how aid works. Aid on the Edge of Chaos is firmly in the third of these camps. \n\nIn this ground-breaking book, Ben Ramalingam shows that the linear, mechanistic models and assumptions on which foreign aid is built would be more at home in early twentieth century factory floors than in the dynamic, complex world we face today. All around us, we can see the costs and limitations of dealing economies and societies as if they are analogous to machines. The reality is that such social systems have far more in common with ecosystems: they are complex, dynamic, diverse and \nunpredictable. \n\nMany thinkers and practitioners in science, economics, business, and public policy have started to embrace more 'ecologically literate' approaches to guide both thinking and action, informed by ideas from the 'new science' of complex adaptive systems. Inspired by these efforts, there is an emerging network of aid practitioners, researchers, and policy makers who are experimenting with complexity-informed responses to development and humanitarian challenges. \n\nThis book showcases the insights, experiences, and often remarkable results from these efforts. From transforming approaches to child malnutrition, to rethinking processes of economic growth, from building peace to combating desertification, from rural Vietnam to urban Kenya, Aid on the Edge of Chaos shows how embracing the ideas of complex systems thinking can help make foreign aid more relevant, more appropriate, more innovative, and more catalytic. Ramalingam argues that taking on \nthese ideas will be a vital part of the transformation of aid, from a post-WW2 mechanism of resource transfer, to a truly innovative and dynamic form of global cooperation fit for the twenty-first century.","torrent":{"xt":"urn:btih:5dea4535e9953f230fd097e8304df7f8daeb5d1e","amp;dn":"Aid+on+the+Edge+of+Chaos+-+Ben+Ramalingam+%5BEpub+%26amp%3B+Mobi%5D+%5BSto","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5dea4535e9953f230fd097e8304df7f8daeb5d1e","infoHashBuffer":{"type":"Buffer","data":[93,234,69,53,233,149,63,35,15,208,151,232,48,77,247,248,218,235,93,30]},"announce":[],"urlList":[]}}