{"title":"Sexuality: A Psychosocial Manifesto by Katherine Johnson","uid":14469267,"size":537246,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5e6af3acf6dd01d8d96b0454ab29c5a2a0c605b3&amp;dn=Sexuality%3A+A+Psychosocial+Manifesto+by+Katherine+Johnson&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Dr.Soc","files":1,"time":1461887213,"description":"Sexuality: A Psychosocial Manifesto by Katherine Johnson\r\nEnglish | 2015 | ISBN: 0745641326, 0745641318 | 200 pages | EPUB | 0.5 MB\r\n\r\nThe contemporary study of sexuality too often finds itself at an impasse, conceptualizing sexuality either psychologically or sociologically: sexologists and psychologists have tended to point to the biological origins of sexuality underpinned by hormones, drives and, most recently, genetics; in contrast, historians and sociologists point to the social field as the defining force that shapes the meanings given to sexuality and sexual experience.\r\n\r\nConfronting the limitations and challenges this impasse poses, Katherine Johnson argues for a psychosocial approach that rethinks the relationship between psychic and social realms in the field of sexuality, without reducing it to either. Weaving through an expanse of theoretical and empirical examples drawn from sociology, psychology, queer and cultural studies, she produces an innovative, transdisciplinary perspective on sexual identities, subjectivities and politics that makes an original contribution to key debates ranging from identity politics and gay marriage, to mental health ‘risks’ and queer youth suicide.\r\n\r\nEmbracing ideas from developmental psychology, social constructionist sociology, social and critical psychology, psychoanalysis and queer theory, this original book will be necessary reading for students and scholars of sexuality across the social sciences","torrent":{"xt":"urn:btih:5e6af3acf6dd01d8d96b0454ab29c5a2a0c605b3","amp;dn":"Sexuality%3A+A+Psychosocial+Manifesto+by+Katherine+Johnson","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e6af3acf6dd01d8d96b0454ab29c5a2a0c605b3","infoHashBuffer":{"type":"Buffer","data":[94,106,243,172,246,221,1,216,217,107,4,84,171,41,197,162,160,198,5,179]},"announce":[],"urlList":[]}}