{"title":"Upset - She's Gone (2013) [FLAC]","uid":9121940,"size":220339397,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5f87924f19ffcd95ddfe7e104e08dcbe0b3d4607&amp;dn=Upset+-+She%27s+Gone+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1383150862,"description":"\n  Upset - She's Gone (2013) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Indie Pop, Noise Pop, Punk-Pop\n  Source: Scene CD\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 Back to School\n  02 She's Gone\n  03 Oxfords and Wingtips\n  04 Queen Frosteen\n  05 About Me\n  06 Game Over\n  07 Don't Lose Your Dinosaur\n  08 Never Wanna\n  09 Let It Go\n  10 Tobacco\n  11 Phone Calls\n  12 You and I\n\n  Upset is a supergroup of noise pop supporting players with Jenn Price of La Sera on lead guitar, Hole's Patty Schemel on drums, and writing the songs and singing is Ali Koehler, who served time in both the Vivian Girls and Best Coast. Unlike many times when the background cast takes the lead and you realize there was a reason they weren't out front, Koehler is ready for her close-up and the group's debut album, She's Gone, is a chewy punk-pop treat. Her songs are super catchy, snappy, and sweet, backed by punk-pop that's a bit noisy but never overpoweringly so. The production by Swearin's Kyle Gilbride is clean and punchy, Schemel's drums are powerful, and Price's lead lines are economical and add some nice counterpoint to Koehler's simple melodies. Simple, but not silly. More like bubblegum sticky with songs about the first day of school, ice queens, dinosaurs, and shoes to go along with the usual punk-pop tales of romantic trial and tribulation. \n\n  Koehler's not breaking any new ground here, but her lyrics are good enough, never embarrassing or trite. Her unschooled vocals sound just right singing them, and Price's harmonies are right on the money. When the trio (plus Gilbride on bass) really put the sound and song together, like on the steady rockin' &quot;She's Gone&quot; or the bouncy &quot;Never Wanna,&quot; they sound like a tightly wound Tiger Trap; when they slow it down a bit, like on the teary &quot;Phone Calls&quot; or &quot;About Me,&quot; they give the band the stupidly kicked Koehler out (Best Coast) a run for their money. Overall, it's an impressive debut that's sure to make fans of any of the bands the trio came from really happy. Even if you don't care or know about them, as long as you like noisy, poppy punk songs sung from a different perspective, She's Gone might just be something worth checking out.","torrent":{"xt":"urn:btih:5f87924f19ffcd95ddfe7e104e08dcbe0b3d4607","amp;dn":"Upset+-+She%27s+Gone+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f87924f19ffcd95ddfe7e104e08dcbe0b3d4607","infoHashBuffer":{"type":"Buffer","data":[95,135,146,79,25,255,205,149,221,254,126,16,78,8,220,190,11,61,70,7]},"announce":[],"urlList":[]}}