{"title":"The Appleseed Cast - Discography (1998-2013) [FLAC]","uid":9406867,"size":3382801595,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5fb411611a344d00e0f8d666601f0cb3fc6a36ff&amp;dn=The+Appleseed+Cast+-+Discography+%281998-2013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1388181062,"description":"\n  The Appleseed Cast - Discography (1998-2013) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Alternative, Emo, Indie Rock\n  Source: CD\n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  1998 The End of the Ring Wars\n  2000 Mare Vitalis\n  2001 Low Level Owl, Vol. 1\n  2001 Low Level Owl, Vol. 2\n  2002 Lost Songs\n  2003 Two Conversations\n  2006 Peregrine\n  2009 Sagarmatha\n  2011 Middle States EP\n  2013 Illumination Ritual\n\n  Lawrence, KS-based emo quartet Appleseed Cast were originally comprised of singer/guitarist Christopher Crisci, guitarist Aaron Pillar, bassist Jason Wickersheim, and drummer Louie Ruiz. Signing to Deep Elm, the group made its debut on the 1998 label sampler Records for the Working Class, releasing the full-length The End of the Ring Wars later that same year. In 1999 Appleseed Cast (now with new drummer Josh Baruth) released a new single, &quot;Skatter Ik Ignito,&quot; as well as a split EP with labelmates Planes Mistaken for Stars and Race Car Riot; Mare Vitalis followed in early 2000, heavily showcasing Baruth's complicated beats and the band's overall dense, atmospheric sound. Despite the hints of a new direction, the album couldn't have prepared fans for the two Low Level Owl albums released in 2001. Complex, delicate, and highly experimental, these two records took a cue from Radiohead's Kid A and sent the band careening into space rock and electronica with only traces of emo poking through. The records weren't nearly as commercially accepted, but their overall bravery showed that the band was prepared to make stylistic leaps.\n\n  The next year, Lost Songs brought four unreleased tracks from 1999 and five new songs together onto one album. Overdubbing new elements over the older songs, Appleseed Cast blended the tense emo of their early work and the broad experimentation of their new material. The band returned in 2003 with Two Conversations (Tiger Style), which continued to explore atmospheric texture in the framework of traditional rock &amp; roll. An extensive tour followed the LP's release. The band next went on a brief hiatus following Tiger Style's demise, but soon returned with renewed energy and a new label. Peregrine appeared in March 2006 on Militia Group before hitting the road with dates on both coasts. By this time, the band consisted of founding members Crisci and Pillar, along with bassist Marcus Young and drummer Nathan Richardson (ex-the Casket Lottery). Sagamartha arrived in 2009, and was followed up by some lineup changes as John Momberg joined the band while Young, who wanted to focus on school, left the band and was replaced by Nate Whitman. Later that year, the band signed on with Graveface Records, and in 2011 released their first recordings for the label, the EP Middle States. Yet more line up changes would ensue before the band released their next album, with Taylor Holenbeck coming on as guitarist and Nathan Wilder taking over on drums. With this lineup the group returned with sixth album Illumination Ritual in spring of 2013.","torrent":{"xt":"urn:btih:5fb411611a344d00e0f8d666601f0cb3fc6a36ff","amp;dn":"The+Appleseed+Cast+-+Discography+%281998-2013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5fb411611a344d00e0f8d666601f0cb3fc6a36ff","infoHashBuffer":{"type":"Buffer","data":[95,180,17,97,26,52,77,0,224,248,214,102,96,31,12,179,252,106,54,255]},"announce":[],"urlList":[]}}