{"title":"Breaking the Phalanx: A New Design for Landpower in the 21st Cen","uid":8794516,"size":28886034,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:601f145b7970e70bac9e484dec0daf0a0a35b503&amp;dn=Breaking+the+Phalanx%3A+A+New+Design+for+Landpower+in+the+21st+Cen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"JinRohEX","files":-1,"time":1376037992,"description":"Breaking the Phalanx: A New Design for Landpower in the 21st Century\nby Douglas A. Macgregor\n\nDESCRIPTION:\n\nThis work proposes the reorganization of America's ground forces on the strategic, operational and tactical levels. Central to the proposal is the simple thesis that the U.S. Army must take control of its future by exploiting the emerging revolution in military affairs. The analysis argues that a new Army warfighting organization will not only be more deployable and effective in Joint operations; reorganized information age ground forces will be significantly less expensive to operate, maintain, and modernize than the Army's current Cold War division-based organizations. And while ground forces must be equipped with the newest Institute weapons, new technology will not fulfill its promise of shaping the battlefield to American advantage if new devices are merely grafted on to old organizations that are not specifically designed to exploit them. It is not enough to rely on the infusion of new, expensive technology into the American defense establishment to preserve America's strategic dominance in the next century. The work makes it clear that planes, ships, and missiles cannot do the job of defending America's global security issues alone. The United States must opt for reform and reorganization of the nation's ground forces and avoid repeating Britain's historic mistake of always fielding an effective army just in time to avoid defeat, but too late to deter an aggressor.\n\nAmazon.com title link: &lt;a href=&quot;\nhttp://www.amazon.com/books/dp/0275957942&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/books/dp/0275957942&lt;/a&gt;","torrent":{"xt":"urn:btih:601f145b7970e70bac9e484dec0daf0a0a35b503","amp;dn":"Breaking+the+Phalanx%3A+A+New+Design+for+Landpower+in+the+21st+Cen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"601f145b7970e70bac9e484dec0daf0a0a35b503","infoHashBuffer":{"type":"Buffer","data":[96,31,20,91,121,112,231,11,172,158,72,77,236,13,175,10,10,53,181,3]},"announce":[],"urlList":[]}}