{"title":"Deadly Deceits: My 25 Years in the CIA ","uid":12399251,"size":938144,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:60941841bf5e511531c4066f510f224065618ab8&amp;dn=Deadly+Deceits%3A+My+25+Years+in+the+CIA+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Djofullinn","files":1,"time":1441993525,"description":"epub\n\nRalph W. McGehee spent 25 years in the CIA; he joined as an idealist, and left as a cynic. The crisis happened in Dec 1968. RWM wondered why we had to bomb the people we were trying to save? Why did the CIA report lies instead of the truth? He thought of his earlier work in Thailand, where his reports were first accepted, then denied in spite of his accuracy. The Agency preferred the old methods that resulted in more killings. RWM decided then to tell what he found out and warn the American people. The CIA is the covert action arm of the Presidency. It is not an intelligence agency because it only seeks the information that supports existing policies. Its propaganda uses disinformation to fool the US public, and justify policies by distorting reality.\n\nRWM was class president and in the honor society, and All State as a football tackler. An ardent Baptist, he went to Notre Dame and played on an undefeated football team that won national championships; he graduated cum laude. A telegram recruited him to fight communism and save our way of life. RWM went to Washington and passed the tests. The chapters in the book tell about his career in the agency. Chapter 5 tells of his &quot;Life at Langley&quot; when he returned to Headquarters. His knowledge of the Bay of Pigs came from television news. It seemed they relied too much on an assumed uprising of the Cuban people. Could such a mistake ever happen again? Pages 57-8 tells how the CIA promoted a bloody extermination campaign in Indonesia. (Read L Fletcher Prouty's book on this.) Page 59 tells of agency coups in South America. American training of the military and police created traitors who overthrew their governments; was this the definition of subversion?","torrent":{"xt":"urn:btih:60941841bf5e511531c4066f510f224065618ab8","amp;dn":"Deadly+Deceits%3A+My+25+Years+in+the+CIA+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60941841bf5e511531c4066f510f224065618ab8","infoHashBuffer":{"type":"Buffer","data":[96,148,24,65,191,94,81,21,49,196,6,111,81,15,34,64,101,97,138,184]},"announce":[],"urlList":[]}}