{"title":"Dead West [Graphic Novel]","uid":8590734,"size":83007007,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:61243764d04d3ae054d13c8edc0b5b6f568151e5&amp;dn=Dead+West+%5BGraphic+Novel%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"RobbieDee","files":-1,"time":1371636995,"description":"- Contains the Dead West graphic novel! Published by Gigantic Graphic Novels.\n\n**I dont own or take credit for any of the content contained in this torrent, all credit goes to the creator(s) of the comic.**\n\n\nDescription:\n\nDead West combines the best of two genres, zombie horror movies and westerns, to create an all-new manga adventure. During America's westward expansion, a small Indian village was wiped out to make way for the town of Lazarus. Only one Indian, a child, survived, and years later he returns to Lazarus to claim revenge, placing a curse on the town. Soon, the dead have risen from their graves and a mob of zombies is ransacking Lazarus. While the sheriff and cowboys fight the undead, a bounty hunter slips into town looking for a fugitive. Instead, he comes upon a pregnant whore and reluctantly becomes her protector against the zombie onslaught. The bounty hunter is a dangerous man and the sheriff and cowboys are armed to the teeth, but it may not be enough to stop the Indian's curse. \n\nFeaturing beautiful illustrations and sharp prose by the award-nominated duo of Rick Spears and Rob G. Dead West delivers high-impact heart-throbbing action.","torrent":{"xt":"urn:btih:61243764d04d3ae054d13c8edc0b5b6f568151e5","amp;dn":"Dead+West+%5BGraphic+Novel%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61243764d04d3ae054d13c8edc0b5b6f568151e5","infoHashBuffer":{"type":"Buffer","data":[97,36,55,100,208,77,58,224,84,209,60,142,220,11,91,111,86,129,81,229]},"announce":[],"urlList":[]}}