{"title":"(ebook - literate horror-porn) Revelation of the Beasts-B.D.Schl","uid":8801679,"size":6879084,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:61f3c3e85f66f76856a4450f3a687bbc00290993&amp;dn=%28ebook+-+literate+horror-porn%29+Revelation+of+the+Beasts-B.D.Schl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"grintuk","files":6,"time":1376218449,"description":"I wrote this book.\n\nHere's the flap-copy I've been using for the public:\n\nA bargain is struck and a game declared:\nOne-hundred twenty tales be told\nOf misadventures new &amp; old\n&amp; whence the World's woes unfold\n\nJUSTINE'S entire world is overturned the night she quits her food-taxi job and instead takes up a story-telling game with LUCIEN, the overbearing, darkly-sexual Promethean Immortal.\nTheir attraction is instantaneous and electric, and from their tryst comes a catalogue of deviance as the two unfold an epic encompassing the span of lives from the solitary miscreant to the morass of turpitude known as international politics. Through the medium of their game, the metaphor of the Beast is explored as the animal nature within, unclaimed by most and tragically misinterpreted by the figures in their tales.\nJustine's hold on reality will break and she will come to learn that many of the key figures in her life are intimately entangled in the curious web of his stories; wheels within wheels, she will realize that the whole world contains itself, and the two will discover each other in Tantric exploration of the universe.\nBut first, there's a whole lot of dirty, dirty work.\n\n\t&quot;Still, to this day, whenever he passes the cupboard wherein he keeps the jar containing his penis, he might pull the grisly trophy out and tap the sides of the glass, thinking that, like a fish in a tank, the vibrations might painfully disturb some sensitive membrane and thus irritate the bygone intruder.&quot; from Chapter Three\n\nWARNING - ADULT CONTENT","torrent":{"xt":"urn:btih:61f3c3e85f66f76856a4450f3a687bbc00290993","amp;dn":"%28ebook+-+literate+horror-porn%29+Revelation+of+the+Beasts-B.D.Schl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61f3c3e85f66f76856a4450f3a687bbc00290993","infoHashBuffer":{"type":"Buffer","data":[97,243,195,232,95,102,247,104,86,164,69,15,58,104,123,188,0,41,9,147]},"announce":[],"urlList":[]}}