{"title":"Lenny Kravitz - Are You Gonna Go My Way 320cbr 1993","uid":9371535,"size":112497108,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:628dfb26f7ef50fda1def318164b96af83e8f2c0&amp;dn=Lenny+Kravitz+-+Are+You+Gonna+Go+My+Way+320cbr+1993&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1387536744,"description":"Source: 1993 CD\n-\nLenny Kravitz - Are You Gonna Go My Way 320cbr (Big Papi) 1993 Funk Rock\n-\n\n\nOkay. This CD is a bit confusing. The CD is Virgin and dated 1993 and appears to be the USA version but I can't find any information on it. The review below is for the Import version. The CD back cover states Side 1 and Side 2 which is probably a tricky way to say this was originally planned for vinyl LP. Now the oddest thing is the CD states Copyright 1973 and I;m pretty sure Lenny was just a small boy in 1973 right below where it states Copyright 1995. - Big Papi\nimage\n\nBy L.A. Scene\nIn the mid 1990s, I heard a concert promotion radio ad that was basically introducing the performer to be &quot;The World's Greatest Rock and Roll Star&quot;. When they announced that star to be Lenny Kravitz, I must admit, I nearly drove off the road when I heard that. I had realized Kravitz had some commercial success and had a nice following, but &quot;World's Greatest Rock and Roll Star&quot;? - come on! However, now about a decade later, as I have begun to get a deeper appreciation for what Rock music has to offer, I now realize that perhaps there is some real merit to that radio ad. I'm still not ready to put Kravitz up there with the upper echelon of Rock with the Paul McCartneys, the Rolling Stones, Bruce Springsteens, or even Billy Joels - however, it is safe to say that Kravitz could easily be one of the great revelations of the 1990s. Kravitz established his potential on his debut album, &quot;Let Love Rule&quot;. On that album Kravitz utilized the &quot;Minneapolis Sound&quot; (similar to the style made famous by Prince) by incorporating a mix of Funk and Rock. By 1993, Kravitz was soon expanding his sound and his third album &quot;Are You Gonna Go My Way&quot; would help to take things to the next level. Kravitz also integrates his personal life experiences into this album.\n\nMany have said that this album provides an &quot;edge&quot; - much of this probably resulting from his failed marriage to Lisa Bonet. While I can see this, ultimately I feel that this album actually shows more of Kravitz's development as an artist as opposed to anger.\n\nHere is a song by song synopsis of the collection:\n\n&quot;Are You Gonna Go My Way&quot;: This song is all about Kravitz's guitar work as it is going to set a high level of intensity. However the percussion blends perfectly here as well. One underrated fact of this song is how Kravitz uses the spoken word &quot;What I really want to know is...&quot; right before the title of the song is sung &quot;Are You Gonna Go My Way&quot;.\n\n&quot;Believe&quot;: On this track, Kravitz extends his sound by introducing some an Indian sounding melody to open the track. However, I find the whole way Kravitz incorporates an orchestral sound with strings and horns an even stronger sign how he has grown as an artist.\n\n&quot;Come on and Love Me&quot;: The percussion and bass really set the pace for this tone. Kravitz perfectly layers his guitar work on this track. Some can argue this has a retro feel, but I think this is a case where retro can be considered modern.\n\n&quot;Heaven Help&quot;: Piano work is going to be the story here as it provides a retro styled R&amp;B melody to it. Another great point is how Kravitz demonstrates terrific vocal ranges here. Kravitz's words &quot;I'm ready for love&quot; are indicative of some of his post-divorce feelings following his failed marriage.\n\n&quot;Just Be a Woman&quot;: On this track, Kravitz now effectively utilizes the acoustic guitar combined with some terrific string arrangements. This song is probably reflective on Kravitz's failed marriage as he says &quot;You ask me...how can I make it right?&quot;\n\n&quot;Is There Any Love in Your Heart&quot;: Kravitz turns up the intensity with another hard-rocking sound here. While the title track has always gotten the attention, this track often gets overlooked. More reflections on his failed marriage surface here - not just in the song title, but in the lyrics such as &quot;Your whole life is a fantasy and I'm playing the clown&quot;. There is a terrific guitar bridge about 2/3 of the way into the song.\n\n&quot;Black Girl&quot;: This song has another R&amp;B feel to it. On the verses, the guitars are electric, but they take more of a complementary role to Kravitz's vocals. On this song I suddenly realized something about Lenny Kravitz, he has his own version of a falsetto. It isn't a Barry Gibb falsetto, but nonetheless it is a falsetto that can be effectively used. I also like how Kravitz &quot;switches&quot; gears about 2/5 into the song in terms of the rhythm of the song. There is another great guitar bridge on this song.\n\n&quot;My Love&quot;: This song goes all back to the guitar. In fact, this song almost has a stripped-down guitar feel to it. Possibly this goes back to more of Kravitz's feelings about his failed marriage as he uses this song to describe &quot;his love&quot;.\n\n&quot;Sugar&quot;: This song also has a retro-styled 1970s R&amp;B feel to it. I like how Kravitz mixes up his vocal ranges on this track. On this track I feel the String and horn arrangements also help build to the appeal of this song.\n\n&quot;Sister&quot;: This is the most underrated track on the collection and demonstrates how Kravitz has completed himself as an artist. The song opens with some terrific acoustic guitars. This is followed up by some electric guitars that &quot;fold&quot; into the melody beautifully. Finally some outstanding string arrangements are also layered on top of things. One of the great guitar solos in Kravitz's work is demonstrated on the middle of this track. While the guitar work is great, it ultimately is Kravtiz's passionate vocals that really hit home - particularly on the line &quot;If they knock on your door...&quot;\n\n&quot;Eleutheria&quot;: Very simply, this is a reggae-like track by Kravitz. While this wasn't my favorite track on the collection, it still demonstrates that Kravitz is not a one dimensional artist. It still is a track worth checking out.\n\nThe liner notes to this collection contain all of the lyrics as well as the musician credits. Overall, I think this is the album that really solidified Kravitz's status as an artist. This is truly the kind of &quot;third album&quot; I would expect from an artist on the rise. This is not only a collection Kravitz fans will enjoy, but great material for new fans to check out.","torrent":{"xt":"urn:btih:628dfb26f7ef50fda1def318164b96af83e8f2c0","amp;dn":"Lenny+Kravitz+-+Are+You+Gonna+Go+My+Way+320cbr+1993","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"628dfb26f7ef50fda1def318164b96af83e8f2c0","infoHashBuffer":{"type":"Buffer","data":[98,141,251,38,247,239,80,253,161,222,243,24,22,75,150,175,131,232,242,192]},"announce":[],"urlList":[]}}