{"title":"Flags of the American Civil War","uid":11763597,"size":17761942,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6389174169712d07448dedc67d91af6e6d10163a&amp;dn=Flags+of+the+American+Civil+War&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":4,"time":1426659687,"description":"Flags of the American Civil War 1: Confederate\n\nThe very heart of the Confederate fighting unit was its flag, which came in a variety of designs and colours. The flag was the rallying point on the field of battle and it marked the unit headquarters in camp. In 1865, at the war's conclusion, the furling of the defeated Confederate banners signalled the end of that episode in history. As the first of three books focusing on flags of the Civil War (1861-1865), Philip Katcher's text provides a detailed look into Confederate flags. Full colour illustrations and rare photographs portray the myriad variations of flags used to represent the seceding southern states.\n\n\n\nFlags of the American Civil War 2: Union\n\nThe regimental or battery set of colours was more than simply a unit designation, issued for the ease of a commander in identifying his units in the field. It was the very symbol of the regiment; it was its heart, the thing that drew its members together. As such it was fiercely defended in action, where it flew in the centre of the line. Complemented by numerous illustrations, including eight full page colour plates by Rick Scollins, this book by Philip Katcher provides a fascinating examination of the Union flags of the American Civil War (1861-1865)","torrent":{"xt":"urn:btih:6389174169712d07448dedc67d91af6e6d10163a","amp;dn":"Flags+of+the+American+Civil+War","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6389174169712d07448dedc67d91af6e6d10163a","infoHashBuffer":{"type":"Buffer","data":[99,137,23,65,105,113,45,7,68,141,237,198,125,145,175,110,109,16,22,58]},"announce":[],"urlList":[]}}