{"title":"El coche fantÃƒÂ¡stico 1x09 Fiebre nocturna[HDTV][Spanish].avi","uid":4980113,"size":361592832,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:64017d83cb28fafaad8167a0e0e97b905a679c58&amp;dn=El+coche+fant%C3%83%C2%A1stico+1x09+Fiebre+nocturna%5BHDTV%5D%5BSpanish%5D.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"webchella","files":1,"time":1246238437,"description":"Ficha\n\nTÃƒÂ­tulo original Knight Rider\nGÃƒÂ©nero AcciÃƒÂ³n\nPaÃƒÂ­s de origenEstados Unidos\nIdioma EspaÃƒÂ±ol\nTemporadas?\nEpisodios 17\nDia de emision30 de marzo 2009 en Scifi\n\nSinopsis\n\nSarah Graiman es una estudiante de 24 aÃƒÂ±os de la Universidad de Stanford, que trabaja para sacarse el doctorado siguiendo los pasos de su padre Charles (Davison). Pero cuando varios hombres intentan secuestrarla, Sarah recibe una misteriosa llamada de KITT advirtiÃƒÂ©ndola de que Charles, su creador y el responsable del KITT original, se encuentra en grave peligro.\n\nJunto a KITT, Sarah consigue encontrar a su mejor amigo de la niÃƒÂ±ez, Mike Tracer (Bruening), un ex-Ranger de 23 aÃƒÂ±os a quien Sarah no ha visto desde que dejÃƒÂ³ su hogar a los 18. Tras servir en Irak, Mike se encuentra hastiado, perdido y reticente a colaborar. Finalmente acepta seguir a Sarah, y los dos se embarcan un viaje para descubrir al responsable del intento de robo de KITT y encontrar a Charles. Durante el mismo, conoceremos a Carrie Rivai (Poitier), una ÃƒÂ¡gil pero dura agente del FBI unida a Charles y Sarah por una larga amistad que la empuja a ayudarles.\n\nSecuela de la serie clÃƒÂ¡sica de los 80 protagonizada por David Hasselhoff. En Febrero de 2008 se estrenÃƒÂ³ esta pelÃƒÂ­cula/piloto para televisiÃƒÂ³n para tantear las audiencias. Si NBC considera suficientes los ÃƒÂ­ndices de share de la cinta, lanzarÃƒÂ¡ en Septiembre de 2008 una serie completa con el mismo reparto y partiendo del mismo punto. En caso contrario, no habrÃƒÂ¡ otra serie, limitÃƒÂ¡ndose el regreso de &quot;El coche fantÃƒÂ¡stico&quot; a esta pelÃƒÂ­cula para TV\n\nReparto\n\nJustin Bruening, Deanna Russo, David Hasselhoff, Brake Silver, Sydney Tamiia Poitier, Bruce Davison, Greg Ellis, Chris Mulkey, Wayne Kasseman, Jonathan Chase, Assaf Cohen, Val Kilmer, Kevin Dunigan, Justin Schaefers, Jack Yang, Meggan Anderson\n\n\nInfo Ripeo\n\nCalidad del ripeo:HDTV DVB\nVideo: XviD\nFormato: AVI\nIdioma: EspaÃƒÂ±ol\nPeso: 350MB","torrent":{"xt":"urn:btih:64017d83cb28fafaad8167a0e0e97b905a679c58","amp;dn":"El+coche+fant%C3%83%C2%A1stico+1x09+Fiebre+nocturna%5BHDTV%5D%5BSpanish%5D.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64017d83cb28fafaad8167a0e0e97b905a679c58","infoHashBuffer":{"type":"Buffer","data":[100,1,125,131,203,40,250,250,173,129,103,160,224,233,123,144,90,103,156,88]},"announce":[],"urlList":[]}}