{"title":"Charlotte Gray - Sebastian Faulks  (Unabridged)","uid":6838158,"size":363141708,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:644d54b08f6c30078f36a1957004e13ea9386d87&amp;dn=Charlotte+Gray+-+Sebastian+Faulks++%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rosie1966","files":20,"time":1322076958,"description":"About The Book\nCharlotte Gray, a haunting story of love and war set in London and occupied France in 1942-3. Charlotte is a highly educated young Scottish woman from Edinburgh who falls passionately in love with an airman, Peter Gregory, emotionally scarred by his many close brushes with death. When he disappears on a mission to France, she follows him as a British secret courier, sent over to help support the Resistance. Having failed to find Gregory, she decides to stay on to do what she can for the France she has loved since childhood. She and the reader are drawn ever deeper into the lives of assimilated French Jews-- the children Andre and Jacob whose parents have already been sent to the death camps, and the Levades, father and son. Though ultimately powerless to help, Charlotte nevertheless learns a far deeper understanding of herself and her own family through them.\n\n\nAbout The Author\nSebastian Faulks was born in Donnington in Berkshire on April 20, 1953. He became a full-time writer in 1991, he worked as a journalist. His French trilogy - The Girl at the Lion d'Or, Birdsong and Charlotte Gray (1989-1997) - established him in the front rank of British novelists. UK sales of Birdsong exceed 2,500,000 copies, and for this novel he was named &quot;Author of the Year&quot; by the British Book Awards in 1995. It is regularly voted one of the nation's favourite books. Charlotte Gray has also sold over a million copies and was filmed with Cate Blanchett in the main part. Sebastian Faulks lives with his wife in London an was awarded the CBE in 2002. \n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:644d54b08f6c30078f36a1957004e13ea9386d87","amp;dn":"Charlotte+Gray+-+Sebastian+Faulks++%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"644d54b08f6c30078f36a1957004e13ea9386d87","infoHashBuffer":{"type":"Buffer","data":[100,77,84,176,143,108,48,7,143,54,161,149,112,4,225,62,169,56,109,135]},"announce":[],"urlList":[]}}