{"title":"The Cooked Seed: A Memoir","uid":8674710,"size":971873,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:649c4ee77ce4ca2b75bc8d89d13d81ad9be6bdc7&amp;dn=The+Cooked+Seed%3A+A+Memoir&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1373564126,"description":"Anchee Min, &quot;The Cooked Seed: A Memoir&quot;\nISBN: 1596916982 | 2013 | EPUB\n\nIn 1994, Anchee Min made her literary debut with a memoir of growing up in China during the violent trauma of the Cultural Revolution. Red Azalea became an international bestseller and propelled her career as a successful, critically acclaimed author. Twenty years later, Min returns to the story of her own life to give us the next chapter, an immigrant story that takes her from the shocking deprivations of her homeland to the sudden bounty of the promised land of America, without language, money, or a clear path.\n\nIt is a hard and lonely road. She teaches herself English by watching Sesame Street, keeps herself afloat working five jobs at once, lives in unheated rooms, suffers rape, collapses from exhaustion, marries poorly and divorces.But she also gives birth to her daughter, Lauryann, who will inspire her and finally root her in her new country. Min's eventual successes-her writing career, a daughter at Stanford, a second husband she loves-are remarkable, but it is her struggle throughout toward genuine selfhood that elevates this dramatic, classic immigrant story to something powerfully universal.","torrent":{"xt":"urn:btih:649c4ee77ce4ca2b75bc8d89d13d81ad9be6bdc7","amp;dn":"The+Cooked+Seed%3A+A+Memoir","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"649c4ee77ce4ca2b75bc8d89d13d81ad9be6bdc7","infoHashBuffer":{"type":"Buffer","data":[100,156,78,231,124,228,202,43,117,188,141,137,209,61,129,173,155,230,189,199]},"announce":[],"urlList":[]}}