{"title":"William Blake (Park South Art Ebook).pdf","uid":13393804,"size":21214145,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:64f01592a7ecf8cf3cbd3956305b96b532a69080&amp;dn=William+Blake+%28Park+South+Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":1,"time":1454361075,"description":"William Blake\r\nPark South Books | 1985 | ISBN: 0917923014 | English | 94 pages | PDF | 20.2 MB\r\n\r\nVisionary, dreamer, poet and mystic, Blake remains one of the most controversial figures in the history of art. His taste for Gothic decoration and early poetry accords with his antipathy to the rational: his inspiration derived from the visions that he claimed to see, which were predominantly religious in character. Born in 1757, he lived in London for most of his life. Early on he learned the crafts of printing and engraving. A marked distaste for authoritarianism had channelled him away from the official circles of the Royal Academy, and he resolved to disseminate his work himself. He wrote, illustrated and printed a series of fine books, of which perhaps the most famous are the Songs of Innocence and Songs of Experience. In his paintings, watercolors and engravings Blake returned again and again to the themes of the Old Testament: one of his most haunting images is of the mad king Nebuchadnezzar, and he made a great series of watercolors for The Book of job. He also illustrated Dante's Divine Comedy in the last few years before his death in 1827. William Vaughan outlines the life of this extraordinary man and shows how Blake's visionary sensibility expressed itself in a remarkable body of work. The singular characteristics of his art are well illustrated by the forty color plates","torrent":{"xt":"urn:btih:64f01592a7ecf8cf3cbd3956305b96b532a69080","amp;dn":"William+Blake+%28Park+South+Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64f01592a7ecf8cf3cbd3956305b96b532a69080","infoHashBuffer":{"type":"Buffer","data":[100,240,21,146,167,236,248,207,60,189,57,86,48,91,150,181,50,166,144,128]},"announce":[],"urlList":[]}}