{"title":"The First Crash: Lessons from the South Sea Bubble","uid":10262161,"size":4900021,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:651d6dc5de3b16d40bdf8f81f09e8f90a636320e&amp;dn=The+First+Crash%3A+Lessons+from+the+South+Sea+Bubble&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Djofullinn","files":-1,"time":1401477429,"description":"Richard Dale, &quot;The First Crash: Lessons from the South Sea Bubble&quot;\nISBN: 0691119716 | 2004 | EPUB | 211 pages | 5 MB\n\nFor nearly three centuries the spectacular rise and fall of the South Sea Company has gripped the public imagination as the most graphic warning to investors of the dangers of unbridled speculation. Yet history repeats itself and the same elemental forces that drove up the price of South Sea shares to dizzying heights in 1720 have in recent years produced the global crash of 1987, the Japanese stock market bubble of the 1980s/90s, and the international dot.com boom of the 1990s.\n\nThe First Crash throws light on the current debate about investor rationality by re-examining the story of the South Sea Bubble from the standpoint of investors and commentators during and preceding the fateful Bubble year. In absorbing prose, Richard Dale describes the trading techniques of London's Exchange Alley (which included 'modern' transactions such as derivatives) and uses new data, as well as the hitherto neglected writings of a brilliant contemporary financial analyst, to show how investors lost their bearings during the Bubble period in much the same way as during the dot.com boom.\n\nThe events of 1720, as presented here, offer insights into the nature of financial markets that, being independent of place and time, deserve to be considered by today's investors everywhere. This book is therefore aimed at all those with an interest in the behavior of stock markets.\n","torrent":{"xt":"urn:btih:651d6dc5de3b16d40bdf8f81f09e8f90a636320e","amp;dn":"The+First+Crash%3A+Lessons+from+the+South+Sea+Bubble","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"651d6dc5de3b16d40bdf8f81f09e8f90a636320e","infoHashBuffer":{"type":"Buffer","data":[101,29,109,197,222,59,22,212,11,223,143,129,240,158,143,144,166,54,50,14]},"announce":[],"urlList":[]}}