{"title":"Linda Martell - Color Me Country (1970) MP3@320","uid":10113686,"size":65771040,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6692e945f4e40ca2d329757383b66b391785a1d7&amp;dn=Linda+Martell+-+Color+Me+Country+%281970%29+MP3%40320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":12,"time":1399509193,"description":"Linda Martell, born Thelma Bynem (June 4, 1941), is an American rhythm and blues and country music singer. In August 1969, she became the first African-American woman to perform at the Grand Ole Opry.\n\n\nThis LP (Plantation PLP-9), which emerged in 1970, was the only album released covering the music of Country vocalist Linda Martell. Born Thelma Bynem in Leesville, South Carolina on June 4, 1941, she holds the distinction of being the first female Black vocalist to appear on the Grand Ole Opry. That took place one night in late August 1969 while her first hit, Color Him Father, a cover of the # 7 Billboard Pop Hot 100 by The Winstons, was on its way to # 22 Country on Shelby Singleton's label Plantation 24 (a Sun records subsidiary) b/w I Almost Called Your Name.\n\nBack in 1962, she had appeared on record for the first time billed as Linda Martell &amp; The Anglos singing the decidedly un-country The Things I Do For You/A Little Tear (Was Falling From My Eyes) on Fire 512, one of several labels owned by Bobby Robinson. After switching gears from R&amp;R/R&amp;B to Country at live engagements, she was spotted by Singleton who signed her to Plantation in 1969, with the above-mention Color Him Father being her first release.\n\nBy the end of the year her second single, Before The Next Teardrop Falls, a cover of a 1968 # 44 Country by Duane Dee, was heading for a # 33 Country peak in January 1970 on Plantation 35 b/w Tender Leaves Of Love (in 1975, Freddy Fender's cover of Before The Next Teardrop Falls made it to # 1). In April 1970 Linda had her third (and last) hit when Bad Case Of The Blues leveled off at # 58 on Plantation 46 b/w Old Letter Song. In 1971, her cover of the 1969 Connie Francis # 33 Country/# 91 Billboard Pop Hot 100 The Wedding Cake b/w You're Crying Boy, Crying failed as Plantation 67.\n\nEven so, those hits did earn her guest shows on both The Bill Anderson Show and Hee Haw in 1970 and, all told, she also appeared on the Grand Ole Opry an even dozen times before calling it quits in 1974.\n\nThis lone album, produced by Singleton, contains all 8 sides of her four Plantation singles, as follows: A1. Bad Case Of The Blues (2:28); A2. San Francisco Is A Lonely Town (2:55); A3. The Wedding Cake (2:20); A4. Tender Leaves Of Love (2:48); A5. I Almost Called Your Name (2:06); B1. Color Him Father (2:46); B2. There Never Was A Time (2:50); B3. You're Crying Boy, Crying (2:28); B4. Old Letter Song (2:28); B5. Then I'll Be Over You (1:51); B6. Before The Next Teardrop Falls (2:05).","torrent":{"xt":"urn:btih:6692e945f4e40ca2d329757383b66b391785a1d7","amp;dn":"Linda+Martell+-+Color+Me+Country+%281970%29+MP3%40320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6692e945f4e40ca2d329757383b66b391785a1d7","infoHashBuffer":{"type":"Buffer","data":[102,146,233,69,244,228,12,162,211,41,117,115,131,182,107,57,23,133,161,215]},"announce":[],"urlList":[]}}