{"title":"Henry Mancini - The Cop Show Themes","uid":7701903,"size":60641039,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:66c7cb657de59d4dfcdc078fdf9ceac753bb1fc2&amp;dn=Henry+Mancini+-+The+Cop+Show+Themes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rajabmm","files":-1,"time":1349551480,"description":"Henry Mancini - The Cop Show Themes\n\nHenry Mancini was the award winning film score composer best known for The Pink Panther theme.\nMancini learned to play the flute and piano as a child, and went on to formal music education at the Julliard School of Music, although being drafted during the Second World War interrupted his studies. After the war he worked with the Glen Miller Band, although it was his move to Universal Studios that marked the beginning of the career for which he is renowned. During his time there, he worked on Creature from the Black Lagoon, This Island Earth, The Glenn Miller Story and over one hundred other films.\nHe set up his own writing company, and was approached by film director Blake Edwards to write for the TV series Peter Gunn. This was the beginning of a long term partnership, and Mancini would go on to write for most of the directors output, including Breakfast at Tiffany's, 10 and The Pink Panther series of films. He also wrote for other directors, with The Glass Menagerie and The Great Waldo Pepper amongst his credits.\nIn addition to providing music for films, he has also written big band, classical and pop music, which have made him a leader in the field of easy listening. His work has been recognised by awards committees, receiving Oscars for Moon River and Breakfast at Tiffany's.\nMancini died in 1994, leaving behind a vast back catalogue of popular music.\n\n01. Mystery movie theme (from the Universal TV Series)\n02. The streets of San Francisco (from the Quinn Martin production)\n03. Bumper's theme (from the Lorimar production The blue knight)\n04. Medley (Kojak (from the Universal TV Series) S.W.A.T. (from the ABC TV Series)\n05. Baretta's theme (Keep your eye on the sparrow)\n06. The Rockford files (from the Universal TV Series)\n07. Hawaii five-0 (from the CBS TV Series)\n08. Police woman (from the NBC TV Series)\n","torrent":{"xt":"urn:btih:66c7cb657de59d4dfcdc078fdf9ceac753bb1fc2","amp;dn":"Henry+Mancini+-+The+Cop+Show+Themes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66c7cb657de59d4dfcdc078fdf9ceac753bb1fc2","infoHashBuffer":{"type":"Buffer","data":[102,199,203,101,125,229,157,77,252,220,7,143,223,156,234,199,83,187,31,194]},"announce":[],"urlList":[]}}