{"title":"Dark Journey-1937- Vivien Leigh and Conrad Veidt","uid":6767502,"size":792966682,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:66ea87d5c22999b1426647618cad1e16c8e54423&amp;dn=Dark+Journey-1937-+Vivien+Leigh+and+Conrad+Veidt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LegendET","files":2,"time":1319452669,"description":"[img]http://img51.imageshack.us/img51/1784/darkjuly30.jpg[/img]\n\n\nThe unorthodox teaming of Vivien Leigh and Conrad Veidt is but one of the many pleasures of the 1937 spy yarn Dark Journey. Leigh plays a Stockholm dress-shop owner during World War I, who, being a neutral, is permitted to travel unmolested to and from France. Veidt plays a supposedly disgraced German officer who is actually head of his country's secret service. The two fall in love, despite the fact that Leigh has a secret as well: she is a double agent, sympathetic towards the Allied cause. During one of Leigh's voyages to France, her ship is captured by a German U-boat. Veidt swaggers on board, threatening to sink the ship if Leigh is not turned over to him. But the circumstances reverse themselves, and Veidt finds himself Leigh's prisoner--a circumstance that is not altogether unpleasant for him. When originally released in England, Dark Journey bore the title The Anxious Years.\n\n[img]http://img828.imageshack.us/img828/1774/ab540.jpg[/img]\n\n\nDark Journey provides more ammunition -- if any is needed -- to the argument that Vivien Leigh was possibly the most stunning figure ever to appear before a camera. Leigh's beauty is sometimes taken for granted, so familiar is it to viewers of her &quot;big&quot; films, but seeing her in an early film like Journey makes ones appreciate anew the special manner in which her physical being captured the lens of the camera and held it a willing hostage.\n\n[img]http://img832.imageshack.us/img832/1343/jklv.jpg[/img]\n\n[img]http://img687.imageshack.us/img687/3959/darkjourney.jpg[/img]","torrent":{"xt":"urn:btih:66ea87d5c22999b1426647618cad1e16c8e54423","amp;dn":"Dark+Journey-1937-+Vivien+Leigh+and+Conrad+Veidt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66ea87d5c22999b1426647618cad1e16c8e54423","infoHashBuffer":{"type":"Buffer","data":[102,234,135,213,194,41,153,177,66,102,71,97,140,173,30,22,200,229,68,35]},"announce":[],"urlList":[]}}