{"title":"She Comes First:The Thinking Mans Guide to Pleasuring a Woman","uid":6661268,"size":26265288,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:66f363165a31afb52843a5b5d46a4079ff8ca50d&amp;dn=She+Comes+First%3AThe+Thinking+Mans+Guide+to+Pleasuring+a+Woman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1315515892,"description":"When it comes to pleasuring women and conversing in the language of love, cunnilingus should be every man's native tongue,&quot; writes clinical sexologist Ian Kerner, Ph.D. in She Comes First, a straightforward, intimate, and exuberant guide to cunnilingus. Kerner first explored &quot;the oral caress&quot; as a way of compensating for his &quot;sexual inadequacies,&quot; and quickly learned that women not only welcomed but often preferred &quot;the way of the tongue,&quot; reaching orgasm more consistently than through intercourse. Kerner educates readers about the clitoris, &quot;the powerhouse of pleasure,&quot; with 18 parts and 8,000 nerve endings (twice as many as the penis) and describes female sexual response from &quot;foreplay&quot; through &quot;coreplay&quot; to &quot;moreplay.&quot; A large part of the book is a graphic, detailed primer on &quot;mouth music,&quot; including best positions, step-by-step techniques (illustrated), and tips for tongue and fingers. How long should this last? Until the woman has an orgasm or many, says Kerner, and &quot;melts blissfully before your eyes.&quot; &quot;The vast majority of women complain about guys who don't like to do it, don't know how to do it, or simply don't do it nearly enough,&quot; writes Kerner. This book will change that. Women: Buy it for your partner! --Joan Price\nFrom Publishers Weekly\nDispelling the widely held myth of genital penetration as the apogee of sexual pleasure, Kerner, who holds a doctorate in clinical sexology, offers this witty, well-researched manual for &quot;consistently leading women to orgasm&quot; through cunnilingus. Loaded with practical anatomical information (the clitoris has 18 distinct parts, and more nerve fibers than any other part of the human body) and graphic line drawings, the book also touches on the less mechanical, more psychological aspects of oral sex, including the three assurances every woman needs from her lover to feel comfortable: (1) &quot;you enjoy it as much as she does&quot;; (2) &quot;there's no rush&quot;; and (3) &quot;Her scent is provocative, her taste powerful: it all emanates from the same beautiful essence.&quot; Since studies show the average woman takes about 20 minutes to reach her first orgasm during a typical sex session, while men take a mere four minutes, Kerner advises men to delay their own climax and make oral sex &quot;coreplay&quot; (&quot;the substantive phase in which sexual tension builds, culminates and then releases itself through the female orgasm&quot;), instead of foreplay. Breaking down six stages of coreplay, from the &quot;first kiss&quot; to orgasm, Kerner speaks to both beginners and more seasoned lovers. His candor concerning his own bout with sexual dysfunction adds a compassionate tone and credibility to this decidedly pro-female methodology.\nCopyright Ã‚Â© Reed Business Information, a division of Reed Elsevier Inc. All rights reserved.\nSee all Editorial Reviews\nProduct Details\n\n    * Hardcover: 240 pages\n    * Publisher: William Morrow; 1St Edition edition (May 25, 2004)\n    * Language: English\n    * ISBN-10: 0060538252\n    * ISBN-13: 978-0060538255","torrent":{"xt":"urn:btih:66f363165a31afb52843a5b5d46a4079ff8ca50d","amp;dn":"She+Comes+First%3AThe+Thinking+Mans+Guide+to+Pleasuring+a+Woman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66f363165a31afb52843a5b5d46a4079ff8ca50d","infoHashBuffer":{"type":"Buffer","data":[102,243,99,22,90,49,175,181,40,67,165,181,212,106,64,121,255,140,165,13]},"announce":[],"urlList":[]}}