{"title":"The Wiley Encyclopedia of Packaging Technology 3rd ed","uid":13840270,"size":21370465,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:67c91dca30fcbec091d1f43f05dcb7a569217f02&amp;dn=The+Wiley+Encyclopedia+of+Packaging+Technology+3rd+ed&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1457789982,"description":"The Wiley Encyclopedia of Packaging Technology 3rd ed - Kit L. Yam (Wiley, 2009).pdf\r\n\r\nISBN 978-0-470-08704-6\r\n\r\nThe complete and authoritative guide to modern packaging technologies --updated and expanded\r\n\r\nFrom A to Z, The Wiley Encyclopedia of Packaging Technology, Third Edition covers all aspects of packaging technologies essential to the food and pharmaceutical industries, among others. This edition has been thoroughly updated and expanded to include important innovations and changes in materials, processes, and technologies that have occurred over the past decade. It is an invaluable resource for packaging technologists, scientists and engineers, students and educators, packaging material suppliers, packaging converters, packaging machinery manufacturers, processors, retailers, and regulatory agencies.\r\n\r\nIn addition to updating and improving articles from the previous edition, new articles are also added to cover the recent advances and developments in packaging. Content new to this edition includes:\r\n\r\nAdvanced packaging materials such as antimicrobial materials, biobased materials, nanocomposite materials, ceramic-coated films, and perforated films\r\n\r\nAdvanced packaging technologies such as active and intelligent packaging, radio frequency identification (RFID), controlled release packaging, smart blending, nanotechnology, biosensor technology, and package integrity inspection\r\n\r\nVarious aspects important to packaging such as sustainable packaging, migration, lipid oxidation, light protection, and intellectual property\r\n\r\nContributions from experts in all-important aspects of packaging\r\n\r\nExtensive cross-referencing and easy-to-access information on all subjects\r\n\r\nLarge, double-column format for easy reference","torrent":{"xt":"urn:btih:67c91dca30fcbec091d1f43f05dcb7a569217f02","amp;dn":"The+Wiley+Encyclopedia+of+Packaging+Technology+3rd+ed","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67c91dca30fcbec091d1f43f05dcb7a569217f02","infoHashBuffer":{"type":"Buffer","data":[103,201,29,202,48,252,190,192,145,209,244,63,5,220,183,165,105,33,127,2]},"announce":[],"urlList":[]}}