{"title":"Fish Diseases and Disorders, Volume 3","uid":9924748,"size":15287104,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:687bfd719df5c5eec2931483416c7a6d3b9fee4e&amp;dn=Fish+Diseases+and+Disorders%2C+Volume+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1397051659,"description":"Viral, Bacterial and Fungal Infections\nEdited by P T K Woo, Professor Emeritus, University of Guelph, Canada, D W Bruno, Pathology and Bacteriology Group Leader, Marine Scotland, Aberdeen, UK\n\nPages: 944\nPublisher: --\nEdition: 2nd., February 2011 Language: English\nISBN: 978-1845935542\n\nDescription\n\nThis third and final volume in the acclaimed Fish Diseases and Disorders trilogy addresses infectious diseases of finfish and shellfish caused by viruses, bacteria and fungi. Topics covered include infectious pancreatic necrosis virus, infectious hematopoictic necrosis virus, viral diseases of cold and warm-water fish, rickettsial and chlamydial infections, furunculosis, motile aeromonads, vibriosis, flavobacterial diseases and shellfish diseases. Written by experts in each discipline and updated throughout to reflect new developments in the field, including new chapters on alphaviruses, oncogenic viruses and genomics and proteomics, this is a must-have reference for fish health specialists and veterinarians, microbiologists, zoologists and researchers and students in aquaculture.\n\nMain Contents\n1. Infectious Pancreatic Necrosis and Associated Aquatic Birnaviruses 2. Infectious Haematopoietic Necrosis Virus 3. Viral Haemorrhagic Septicaemia 4. Infectious Salmon Anaemia 5. Viral Diseases and Agents in Warm Water Fish 6. Alphaviruses 7. Oncogenic Viruses 8. Piscirickettsia, Francisella and Epitheliocystis 9. Bacterial Kidney Disease (Renibacterium salmoninarum) 10. Enterococcus seriolicida and Streptococcus spp. (S. iniae, S. agalactiae) 11. Mycobacteriosis and Nocardiosis 12. Furunculosis and Other Aeromoniosis 13. Enteric Redmouth Disease (Yersinia ruckeri) 14. Edwardsiella Septicaemias 15. Vibriosis 16. Flavobacterial Diseases: Columnaris, Cold-water Disease and Bacterial Gill Disease 17. Pasteurellosis and Other Bacterial Diseases 18. Saprolegnia and Other Oomycetes 19. Ichthyophonus and Related Organisms 20. Shellfish Diseases (Viral, Bacterial and Fungal) 21. Genomics of Fish and Shellfish Microbial Pathogens\n","torrent":{"xt":"urn:btih:687bfd719df5c5eec2931483416c7a6d3b9fee4e","amp;dn":"Fish+Diseases+and+Disorders%2C+Volume+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"687bfd719df5c5eec2931483416c7a6d3b9fee4e","infoHashBuffer":{"type":"Buffer","data":[104,123,253,113,157,245,197,238,194,147,20,131,65,108,122,109,59,159,238,78]},"announce":[],"urlList":[]}}