{"title":"David Estes - The Dwellers Saga Omnibus [1-3]","uid":14679949,"size":843106999,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6890f93f488daf1c839870299a60e2a62c879a51&amp;dn=David+Estes+-+The+Dwellers+Saga+Omnibus+%5B1-3%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Cybotage","files":1,"time":1463970579,"description":"1. The Moon Dwellers: In a desperate attempt to escape destruction decades earlier, humankind was forced underground into the depths of the Earth, creating a new society called the Tri-Realms. After her parents and sister are abducted by the Enforcers, 17-year-old Adele, a member of the middle-class moon dwellers, is unjustly sentenced to life in prison for her parents' crimes of treason.\r\n\r\nAt the other end of the social spectrum is Tristan, the son of the president and a sun dweller. His mother is gone. He hates his father. Backed by only his servant and best friend, Roc, he leaves his lavish lifestyle in the Sun Realm, seeking to make something good out of his troubled life.\r\nWhen a war breaks out within the Tri-Realms, Tristan and Adele are thrust into the middle of a conflict as Adele seeks to find her family and uncover her parents' true past.\r\n\r\n2. The Star Dwellers: After rescuing her father and younger sister, Adele is forced to leave her family and Tristan behind to find her mother in the cruel and dangerous realm of the star dwellers. Despite blossoming feelings for Adele, Tristan must cast his feelings aside and let her find her own way among the star dwellers while he accompanies Adele's father to meet the leaders of the moon dwellers and decide the fate of the Tri-Realms.\r\nIn their world there's only one rule: someone must die.\r\n\r\n3. The Sun Dwellers: With those she's closest to dying around her, Adele embarks on a secret mission to the Sun Realm to assassinate the president. Along the way she'll uncover secrets about her relationship with Tristan that she might not be ready to face.\r\nTristan has a secret, too - one that's been eating him up inside ever since he met Adele. Will he reveal all and risk the loss of friendship and love at a time when he needs it the most?\r\n\r\n\r\n\r\n\r\n\r\nRead by Julia Whelan, Will Damron\r\nFormat: MP3","torrent":{"xt":"urn:btih:6890f93f488daf1c839870299a60e2a62c879a51","amp;dn":"David+Estes+-+The+Dwellers+Saga+Omnibus+%5B1-3%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6890f93f488daf1c839870299a60e2a62c879a51","infoHashBuffer":{"type":"Buffer","data":[104,144,249,63,72,141,175,28,131,152,112,41,154,96,226,166,44,135,154,81]},"announce":[],"urlList":[]}}