{"title":"Motherland (2014) Maria Hummel (multi)","uid":9540496,"size":1360863,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6894bf3bd0f63213307544f621d9e3cfeae3153e&amp;dn=Motherland+%282014%29+Maria+Hummel+%28multi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"7","files":-1,"time":1391033208,"description":"Motherland by Maria Hummel\n\n\nFormat: mobi/epub/azw3\nLength: 400 pages\nGenre: Historical Fiction\nDate: 14 January 2014\n\nIn stunning, pitch-perfect prose, Maria Hummel gives us a deeply moving portrait of lives on the wrong side of history. This isn't just another World War II novel; it's a spectacular story about what it means to love and hope in the most difficult of times.\n\nMutterland - Mein Vaterland ist tot sie haben es begraben im feuer. Ich lebe in meinem Mutterland--Wort\n\n--Rose Auslander\n\nMotherland - My Fatherland is dead they buried it in fire. I live in my Motherland--Word\n\n--Rose Auslander\n\nThe Kappus family: Frank is a reconstructive surgeon who lost his beloved wife in childbirth and two months later married a young woman who must look after the baby and his two grieving sons when he is drafted into medical military service. Alone in the house, Liesl must attempt to keep the children fed with dwindling food supplies, safe from the constant Allied air attacks, and protected against the swell of desperate refugees flooding their town.\n\nWhen one child begins to mentally unravel, Liesl must discover the source of the boy's infirmity or lose him forever to Hadamar, the infamous hospital for 'unfit' children. The novel bears witness to the shame and courage of Third Reich families during the devastating last days of the war, as each family member's fateful choices lead them deeper into questions of complicity and innocence, to the novel's heartbreaking and unforgettable conclusion.\n\nAuthor:\n\nMotherland is inspired by stories from the author's father and his German childhood, and letters between her grandparents that were hidden in an attic wall for fifty years. It is the author's attempt to reckon with the paradox of her father--a product of her grandparents' fiercely protective love and their status as Mitlaufer, Germans who 'went along' with Nazism, first reaping its benefits and later its consequences. ","torrent":{"xt":"urn:btih:6894bf3bd0f63213307544f621d9e3cfeae3153e","amp;dn":"Motherland+%282014%29+Maria+Hummel+%28multi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6894bf3bd0f63213307544f621d9e3cfeae3153e","infoHashBuffer":{"type":"Buffer","data":[104,148,191,59,208,246,50,19,48,117,68,246,33,217,227,207,234,227,21,62]},"announce":[],"urlList":[]}}