{"title":"Abraham Lincoln in the Kitchen by Rae Katherine Eighmey","uid":9720207,"size":3589438,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:68e6f0861c34e966059dc50ca888d97fcde9bb48&amp;dn=Abraham+Lincoln+in+the+Kitchen+by+Rae+Katherine+Eighmey&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"PirateBook","files":1,"time":1394222249,"description":"\nAbraham Lincoln in the Kitchen: A Culinary View of Lincoln's Life and Times by Rae Katherine Eighmey\n\nAbraham Lincoln in the Kitchen is a culinary biography unlike any before. The very assertion of the title--that Abraham Lincoln cooked--is fascinating and true. It's an insight into the everyday life of one of our nation's favorite and most esteemed presidents and a way to experience flavors and textures of the past.\n\nEighmey solves riddles such as what type of barbecue could be served to thousands at political rallies when paper plates and napkins didn't exist, and what gingerbread recipe could have been Lincoln's childhood favorite when few families owned cookie cutters and he could carry the cookies in his pocket. \n\nThrough Eighmey's eyes and culinary research and experiments--including sleuthing for Lincoln's grocery bills in Springfield ledgers and turning a backyard grill into a cast-iron stove--the foods that Lincoln enjoyed, cooked, or served are translated into modern recipes so that authentic meals and foods of 1820-1865 are possible for home cooks. Feel free to pull up a chair to Lincoln's table.\n\nGenre: Non Fiction , Cooking","torrent":{"xt":"urn:btih:68e6f0861c34e966059dc50ca888d97fcde9bb48","amp;dn":"Abraham+Lincoln+in+the+Kitchen+by+Rae+Katherine+Eighmey","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68e6f0861c34e966059dc50ca888d97fcde9bb48","infoHashBuffer":{"type":"Buffer","data":[104,230,240,134,28,52,233,102,5,157,197,12,168,136,217,127,205,233,187,72]},"announce":[],"urlList":[]}}