{"title":"Boeing 737 Classic.wmv","uid":4560532,"size":729108021,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:69832b443500da05769c9ef662c1d161eb7e16bd&amp;dn=Boeing+737+Classic.wmv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Alitalia","files":1,"time":1228664758,"description":"The video begins with a general overview of the Boeing 737 from the external side. We take a quick look at the engines, wings, tail and landing gear. Afterwards we head straight to the cockpit and witness how the pilots test and prepare the flight equipment for our journey. After all the preparations are complete, we start the engines and taxi for takeoff from Rome Fiumicino International Airport. The subsequent takeoff and initial departure goes as planned and after a very short cruise we descend to land at our destination airfield. The pilots execute a magnificent &quot;text-book&quot; landing and we taxi in for engine shutdown and leave our crew for a moment to let them prepare for the return journey home. In the meantime however, we will show you the final moments of a landing in the Boeing 737EFIS, again filmed in midnight darkness. This will give you a couple of minutes to rest from the analogue instrument cockpit. When we return to the classic you will once again get a chance to see the most interesting moments of a scheduled airline flight on our return trip to Rome.","torrent":{"xt":"urn:btih:69832b443500da05769c9ef662c1d161eb7e16bd","amp;dn":"Boeing+737+Classic.wmv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69832b443500da05769c9ef662c1d161eb7e16bd","infoHashBuffer":{"type":"Buffer","data":[105,131,43,68,53,0,218,5,118,156,158,246,98,193,209,97,235,126,22,189]},"announce":[],"urlList":[]}}