{"title":"Topologies - The Urban Utopia in France, 1960-1970 (Art Architec","uid":10663057,"size":144004733,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:69f59b329dc23bfc391ac0a5cd26f46690336e08&amp;dn=Topologies+-+The+Urban+Utopia+in+France%2C+1960-1970+%28Art+Architec&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":-1,"time":1406752808,"description":"Topologies: The Urban Utopia in France, 1960--1970 by Larry Busbea\nEnglish | 2012 | ISBN: 0262026112, 0262518104 | 240 pages | PDF | 137 MB\n\nAmid the cultural and political ferment of 1960s France, a group of avant-garde architects, artists, writers, theorists, and critics known as &quot;spatial urbanists&quot; envisioned a series of urban utopias--phantom cities of a possible future. The utopian &quot;spatial&quot; city most often took the form of a massive grid or mesh suspended above the ground, all of its parts (and inhabitants) circulating in a smooth, synchronous rhythm, its streets and buildings constituting a gigantic work of plastic art or interactive machine. In this new urban world, technology and automation were positive forces, providing for material needs as well as time and space for leisure. In this first study of the French avant-garde tendency known as spatial urbanism, Larry Busbea analyzes projects by artists and architects (including the most famous spatial practitioner, Yona Friedman) and explores texts (many of which have never before been translated from the French) by Michel Ragon, the influential founder of the Groupe International d'Architecture Prospective (GIAP), Victor Vasarely, and others. Even at its most fanciful, Busbea argues, the French urban utopia provided an image for social transformations that were only beginning to be described by cultural theorists and sociologists.","torrent":{"xt":"urn:btih:69f59b329dc23bfc391ac0a5cd26f46690336e08","amp;dn":"Topologies+-+The+Urban+Utopia+in+France%2C+1960-1970+%28Art+Architec","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69f59b329dc23bfc391ac0a5cd26f46690336e08","infoHashBuffer":{"type":"Buffer","data":[105,245,155,50,157,194,59,252,57,26,192,165,205,38,244,102,144,51,110,8]},"announce":[],"urlList":[]}}