{"title":"LL Cool J - Bigger &amp; Deffer 1987 [FLAC] - Kitlope","uid":4212886,"size":271711831,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6a226dd2f932f810bcc0352005f2b0be4b4436a3&amp;dn=LL+Cool+J+-+Bigger+%26+Deffer+1987+%5BFLAC%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Kitlope","files":16,"time":1212173968,"description":"File Type: FLAC Compression 6\nCd recorder: Plextor PX-716SA\nCd Ripper: EAC 0.99 prebeta 3\nEAC Log: Yes\nEAC Cue Sheet: Yes\nTracker(s):http://tpb.tracker.thepiratebay.se:80/announce;\nTorrent Hash: 6A226DD2F932F910BCC0352005F2B0BE4B4436A3\nFile Size: 259 Mb\nYear: 1987\nLabel: Def Jam/Columbia\n\nPlease help seed these FLACs! \n\n\nFrom Wiki:\n\n\n\nJames Todd Smith III (born January 14, 1968[citation needed]), better known as LL Cool J, is an American hip hop rapper and actor. LL Cool J stands for &quot;Ladies Love Cool James.&quot; He is known for romantic ballads such as &quot;I Need Love&quot; and &quot;Hey Lover&quot; as well as pioneering hip-hop like &quot;I Can&amp;#039;t Live Without My Radio&quot;, &quot;I&amp;#039;m Bad&quot;, &quot;Boomin&amp;#039; System&quot;, &quot;Mama Said Knock You Out&quot;, and &quot;4, 3, 2, 1&quot;. L has also appeared in several films. LL Cool J is one of a few hip-hop stars of his era to sustain a successful recording career for more than two decades. He has released 12 albums and a greatest hits compilation so far, with his next album, Exit 13, set to be released early 2008. The album will be the last for LL&amp;#039;s record deal with Def Jam Recordings, a deal which has lasted for over twenty two years, making it the longest single hip hop deal to date. He now resides in Manhasset, NY with his wife and four children.[1]\n\nHe has achieved significant commercial success as a rapper, with record sales of over 15 million in the U.S. alone.\n\nIn 1987, he released Bigger and Deffer. The ballad &quot;I Need Love&quot; was one of the first hit pop-rap songs. Also featured on the album was &quot;Go Cut Creator Go,&quot; which pays homage to the DJ. The album was met with commercial and critical acclaim going 2x Platinum. In 1998, The Source Magazine named it as one of the top 100 albums ever. At this point LL was on top of the rap world, and was making frequent appearances on television shows and on radio as he was being featured on other Def Jam artists&amp;#039; work.\n\n&quot;I Need Love&quot; was the second single from LL Cool J&amp;#039;s second album, Bigger and Deffer. The song is considered the first rap ballad and was released in the fall of 1987. It reached #1 on the R&amp;B/Hip Hop charts and was a well-received single on the Billboard Hot 100 charts, reaching #14, while becoming one of the first rap songs to enjoy mainstream popularity in the UK, reaching #8 in the UK Singles Chart. The single won a Soul Train Music Award for Best Rap - Single in 1987. The song was parodied in 2000 by Brooklyn rapper Necro in his song &quot;I Need Drugs&quot;, which alters the lyrics to a narrative of a man&amp;#039;s addiction to crack cocaine. The song ranked #13 on the 100 Greatest Rap Songs.\n\nBigger and Deffer (Sometimes BAD or Bigger And Deffer) is the second album by rapper LL Cool J and is remembered most for containing the first commercially successful &quot;rap ballad&quot;, &quot;I Need Love&quot;. It also contains the single &quot;Go Cut Creator Go&quot;, which pays homage to his DJ and contains an interpolation of Chuck Berry&amp;#039;s &quot;Johnny B. Goode&quot;, and the breakthrough single in the U.K. &quot;I&amp;#039;m Bad&quot;. In 1998, the album was selected as one of The Source Magazine&amp;#039;s 100 Best Rap Albums, while receiving mixed reviews from other critics.\n\nThe front cover photograph on the album was taken in front LL&amp;#039;s Andrew Jackson High School in Queens[2] , and the back cover was shot in his grandmothers basement where he was living at the time, (both shot by Glen E. Friedman).\n\n\n\n\n\n\n\nTracks\n\n\n&quot;I&amp;#039;m Bad&quot; ? 4:39 \n&quot;Kanday&quot; ? 3:59 \n&quot;Get Down&quot; (Ervin/LL Cool J/Pierce/Simon) ? 3:23 \n&quot;The Bristol Hotel&quot; ? 2:43 \n&quot;My Rhyme Ain&amp;#039;t Done&quot; ? 3:45 \n&quot;.357 - Break It on Down&quot; (Ervin/Jordan/Pierce/Simon/Smith) ? 4:05 \n&quot;Go Cut Creator Go&quot; ? 3:57 \n&quot;The Breakthrough&quot; (Ervin/LL Cool J/Pierce/Simon) ? 4:04 \n&quot;I Need Love&quot; (Ervin/Ettenger/Simon/Smith) ? 5:23 \n&quot;Ahh, Let&amp;#039;s Get Ill&quot; ? 3:45 \n&quot;The Do Wop&quot; ? 4:59 \n&quot;On the Ill Tip&quot; ? :31 \n\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:6a226dd2f932f810bcc0352005f2b0be4b4436a3","amp;dn":"LL+Cool+J+-+Bigger+%26+Deffer+1987+%5BFLAC%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a226dd2f932f810bcc0352005f2b0be4b4436a3","infoHashBuffer":{"type":"Buffer","data":[106,34,109,210,249,50,248,16,188,192,53,32,5,242,176,190,75,68,54,163]},"announce":[],"urlList":[]}}