{"title":"[SoM]Revolver[DvdRip-Xivd-Ita AC3-Eng Mp3]","uid":4527249,"size":1442236416,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6adb3996863698810df6c19f2beffacd7bc94036&amp;dn=%5BSoM%5DRevolver%5BDvdRip-Xivd-Ita+AC3-Eng+Mp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mitimex","files":2,"time":1227401760,"description":"Il film segue le vicende a Las Vegas di Jake Green, interpretato da Jason Statham, uno scaltro ma tormentato giocatore d&amp;#039;azzardo alle prese con un violento boss, Dorothy Macha, interpretato da Ray Liotta.Green appena uscito dopo sette anni di isolamento in prigione, ha appena scoperto di avere un infiammazione del sangue, che lo ucciderÃƒÂ  in tre giorni. Viene incontrato da una banda, Zack e Avi, gli squali del prestito, che promettono di proteggerlo dal boss Macha che lo vuole morto.In cambio lui deve stare a due patti:\ndare tutti i suoi soldi a loro;\nrispondere a tutte le loro domande.\nInizia cosÃƒÂ¬ ad andare in giro con i due personaggi degli squali, effettuando dei lauti prestiti a persone bisognose, applicando alti tassi d&amp;#039;interesse.Intanto Macha, ÃƒÂ¨ intricato in affari con il signor Sam Gold, a cui deve fornire della cocaina.Intenato si scopre che in prigione Green aveva incontrato due misteriosi gemelli, che evadono e lo derubano di tutto quello che aveva, ma gli lasciano un libro di formule.Intanto Green e i suoi &quot;amici&quot; squali derubano Macha della cocaina, che deve andare a procurarsene dell&amp;#039;altra, e quindi va a chiederla a lord John, un asiatico suo avversario nello spaccio.La droga perÃƒÂ² viene nuovamente rubata dal gruppo degli squali, poco prima dello scambio tra gli asiatici e Macha, provocando una difficile situazione tra Macho e lord John.Successivamente Green scopre che in realtÃƒÂ  non stÃƒÂ  morendo, ma appena uscito dal medico, viene investito da una macchina, o almeno sembra, una telefonata lo salva. Intanto inizia a farsi alcune domande.\nNel frattempo Macha scopre che dietro a tutto c&amp;#039;ÃƒÂ¨ Green, tramite suo fratello, il quale ÃƒÂ¨ sotto due cocainomini, opportunisti che vogliono mettersi in luce con Macha.Macha e lord John iniziano una guerra tra di loro, e si susseguono diversi avvenimenti, non ultimo un fallito attentato a Macha, e la morte di lord John.Inizia una fase in cui Green sente delle voci, e non riesce neanche ad uccidere Macha quando va a trovarlo di notte nella sua camera da letto.Ma anche Macha una volta sveglio e con di fronte Green non riesce ad ucciderlo.Successivamente il fratello di Green viene torturato dagli uomini di Macha per sapere dove lui si ÃƒÂ¨ nascosto, mentre allo stesso tempo a Macha fa visita una signore emissaria da mr. Gold.\n","torrent":{"xt":"urn:btih:6adb3996863698810df6c19f2beffacd7bc94036","amp;dn":"%5BSoM%5DRevolver%5BDvdRip-Xivd-Ita+AC3-Eng+Mp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6adb3996863698810df6c19f2beffacd7bc94036","infoHashBuffer":{"type":"Buffer","data":[106,219,57,150,134,54,152,129,13,246,193,159,43,239,250,205,123,201,64,54]},"announce":[],"urlList":[]}}