{"title":"The Alaska Pipeline (TV) [2006] PBS","uid":6969228,"size":564919500,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6bc1dcd15315e02bf5e48e6fd203b24fed836095&amp;dn=The+Alaska+Pipeline+%28TV%29+%5B2006%5D+PBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ThorntonWilde","files":-1,"time":1327033853,"description":" &lt;a href=&quot;http://bayimg.com/AAmFEaADa&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/AAmFEaADa&lt;/a&gt;\n\nThe American Experience \n \nThe Alaska Pipeline\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0844049/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0844049/&lt;/a&gt;\n\nOriginal Air Date:24 April 2006 \n\n When Atlantic Richfield prospectors struck oil at Prudhoe Bay early in 1968, they stumbled upon the largest oil field ever discovered in North America. Getting that oil out of Alaska would take nine years, employ some 78,000 people, cost more than $8 billion, and require threading 800 miles of steel pipe through America's most pristine wilderness.\n\nAmerican Experience presents The Alaska Pipeline, a one-hour documentary from producer Mark Davis. &quot;The Trans-Alaska Pipeline changed just about everything and everyone it touched,&quot; says Davis, &quot;from the people who opposed it to the people who supported it, the people who built it, and the state of Alaska.&quot;\n\nOil companies with holdings at Prudhoe Bay formed a company called Alyeska to build and operate the pipeline. But before the first mile of pipe could be laid, the project ran into unexpected opposition. Native Alaskans had been waiting more than a century for Congress to settle ancestral land claims. Since the proposed pipeline would run directly through land they considered theirs, they believed that the government should settle their claims before construction began. Another formidable challenge came from environmentalists, who feared that the colossal project would wreak havoc on America's last untouched wilderness. In April 1970, Native Alaskans and environmentalists both sued in federal court to block government approval of the pipeline.\n\nNative Alaskans suddenly had leverage they'd never had before. With the oil industry lobbying on their behalf for a quick resolution, they received 44 million acres of land and $1 billion from the Federal government. &quot;The pipeline allowed Alaska's Native peoples to become a social and economic force,&quot; notes Native leader Byron Mallott.\n\nThe environmental battle took much longer. A new law required the government to consider environmental impacts before authorizing any project on public land. Taking advantage of this, environmentalists forced detailed studies and stalled construction for years. &quot;If the environmental movement hadn't challenged the pipeline, we would have ended with damage beyond description,&quot; says Stewart Brandborg, then director of the Wilderness Society.\n\nThe project also faced criticism from the government's own scientists. They warned that the traditional pipeline construction method -- dig a ditch and bury it -- would not work in Alaska. Prudhoe Bay oil would come out of the ground hot, melting the frozen ground, called permafrost, into mud. The unsupported pipe would eventually buckle, break, and leak oil. The only option was to build more than 400 miles of the pipeline above ground.\n\nEnvironmentalists still had the pipeline tied up in court in 1973 when Arab states declared an embargo on oil shipments to the U.S., plunging America into a serious energy crisis. Alaskan oil -- which some estimated could cut imports by one-third -- became a national security issue. In early November, President Richard Nixon signed the Trans-Alaska Pipeline Authorization Act, which prohibited any further legal challenges, and the pipeline forged ahead.\n\nWhile Alyeska hauled in millions of tons of pipe, machinery, spare parts, fuel and food, thousands of people descended on Alaska looking for high-paying jobs. &quot;I opened my Time magazine and it had a picture of a fellow on the pipeline showing his check to the camera,&quot; recalls Al Fleming, who was a teacher in 1975. &quot;That check was about $1,500 a week. I said 'That's me! We're going.'&quot;\n\nWith the high wages came high-pressure, grueling work. More than 800 miles of pipe needed to be welded together eighty feet at a time in a place where the temperature could reach sixty degrees below zero, and where darkness prevailed through much of the winter. Racing to meet Alyeska's ambitious schedule, engineers, welders, equipment operators, truckers, and laborers coped with rugged mountain passes and roller coaster terrain.\n\nIn the summer of 1977, Alaskan crude began to flow through the finished pipeline. Since then, the pipeline has delivered some 15 billion barrels of oil -- half again as much as predicted, though hardly enough to break America's dependence on foreign oil.\n\nThe safeguards environmentalists fought for produced a pipeline as green as almost anyone could have hoped. But the disaster that pipeline opponents said was inevitable came in 1989 when the Exxon Valdez ran aground, spilling a quarter-million barrels of oil into Prince William Sound. It was the largest, most destructive oil spill in U.S. history.\n\n&quot;Alaska is now an oil state,&quot; says Howard Weaver, a reporter for the Anchorage Daily News during the pipeline years. &quot;I know you'd find lots of Alaskans who thought that that was the beginning of the state standing on its own feet being able to pay for its own future. I think you'd find an equal number who would think something very special was lost.&quot;\n\n&quot;This story echoes today,&quot; says American Experience executive producer Mark Samels. &quot;The Alaska pipeline is still in operation, but even with Alaskan oil, the U.S. faces tough questions about energy independence and the ripple effect it has on foreign policy, homeland security, and the environment.&quot;\n\n","torrent":{"xt":"urn:btih:6bc1dcd15315e02bf5e48e6fd203b24fed836095","amp;dn":"The+Alaska+Pipeline+%28TV%29+%5B2006%5D+PBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6bc1dcd15315e02bf5e48e6fd203b24fed836095","infoHashBuffer":{"type":"Buffer","data":[107,193,220,209,83,21,224,43,245,228,142,111,210,3,178,79,237,131,96,149]},"announce":[],"urlList":[]}}