{"title":"Take Time for Your Life (Audiobook) by Cheryl Richardson","uid":13415822,"size":82465624,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6bf25ad24716e22c7d802bb3d7e9de8802539d41&amp;dn=Take+Time+for+Your+Life+%28Audiobook%29+by+Cheryl+Richardson&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"yousef86","files":37,"time":1454494189,"description":"Take Time for Your Life (Audiobook) By Cheryl Richardson\r\n========================================================\r\nUnabridged edition 2002 | 4 hours and 33 mins | ISBN: 1564558436 | MP3 40 kbps | 78 MB\r\n\r\n\r\n\r\nLive the life you've always dreamed of! America's #1 personal coach offers an inspiring, practical seven-step program to help you create the life you want. Imagine finding time to do all the things you want to do. Having plenty of energy for family and friends. Having control over your income and finances. Taking care of your physical and emotional well-being. If you feel as though the life you're living doesn't reflect your true priorities and is leaving you stressed out and unfulfilled, you're not alone. Cheryl Richardson--the leader in the new field of personal coaching, what she calls &quot;a personal trainer for the soul&quot;--has helped thousands of people make changes toward living a high-quality life, and in Take Time for Your Life she offers her step-by-step program so you can too. If you're tired of living a life that feels out of control and are ready to live life on your own terms--while still meeting your responsibilities--get ready to take action! Packed with useful exercises, checklists, concrete advice, client success stories, personal anecdotes, and a wealth of resources, Cheryl Richardson's seven-step program shows you how to identify and eliminate the things in life that are draining you and replace them with the things that fuel you. She gives you permission to put yourself at the top of your list. By doing so, you will find not only more energy and more enthusiasm but also that your relationships, your finances, your work, and your sense of well-being are improved and better balanced. Whether you're a corporate executive working sixty hours a week, a single parent trying to raise a family, someone starting his or her own business, or going back to school, Take Time for Your Life shows you how to step back, regain control, and make conscious decisions about the future you'd like to create. Richardson's strategies for overcoming the obstacles that block you from living the life you want will help you discover a world in which your priority list reflects your true desires. Take time for your life--and begin living a life that you love","torrent":{"xt":"urn:btih:6bf25ad24716e22c7d802bb3d7e9de8802539d41","amp;dn":"Take+Time+for+Your+Life+%28Audiobook%29+by+Cheryl+Richardson","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6bf25ad24716e22c7d802bb3d7e9de8802539d41","infoHashBuffer":{"type":"Buffer","data":[107,242,90,210,71,22,226,44,125,128,43,179,215,233,222,136,2,83,157,65]},"announce":[],"urlList":[]}}