{"title":"Dido Discography (Life for Rent, No Angel, Odds &amp; Ends, Safe","uid":7149972,"size":1499005542,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6c4d85620eaa6955cb7d44ac41eeeb2f1121a405&amp;dn=Dido+Discography+%28Life+for+Rent%2C+No+Angel%2C+Odds+%26amp%3B+Ends%2C+Safe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"n17n3uq","files":50,"time":1333239438,"description":"Dido Florian Cloud de Bounevialle O'Malley Armstrong, known as Dido, is an English singer-songwriter.\n\nDido shot to worldwide success with her debut album, No Angel (1999). The album sold in excess of 21 million copies worldwide,[3] and won several awards; including the MTV Europe Music Award for Best New Act, two NRJ Awards for Best New Act and Best Album, and two Brit Awards for Best British Female and Best Album. Her following album, Life for Rent (2003), continued her mainstream success with the help of popular singles &quot;White Flag&quot; and &quot;Life for Rent&quot;. The album went on to sell around 12 million copies worldwide and saw her receive more accolades; including the Ivor Novello Award for Songwriter of the Year for &quot;White Flag&quot;, two further Brit and NRJ Awards, as well as a Grammy Award nomination.\n\nDido's first two albums, No Angel and Life for Rent, are among the best-selling albums in UK Chart history, and both are in the top 10 best-selling albums of the 2000s in the UK.[4] Her third and latest studio album, Safe Trip Home (2008), received critical praise to help maintain her success.[5] She was nominated for an Academy Award for the song &quot;If I Rise&quot;.[6] Dido has been ranked #98 of Billboard 200 Artists Music Chart based on the success of her music in the first decade of the 21st century.[7]","torrent":{"xt":"urn:btih:6c4d85620eaa6955cb7d44ac41eeeb2f1121a405","amp;dn":"Dido+Discography+%28Life+for+Rent%2C+No+Angel%2C+Odds+%26amp%3B+Ends%2C+Safe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c4d85620eaa6955cb7d44ac41eeeb2f1121a405","infoHashBuffer":{"type":"Buffer","data":[108,77,133,98,14,170,105,85,203,125,68,172,65,238,235,47,17,33,164,5]},"announce":[],"urlList":[]}}