{"title":"El.Desafio.Frost.Contra.Nixon.(2008).DVDScreener.Xvid.Spanish.La","uid":4712588,"size":1495903711,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6cc8ce2acfc00efd31c67a85e5edba039f51cb80&amp;dn=El.Desafio.Frost.Contra.Nixon.%282008%29.DVDScreener.Xvid.Spanish.La&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LDivx","files":4,"time":1234120281,"description":" TÃƒÂ­tulo original: Frost/Nixon\nGÃƒÂ©nero: Drama\nPaÃƒÂ­s: Estados Unidos\nEstreno en EspaÃƒÂ±a:\n6 Febrero 2009\nDirecciÃƒÂ³n:\nRon Howard\nInterpretaciÃƒÂ³n:\nKevin Bacon\nFrank Langella\nSam Rockwell\nMatthew Macfadyen\nMichael Sheen\nOliver Platt\nToby Jones\nMax Elliott Slade\nRebecca Hall\nHolly Weber\nPatricia McCormack\nSinopsis:\nEl oscarizado director Ron Howard, basÃƒÂ¡ndose en un guiÃƒÂ³n de Peter Morgan (The Queen/La reina, El ÃƒÂºltimo rey de Escocia), cuenta la electrizante batalla entre Richard Nixon, el desacreditado presidente con un legado que salvar, y David Frost, una personalidad de la jet-set televisiva en busca de la fama, a travÃƒÂ©s de la historia que nunca se supo y que les cambiÃƒÂ³ a ambos, en la pelÃƒÂ­cula FROST/NIXON. Frank Langella, que ganÃƒÂ³ un Tony por su interpretaciÃƒÂ³n de Nixon en la obra teatral de Peter Morgan, y Michael Sheen, que dio vida a Frost en la misma obra, vuelven a encarnar a los mismos personajes.En los tres aÃƒÂ±os siguientes a verse obligado a dejar la Casa Blanca, Nixon permaneciÃƒÂ³ en silencio. Sin embargo, en el verano de 1977, el astuto y frÃƒÂ­o ex presidente aceptÃƒÂ³ conceder una ÃƒÂºnica entrevista y contestar a preguntas acerca de su mandato y del escÃƒÂ¡ndalo Watergate que acabÃƒÂ³ con su presidencia. Nixon sorprendiÃƒÂ³ a todos al escoger a David Frost como confesor televisivo, seguro de que podrÃƒÂ­a con el alegre presentador britÃƒÂ¡nico y se ganarÃƒÂ­a los corazones y las mentes de los estadounidenses.El equipo de Frost no estaba seguro de que el periodista fuera capaz de llevar a Nixon adonde querÃƒÂ­a. Pero en cuanto empezaron a rodar, la batalla comenzÃƒÂ³. Ã‚Â¿PodrÃƒÂ­a Nixon eludir las preguntas acerca de su papel en una de las mayores vergÃƒÂ¼enzas sufridas por la naciÃƒÂ³n? Ã‚Â¿ExigirÃƒÂ­a Frost respuestas claras del hombre que llegÃƒÂ³ al poder por ser el maestro de la evasiva? Durante la entrevista, cada uno revela sus inseguridades, personalidad e inesperadas reservas de dignidad, para llegar por fin a una asombrosa exhibiciÃƒÂ³n de sinceridad.FROST/NIXON no sÃƒÂ³lo recrea la entrevista televisada, sino las semanas precedentes de negociaciones y maniobras entre los dos hombres y sus equipos, en las que se llegÃƒÂ³ a acuerdos y se revelaron secretos, hasta el momento cumbre en que ambos se sentaron ante la opiniÃƒÂ³n pÃƒÂºblica.","torrent":{"xt":"urn:btih:6cc8ce2acfc00efd31c67a85e5edba039f51cb80","amp;dn":"El.Desafio.Frost.Contra.Nixon.%282008%29.DVDScreener.Xvid.Spanish.La","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6cc8ce2acfc00efd31c67a85e5edba039f51cb80","infoHashBuffer":{"type":"Buffer","data":[108,200,206,42,207,192,14,253,49,198,122,133,229,237,186,3,159,81,203,128]},"announce":[],"urlList":[]}}