{"title":"Dsoid v1.9.15","uid":8667277,"size":2130655,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:6d68a9195fb8228a0abd4f5201cece91aad1fdb0&amp;dn=Dsoid+v1.9.15&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Androider","files":-1,"time":1373423821,"description":"\nThis is the first Nintendo DS emulator for Android with a dynarec. Right now the NDS emulator is in beta so there are many bugs and it runs slow. However, I'll try and update it frequently so it gets much better!\n\nWhat I've been working on\n\nRight now, the emulator emulates both CPUs on a single thread. First it emulates the ARM9 CPU for a while, then emulates the ARM9 CPU for a while. The problem is that switching between emulating the two is extremely slow, since I basically have to flush all the registers into memory and then reload them. \n\nI've been trying to emulate the CPUs on separate threads, but right now, there's two problems. Syncing the threads is way too slow. On the interpreter, which I'm using since it's much easier to debug, multithreading basically gives no performance improvement. I'm pretty sure this is caused by a bug in my code, since there's literally no possible way to write this faster. \n\nI'm using a spinlock, and using a bigger time slice causes certain images on the screen to flash, since the graphics hardware isn't being update enough. The other problem is that exophase's dynarec isn't exactly built for multiple threads. Each thread needs its own separate copy of each data structure, but the dynarec has global variables everywhere. \n\nI'm thinking of literally copy-pasting the code. So basically, if you didn't understand any of that, I've been rewriting a lot of code, and at least, in theory, it should give a big speed boost.\n\nDo not use save states as long term saves. Use in game saves instead. There is no guarantee that save states will work in later updates. In game saves will work. If someone emails me complaining that save states are broken in a later update, I'll just laugh and delete it.\n\nHow to play?\n\nSave your roms in the SD card and launch Dsoid. You will see a black screen showing the stuff in your device. This is the built in file explorer. Use the file explorer to navigate to your roms and select a rom to start playing! The touch button at the middle top of your screen enable/disable on screen control buttons. Refer to the FAQ should you have questions.\n\nWhat's in this version:\n\n-slightly faster\n-fixed some UI bugs\nCheck the main description to see what I've been working on. the description doesn't fit here.\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.qingping&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.qingping&lt;/a&gt;\n","torrent":{"xt":"urn:btih:6d68a9195fb8228a0abd4f5201cece91aad1fdb0","amp;dn":"Dsoid+v1.9.15","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d68a9195fb8228a0abd4f5201cece91aad1fdb0","infoHashBuffer":{"type":"Buffer","data":[109,104,169,25,95,184,34,138,10,189,79,82,1,206,206,145,170,209,253,176]},"announce":[],"urlList":[]}}