{"title":"Why Are We The Good Guys?: Reclaiming Your Mind From The Delusio","uid":8105101,"size":541440,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6d75a48bf54d1026c4f410a0d87f87a3140e1129&amp;dn=Why+Are+We+The+Good+Guys%3F%3A+Reclaiming+Your+Mind+From+The+Delusio&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"octubre","files":-1,"time":1360023287,"description":"Why Are We The Good Guys?\nReclaiming Your Mind From The Delusions Of Propaganda \nby David Cromwell\n\nA provocative challenge to the standard ideology that Western power is a benevolent force in the world.\n\n\nOne of the unspoken assumptions of the Western world is that we are great defenders of human rights, a free press and the benefits of market economics. Mistakes might be made along the way, perhaps even tragic errors of judgement such as the 2003 invasion of Iraq. But the prevailing view is that the West is essentially a force for good in the wider world. Why Are We The Good Guys? is a provocative challenge of this false ideology.\n\nDavid Cromwell digs beneath standard accounts of crucial issues such as foreign policy, climate change and the constant struggle between state-corporate power and genuine democracy. The powerful evidence-based analysis of current affairs is leavened by some of the formative experiences that led the author to question the basic myth of Western benevolence: from schoolroom experiments in democracy, exposure to radical ideas at home, and a mercy mission while at sea; to an unexpected encounter with former Foreign Secretary Robin Cook, the struggles to publish hard-hitting journalism, and the founding of Media Lens in 2001.","torrent":{"xt":"urn:btih:6d75a48bf54d1026c4f410a0d87f87a3140e1129","amp;dn":"Why+Are+We+The+Good+Guys%3F%3A+Reclaiming+Your+Mind+From+The+Delusio","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d75a48bf54d1026c4f410a0d87f87a3140e1129","infoHashBuffer":{"type":"Buffer","data":[109,117,164,139,245,77,16,38,196,244,16,160,216,127,135,163,20,14,17,41]},"announce":[],"urlList":[]}}