{"title":"Stossel.2013.08.08.[Battle of the Sexes].FBN.CF.avi","uid":8801426,"size":345840952,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6d7e2dafa798c6d2dd4e8f454545232d76da2487&amp;dn=Stossel.2013.08.08.%5BBattle+of+the+Sexes%5D.FBN.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"skJGZV6z","files":-1,"time":1376210598,"description":"----------\n\nSTOSSEL - [Battle of the Sexes] - Fox Business Network\n2013, August 8, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\nPAY GAP: Men get paid more than women. I separated the men and women in my studio audience and asked those with jobs to, anonymously, write down how much money they earned. For every dollar the men made, the women only made 83 cents. That's slightly more the national average of 77 cents.\n\nMartha Burk, author of &quot;Cult of Power: Sex Discrimination in Corporate America,&quot; calls that &quot;discrimination&quot;.\n\nWarren Farrell, author of &quot;Why Men Earn More,&quot; once agreed with Martha. He was on the board of the National Organization for Women. Then he dug deeper into the data and changed his mind.\n\nWomen make less because they make different choices.\n\nSabrina Schaeffer, Independent Women's Forum executive director, says feminists are wrong to think of women as victims. She says women can &quot;have it all.&quot;\n\nTITLE IX: Shawn Ladda, the former President of the National Association for Girls and Women in Sport, claims Title IX is what allows women to play sports in college. But now the law, because it requires gender equality, eliminates men's teams.\n\nBIOLOGY: Dr. Daniel Amen, author of &quot;Unleash the Power of the Female Brain,&quot; says men and women's brains are different. No matter how sex-neutral parents try to be, boys and girls will behave differently.\n\nEDUCATION: Dr. Leonard Sax, &quot;Boys Adrift&quot; author, says today's schools are toxic to boys.\n\nMYTHS: Is it true that women are bad drivers? Not really. Men drive faster than women, are more likely to speed, drive drunk, run stop signs, and they crash twice as often as women do. Based on that, you gotta say, women are better drivers.\n\nDo men cheat more than women? Yes. A Kinsey Institute study found 19 percent of women and 23 percent of men reported cheating. But the numbers are close. Cheating isn't just a guy thing.","torrent":{"xt":"urn:btih:6d7e2dafa798c6d2dd4e8f454545232d76da2487","amp;dn":"Stossel.2013.08.08.%5BBattle+of+the+Sexes%5D.FBN.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d7e2dafa798c6d2dd4e8f454545232d76da2487","infoHashBuffer":{"type":"Buffer","data":[109,126,45,175,167,152,198,210,221,78,143,69,69,69,35,45,118,218,36,135]},"announce":[],"urlList":[]}}