{"title":"Dan Stuart - The Deliverance of Marlowe Billings [2012][EAC,log,","uid":8128398,"size":258284864,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6df43822d3978e990bad8c8d6123eaebac1e6b4e&amp;dn=Dan+Stuart+-+The+Deliverance+of+Marlowe+Billings+%5B2012%5D%5BEAC%2Clog%2C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":15,"time":1360535419,"description":"Artist: Dan Stuart\nRelease: The Deliverance Of Marlowe Billings\nDiscogs: another not on discogs\nReleased: 2012\nLabel: Cadiz Records\nCatalog#: CADIZCD113\nFormat: FLAC / Lossless / Log (100%) / Cue / CD\nCountry: ?\nStyle: Rock, Alternative Rock, Folk Rock\n\n1 Can't be found\t\n2 Love so rare\t\n3 Gonna change\t\n4 Clean white sheets\t\n5 Love will kill you\t\n6 What are you laughing about?\t\n7 Gringo go home\t\n8 Gap toothed girl\t\n9 What can I say?\n10 Searching through the pieces\t\n11 Cetina's lamen\n\n\nDan Stuart, Poor Old Dan, Marlowe Billings, Dan Fucking Stuart... whatever you want to call him is back. Green on Red's former front man and main scribe is releasing The Deliverance of Marlowe Billings.\nThe Deliverance of Marlowe Billings will be Dan's first solo album to be released this century. His old band Green on Red were reluctant members of LA's Paisely Underground (Dream Syndicate, Bangles, Long Ryders etc.) before unintentionally inspiring the Alt-Country/Americana ghetto of Wilco, Ryan Adams, Calexico et al. Hell, Stuart and tour mate Steve Earle once took on half of London in a bar fight, but why no one really remembers. His songs have been covered by a wide spectrum from the cute punky pop Vivian Girls, literary miserabilists Richmond Fontaine, to the late great Jim Dickinson, not to mention the unfortunate Travis and Manic Street Preachers. He has written songs with Memphis soul legends Dan Penn and Spooner Oldham as well as ultra-wasp Loudon Wainwright III. Producers such as Al Kooper and Glyn Johns have all tried to tame him, to no avail.\n\nOkay, but just where the hell has Dan been?\n\nTaking a cue from F. Scott Fitzgerald, Stuart sat out the second act of his own play but has returned for the denouement. The Deliverance of Marlowe Billings details the implosion of an marriage and his subsequent escape from a NYC psychiatric facility to a planned suicide south of the border. Fortunately, the ancients had other plans, and walking in the footsteps of Traven, Lawrence &amp; Lowry, Stuart's demise was foiled by the simple beauty and preseverance of everyday life in Southern Mexico. Surrounded by the narco wars, endemic corruption and abject poverty, Stuart oddly enough found himself happy to be alive and relatively sane. After buying a battered handmade guitar from a retired mariachi, he emerged with a collection of songs that balanced his trademark sarcastic swagger and tough fear with a hard won fragility that can only be acquired by creeping to the edge and staring into the void. Surely, Stuart had crossed more than a mere border between countries, but the frontier between reason and madness itself.\nA walking contradiction and sin-eater to boot, Dan Stuart's songs have always asked more questions than they've answered, but really, aren't doubts all we got? What is certain is The Deliverance of Marlowe Billings was recorded in Italy and Los Angeles with the mighty Sacri Cuori and Dan is reported to be in great shape and spirits. Que un milagro!\n &lt;a href=&quot;\nhttp://dickthespic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:6df43822d3978e990bad8c8d6123eaebac1e6b4e","amp;dn":"Dan+Stuart+-+The+Deliverance+of+Marlowe+Billings+%5B2012%5D%5BEAC%2Clog%2C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6df43822d3978e990bad8c8d6123eaebac1e6b4e","infoHashBuffer":{"type":"Buffer","data":[109,244,56,34,211,151,142,153,11,173,140,141,97,35,234,235,172,30,107,78]},"announce":[],"urlList":[]}}