{"title":"Harakiri (1919).avi","uid":4121744,"size":735858688,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:70a11919bce00655c19ed9967b1cd262c12cd8fa&amp;dn=Harakiri+%281919%29.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"megalilo","files":1,"time":1207592517,"description":"Harakiri (1919)\n\nThe most difficult to see of the extant Fritz Lang films, &quot;Harakiri&quot; was believed lost until 1987, when a print was discovered in Amersterdam.\n\nFishing on the Mule, I came across this anonymous rip of what appears to be a much-dubbed VHS tape made from that original print, with vintage subtitles in Dutch. I don&amp;#039;t believe the film has been released commercially anywhere in the world; so this must be from a TV broadcast, or perhaps a cam job from the audience. In any case the image is NOT TERRIBLY GOOD -- but it is, however, an invaluable if imperfect representation of a film that remains beyond reach.\n\nThe Dutch subtitles are dense but the plot is easily followed if you&amp;#039;ve seen &quot;Madame Butterfly&quot;. Apparently, this was not a personal film for Lang (see below) but his his apparent in every shot, &quot;bringing out the hidden geometry of the image&quot; to borrow the phrase of a German critic.\n\nIn the 1918 / 1919 season, the Decla Film Company announced a film called &quot;Madame Butterfly&quot;, directed by Otto Rippert, to be shot in September 1918. But the film was not finished, and Rippert was hired to shoot the &quot;World Class Series&quot; films of Decla&amp;#039;s ambitious 1919 programme. When Rippert got behind schedule on the shooting of Decla&amp;#039;s most ambitious film of 1919, DIE PEST IN FLORENZ, Decla announced &quot;Butterfly&quot; again, now to be directed by Joseph Coenen, director of Decla&amp;#039;s &quot;Women Class Series&quot;. The Japanese settings were supposed to be shot on Decla&amp;#039;s new lot at Carl Hagenbeck&amp;#039;s zoological garden in Hamburg-Stellingen. Finally, the film now named HARAKIRI was shot by newcomer Fritz Lang, who was busy at Hagenbeck&amp;#039;s zoological garden anyway, shooting two parts of Decla&amp;#039;s &quot;Adventurer Series&quot; THE SPIDERS. Lang used some of the personnel of THE SPIDERS again: Lil Dagover, Paul Biensfeldt, Georg John, Rudolf Lettinger, Harry Frank. Dagover once again impersonated an exotic woman who dies at the end of the picture, this time the beautiful japanese O-Take-San, who commits suicide (hara-kiri). Long time presumed lost, a print of HARAKIRI was discovered in Amsterdam and restored by the Bundesarchiv-Filmarchiv Koblenz, so that in 1987, the film could be presented to the public again.\n\nIMDB: 7.8/10\n &lt;a href=&quot;\nhttp://imdb.com/title/tt0010208/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imdb.com/title/tt0010208/&lt;/a&gt;","torrent":{"xt":"urn:btih:70a11919bce00655c19ed9967b1cd262c12cd8fa","amp;dn":"Harakiri+%281919%29.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70a11919bce00655c19ed9967b1cd262c12cd8fa","infoHashBuffer":{"type":"Buffer","data":[112,161,25,25,188,224,6,85,193,158,217,150,123,28,210,98,193,44,216,250]},"announce":[],"urlList":[]}}