{"title":"Heaven is for Real: A Little Boy's Astounding Story of His Trip ","uid":8434835,"size":1677862,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:70dadd1b739e39bf6ed552f837230fc377ad5f35&amp;dn=Heaven+is+for+Real%3A+A+Little+Boy%27s+Astounding+Story+of+His+Trip+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1367596299,"description":"Heaven is for Real: A Little Boy's Astounding Story of His Trip to Heaven and Back By Todd Burpo, Sonja Burpo, Colton Burpo, Lynn Vincent\n2010 | 192 Pages | ISBN: 0849946158 | EPUB | 2 MB\n\n\n\nA young boy emerges from life-saving surgery with remarkable stories of his visit to heaven.\nHeaven Is for Real is the true story of the four-year old son of a small town Nebraska pastor who during emergency surgery slips from consciousness and enters heaven. He survives and begins talking about being able to look down and see the doctor operating and his dad praying in the waiting room. The family didn't know what to believe but soon the evidence was clear.\nColton said he met his miscarried sister, whom no one had told him about, and his great grandfather who died 30 years before Colton was born, then shared impossible-to-know details about each. He describes the horse that only Jesus could ride, about how &quot;reaaally big&quot; God and his chair are, and how the Holy Spirit &quot;shoots down power&quot; from heaven to help us.\nTold by the father, but often in Colton's own words, the disarmingly simple message is heaven is a real place, Jesus really loves children, and be ready, there is a coming last battle.\n","torrent":{"xt":"urn:btih:70dadd1b739e39bf6ed552f837230fc377ad5f35","amp;dn":"Heaven+is+for+Real%3A+A+Little+Boy%27s+Astounding+Story+of+His+Trip+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70dadd1b739e39bf6ed552f837230fc377ad5f35","infoHashBuffer":{"type":"Buffer","data":[112,218,221,27,115,158,57,191,110,213,82,248,55,35,15,195,119,173,95,53]},"announce":[],"urlList":[]}}