{"title":"HISTORY OF POP AND ROCK MUSIC - part 429","uid":7799702,"size":274204310,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:70dc9a773d8b63f372c654c1b6c539c353ae3c82&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+429&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pupovaczlatko","files":-1,"time":1352246773,"description":"                \n\n \n          \n                      PART  429\n\n\n\n            SYLVESTER  - You Make Me Feel (Mighty Real)  (1978)\n            SYLVESTER  -  Do You Wanna Funk  (1982)\n\n\n\n        &quot;You Make Me Feel (Mighty Real)&quot; is the title of a 1978 single by American disco singer Sylvester James, who performed using just his first name, Sylvester. The song was written by James Wirrick and Sylvester and appears on the singer's 1978 album, Step II.The song was Sylvester's first Top 10 hit in the United Kingdom, where it peaked at #8 on the UK Singles Chart in October 1978. In Sylvester's home country, the single was his second Top 40 hit, peaking at #36 on the Billboard Hot 100 chart in February 1979. The song also reached #20 on the Billboard Hot Soul Singles chart. A 12&quot; single was released in 1978, with &quot;Dance (Disco Heat)&quot; as the A-side and &quot;You Make Me Feel (Mighty Real)&quot; as the B-side, and these two extended dance mixes proved to be very popular in dance clubs at the time. The two songs held down the top spot on the Billboard Dance/Disco chart for six weeks in August and September 1978. These two songs helped to establish Sylvester's career as a noted disco and dance music performer, both in the U.S. and abroad.\n        &quot;Do Ya Wanna Funk&quot; is a dance song recorded by Sylvester. The song was released in 1982 and it was produced by Patrick Cowley, who incidentally died the same year. &quot;Do Ya Wanna Funk&quot; was mostly successful in Europe, especially Switzerland, Netherlands, Norway (where it became a top-10 hit) and even in the United Kingdom where it made the top 40. It also made the Top 30 in Australia.","torrent":{"xt":"urn:btih:70dc9a773d8b63f372c654c1b6c539c353ae3c82","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+429","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70dc9a773d8b63f372c654c1b6c539c353ae3c82","infoHashBuffer":{"type":"Buffer","data":[112,220,154,119,61,139,99,243,114,198,84,193,182,197,57,195,83,174,60,130]},"announce":[],"urlList":[]}}