{"title":"Thomas Merton - The Seven Storey Mountain (EPUB, MOBI, PDF)","uid":11977618,"size":3237507,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:714a763b4db55c02b57da170fffbb08fa88907f2&amp;dn=Thomas+Merton+-+The+Seven+Storey+Mountain+%28EPUB%2C+MOBI%2C+PDF%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ancapcatholic","files":5,"time":1433088399,"description":"A modern-day Confessions of Saint Augustine, The Seven Storey Mountain is one of the most influential religious works of the twentieth century. This edition contains an introduction by Merton's editor, Robert Giroux, and a note to the reader by biographer William H. Shannon. It tells of the growing restlessness of a brilliant and passionate young man whose search for peace and faith leads him, at the age of twenty-six, to take vows in one of the most demanding Catholic orders--the Trappist monks. At the Abbey of Gethsemani, &quot;the four walls of my new freedom,&quot; Thomas Merton struggles to withdraw from the world, but only after he has fully immersed himself in it. The Seven Storey Mountain has been a favorite of readers ranging from Graham Greene to Claire Booth Luce, Eldridge Cleaver, and Frank McCourt. Since its original publication this timeless spiritual tome has been published in over twenty languages and has touched millions of lives.\n\n--Reviews--\n\nIn 1941, a brilliant, good-looking young man decided to give up a promising literary career in New York to enter a monastery in Kentucky, from where he proceeded to become one of the most influential writers of this century. Talk about losing your life in order to find it. Thomas Merton's first book, The Seven Storey Mountain, describes his early doubts, his conversion to a Catholic faith of extreme certainty, and his decision to take life vows as a Trappist. Although his conversionary piety sometimes falls into sticky-sweet abstractions, Merton's autobiographical reflections are mostly wise, humble, and concrete. The best reason to read The Seven Storey Mountain, however, may be the one Merton provided in his introduction to its Japanese translation: &quot;I seek to speak to you, in some way, as your own self. Who can tell what this may mean? I myself do not know, but if you listen, things will be said that are perhaps not written in this book. And this will be due not to me but to the One who lives and speaks in both.&quot; --Michael Joseph Gross\n\nHarcourt is pulling out all the stops for this 50th-anniversary edition of Merton's spiritual masterpiece. In addition to the full text, this enhanced version includes an introduction by Merton's editor, Robert Giroux, and a reader's note by biographer and Thomas Merton Society founder Fr. William Shannon... Merton's faithful fans will be in seventh heaven over this glorious edition.\n\n\n--About the Author--\n\nThomas Merton (1915-1968) is arguably the most influential American Catholic author of the twentieth century. His autobiography, The Seven Storey Mountain, has millions of copies and has been translated into over fifteen languages. He wrote over sixty other books and hundreds of poems and articles on topics ranging from monastic spirituality to civil rights, nonviolence, and the nuclear arms race.\n\nAfter a rambunctious youth and adolescence, Merton converted to Roman Catholicism and entered the Abbey of Gethsemani, a community of monks belonging to the Order of Cistercians of the Strict Observance (Trappists), the most ascetic Roman Catholic monastic order.\n\nThe twenty-seven years he spent in Gethsemani brought about profound changes in his self-understanding. This ongoing conversion impelled him into the political arena, where he became, according to Daniel Berrigan, the conscience of the peace movement of the 1960's. Referring to race and peace as the two most urgent issues of our time, Merton was a strong supporter of the nonviolent civil rights movement, which he called &quot;certainly the greatest example of Christian faith in action in the social history of the United States.&quot; For his social activism Merton endured severe criticism, from Catholics and non-Catholics alike, who assailed his political writings as unbecoming of a monk.\n\nDuring his last years, he became deeply interested in Asian religions, particularly Zen Buddhism, and in promoting East-West dialogue. After several meetings with Merton during the American monk's trip to the Far East in 1968, the Dali Lama praised him as having a more profound understanding of Buddhism than any other Christian he had known. It was during this trip to a conference on East-West monastic dialogue that Merton died, in Bangkok on December 10, 1968, the victim of an accidental electrocution. The date marked the twenty-seventh anniversary of his entrance to Gethsemani.\n\n\nPlease seed!\n\nFor more Catholic ebooks, audiobooks, audio presentations, movies &amp; video, visit &lt;a href=&quot;\nhttps://thepiratebay.se/user/ancapcatholic/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/user/ancapcatholic/&lt;/a&gt;\n\nâ–ˆâ–€â–€â–€â–€â–€â–ˆ â–„â–„ â–ˆâ–€â–„â–€ â–€   â–„â–„â–€â–„â–ˆâ–„â–„â–€â–ˆ â–ˆâ–€â–€â–€â–€â–€â–ˆ\nâ–ˆ â–ˆâ–ˆâ–ˆ â–ˆ  â–„â–ˆâ–ˆ â–€â–€ â–„â–„ â–€â–„â–€â–„ â–€ â–„â–„â–€ â–ˆ â–ˆâ–ˆâ–ˆ â–ˆ\nâ–ˆ â–€â–€â–€ â–ˆ â–„â–€â–ˆâ–„â–ˆ â–€â–ˆâ–„â–ˆâ–„ â–ˆâ–ˆ â–ˆâ–€ â–„â–€  â–ˆ â–€â–€â–€ â–ˆ\nâ–€â–€â–€â–€â–€â–€â–€ â–ˆâ–„â–€â–„â–€ â–€ â–€ â–ˆâ–„â–€â–„â–€â–„â–ˆ â–€ â–€ â–€â–€â–€â–€â–€â–€â–€\nâ–„   â–ˆâ–ˆâ–€â–€â–„â–€ â–€â–ˆâ–„â–„â–€â–€ â–€  â–„ â–ˆâ–€  â–€â–ˆ â–€â–€â–„ â–„â–ˆ \nâ–€ â–ˆâ–ˆ  â–€â–ˆâ–ˆâ–ˆâ–€â–ˆâ–„â–ˆâ–€â–ˆâ–€â–ˆâ–ˆâ–€â–ˆâ–ˆâ–ˆâ–ˆ â–€ â–ˆ â–€â–„â–€ â–€â–ˆâ–„ \nâ–ˆâ–ˆ â–€â–ˆâ–€â–€ â–€â–€â–„â–„â–ˆâ–ˆâ–€â–€ â–€â–€ â–€â–€â–ˆâ–„  â–€â–€â–„â–€â–€ â–„â–€â–€â–ˆâ–ˆ\nâ–ˆâ–„ â–ˆâ–„â–ˆâ–€â–„â–ˆ â–€â–ˆ â–ˆâ–ˆ  â–ˆâ–ˆâ–ˆâ–ˆ  â–ˆ   â–€â–„â–„â–ˆâ–€â–„â–€â–„ â–„\n â–„â–ˆ  â–„â–€â–ˆâ–„â–ˆâ–ˆâ–€â–€â–„â–ˆ  â–€â–€â–€â–€ â–„â–ˆâ–€â–ˆ â–„â–€â–ˆâ–ˆâ–€â–ˆ â–ˆ â–€\nâ–„â–„â–€â–„â–€ â–€â–€ â–„    â–ˆ  â–ˆâ–ˆâ–ˆâ–ˆ  â–ˆ â–€ â–ˆ â–ˆâ–„ â–„â–„â–ˆâ–„â–„\nâ–€â–ˆâ–„â–„  â–€â–€â–€ â–ˆâ–„â–ˆâ–„â–ˆ  â–ˆâ–ˆâ–ˆâ–ˆ  â–ˆâ–„â–ˆâ–„â–„â–„â–€â–€â–€â–„â–€â–€â–„ \nâ–€â–ˆâ–ˆ â–€ â–€â–€â–„â–„ â–„â–ˆâ–ˆâ–„â–„ â–„â–„ â–„â–„â–ˆâ–ˆâ–„  â–ˆâ–„â–€â–€â–„  â–ˆâ–€ \nâ–„â–ˆ â–€â–„â–€â–€â–„ â–€â–ˆâ–„â–„â–ˆâ–„â–ˆâ–„â–ˆâ–ˆâ–„â–ˆâ–„â–€ â–„â–ˆâ–ˆâ–€â–„â–„â–€ â–„ â–ˆâ–ˆâ–€\n  â–„â–€â–„â–€â–€â–ˆâ–ˆâ–€â–ˆâ–„â–€ â–€ â–„â–„ â–ˆâ–€â–ˆâ–ˆâ–ˆâ–€ â–„â–ˆ  â–ˆâ–€ â–€â–„â–€ \nâ–€â–€ â–€â–€ â–€ â–ˆâ–„ â–€â–ˆâ–„â–„â–„ â–„â–„â–€â–ˆâ–€ â–„â–„â–ˆâ–„ â–ˆâ–€â–€â–€â–ˆâ–€â–ˆâ–„ \nâ–ˆâ–€â–€â–€â–€â–€â–ˆ â–ˆâ–€ â–€â–ˆâ–„ â–€â–ˆ â–ˆâ–ˆâ–ˆâ–„â–ˆâ–€ â–€â–ˆ â–ˆ â–€ â–ˆ â–ˆâ–ˆâ–„\nâ–ˆ â–ˆâ–ˆâ–ˆ â–ˆ â–€ â–„â–„â–„â–„â–„â–€â–ˆâ–€â–€â–„â–ˆâ–„â–€â–€â–€â–€ â–„â–€â–ˆâ–ˆâ–€â–ˆâ–€â–€â–€ \nâ–ˆ â–€â–€â–€ â–ˆ  â–„â–€â–„â–€â–ˆâ–„â–ˆâ–„â–„â–€ â–€â–ˆâ–€ â–„â–€â–„â–ˆ â–€â–€â–€ â–€â–„â–ˆ \nâ–€â–€â–€â–€â–€â–€â–€  â–€ â–€ â–€â–€â–€â–€â–€â–€â–€ â–€ â–€   â–€ â–€  â–€  â–€â–€\nBTC:1N3Y2HNWe3xWY4qdYricHRKz58zqqi5MZp","torrent":{"xt":"urn:btih:714a763b4db55c02b57da170fffbb08fa88907f2","amp;dn":"Thomas+Merton+-+The+Seven+Storey+Mountain+%28EPUB%2C+MOBI%2C+PDF%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"714a763b4db55c02b57da170fffbb08fa88907f2","infoHashBuffer":{"type":"Buffer","data":[113,74,118,59,77,181,92,2,181,125,161,112,255,251,176,143,168,137,7,242]},"announce":[],"urlList":[]}}