{"title":"Paul McCartney and Michael Jackson - Say, Say, Say","uid":4759953,"size":175540228,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:71f73d2224238f570bb396d397236096539fa494&amp;dn=Paul+McCartney+and+Michael+Jackson+-+Say%2C+Say%2C+Say&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"2nafish","files":-1,"time":1236653965,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Say Say Say&quot; is a song by Michael Jackson and Paul McCartney. The track was written by the duo, and produced by George Martin for McCartney's fifth solo album, Pipes of Peace (1983). The song was the pair's second duet, following &quot;The Girl Is Mine&quot; for Jackson's Thriller (1982). Recorded during McCartney's &quot;War sessions&quot;, the single became Jackson's seventh top ten hit in a year, upon it's release in October, 1983. &quot;Say Say Say&quot; was a number one hit in the US, peaking at number two in the UK. Number one in Canada, Finland, Italy, Norway and Sweden, the single peaked within the top ten of Austria and New Zealand.\n\nCertified platinum by the Recording Industry Association of America, the song was promoted with a music video directed by Bob Giraldi. The video, filmed in Santa Ynez Valley, California, featured cameo appearances by Linda McCartney, LaToya Jackson and Mr. T. The short film introduced dialogue and storylines to music videos, and centered around two con artists, &quot;Mack and Jack&quot;. Upon it's release, the video was considered too violent by the National Coalition of Television Violence. &quot;Say Say Say&quot; was covered by the Dutch music group Hi-Tack in early 2006. They took the song to number four on the UK singles chart.\n\nDirected by Bob Giraldi, the director of &quot;Beat It&quot;, the music video for &quot;Say Say Say&quot; featured cameo appearances by Linda McCartney, LaToya Jackson and Mr. T. Filmed in Santa Ynez Valley, California, McCartney had to fly out to Jackson; the latter's schedule was busy. As &quot;Mack and Jack&quot;, the duo play a pair of conmen selling a &quot;miracle potion&quot;. The salesman (McCartney) offers Jackson the potion, claiming it's &quot;guaranteed to give you the strength of a raging bull&quot;. Jackson drinks the potion and challenges a large man, also in on the scam, to an arm wrestle. Upon Jackson winning the arm wrestle, the crowd surges forward, hoping to buy the magical potion. With the money earnt from the scam, Mack and Jack donate it all to an orphanage. In their hotel, Jackson enters the bathroom while McCartney is shaving. He playfully dabs foam on his own cheek, despite not needing a shave. McCartney and Jackson then star as vaudeville performers singing and dancing at a bar. Jackson's love interest, with whom he flirts, was played by his sister LaToya. Before taking to the stage, the duo appear in blackface makeup. The video ends with Paul, Linda and Michael driving off into the sunset. LaToya, handed a bunch of flowers by McCartney, is left at the roadside.\n\nGiraldi said of the duo, &quot;Michael didn't outdance Paul, and Paul didn't outsing Michael&quot;. He added that making the video was hard work, &quot;The egos could fill a room&quot;. The video introduced both dialogue and storyline, an element extended upon in Thriller. Upon it's release, the National Coalition of Television Violence classified the music video as too violent to be aired. They also classified Thriller and more than half of the 200 videos surveyed from MTV as being overtly violent. The Manchester Evening News later described the video as &quot;anarchic caper&quot; that &quot;plays out like an Emir Kusturica feature&quot;. PopMatters stated that the music video turns &quot;a pair of otherwise forgettable songs into something worth watching&quot;. The video was later included on the McCartney DVD, The McCartney Years.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:71f73d2224238f570bb396d397236096539fa494","amp;dn":"Paul+McCartney+and+Michael+Jackson+-+Say%2C+Say%2C+Say","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71f73d2224238f570bb396d397236096539fa494","infoHashBuffer":{"type":"Buffer","data":[113,247,61,34,36,35,143,87,11,179,150,211,151,35,96,150,83,159,164,148]},"announce":[],"urlList":[]}}