{"title":"Modern Principles Microeconomics Edition 2.pdf","uid":8860310,"size":10882162,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:71fc92179356573b687b0ebaa4824a0ff6b4dff9&amp;dn=Modern+Principles+Microeconomics+Edition+2.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1377757819,"description":"ISBN: 1464119325\nISBN-13: 9781464119323\nEdition: 2\nPub. Date: April 2012\nPublisher: Worth Publishers, Incorporated\nPages: 551\n\nThere's a common view that &quot;all micro texts are the same,&quot; but we believe that innovation is possible!  We offer a whole chapter on incentive design, with many business and real world applications from choosing salaries or piece rates to setting up an ideal tournament.  Business applications are also extensive in our chapter on price discrimination, which covers tying and bundling as well as direct price discrimination.  We cover political economy extensively and also have a whole chapter on normative judgments; it covers the assumptions behind cost-benefit analysis, the idea of a Pareto improvement, and the different ethical judgments that have been used to praise or condemn economic reasoning. \n \nWe knew that our efforts to reflect modern microeconomics would be wasted if we reached only a small percentage of the students. We had to make the material simpler, more compelling, and more intuitive. We had to bring economic reasoning to life.\n \nWe also knew that we were writing for a generation that doesn't always have the patience for slow delivery.  We had to get to the point.\n \nThose are just some of the reasons why we call our text Modern Principles: Microeconomics.  We have taken modern advances in economics and we have integrated them throughout the text. We are unabashedly enthusiastic about economics and we work hard to enthuse students with the economic way of thinking so that they too internalize it for the rest of their lives.  We hope you will see that this text provides the best coverage of what it means to think like an economist.","torrent":{"xt":"urn:btih:71fc92179356573b687b0ebaa4824a0ff6b4dff9","amp;dn":"Modern+Principles+Microeconomics+Edition+2.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71fc92179356573b687b0ebaa4824a0ff6b4dff9","infoHashBuffer":{"type":"Buffer","data":[113,252,146,23,147,86,87,59,104,123,14,186,164,130,74,15,246,180,223,249]},"announce":[],"urlList":[]}}