{"title":"Rebel Country Masters [1958 - 1982] 2 Disc","uid":8958607,"size":126639360,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:723842c7cb13693766f393bf5cb0759d4447bca2&amp;dn=Rebel+Country+Masters+%5B1958+-+1982%5D+2+Disc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"edsel65","files":32,"time":1380054145,"description":"This is my hand picked collection, sampling 32 of the greatest country artists/bands that have ever graced this planet. It includes one song by each artist, and none of it are the famous hits, because that stuff is too easy to find. All of these musicians have songs just as good, if not usually better than their more famous songs. These are deep cuts by the best of the best.\n\nThis is the platinum age of country. It all changed in the late 70's and there has never been music like this since then. It lost the punch, the foot stompin, the hot licks, and just that good ole time rebel/outlaw classic country sound. It was completely abandoned and forgotten. Only those who know the true country sound is either 60 - 80 years old, or just have been lucky enough to stumble upon it... like you.\n\nIncluded in the 32 featured bands are Ernest Tubb, Buck Owens, Johnny Bond, Little Jimmy Dickens, Loretta Lynn, Commander Cody, Del Reeves, New Riders of the Purple Sage, Johnny Cash, Dave Dudley, Porter Wagoner and much more.\n\nThank you for your great taste in music! Please spread the word of these countless genius musicians that have been completely forgotten! Country music will be resurrected!","torrent":{"xt":"urn:btih:723842c7cb13693766f393bf5cb0759d4447bca2","amp;dn":"Rebel+Country+Masters+%5B1958+-+1982%5D+2+Disc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"723842c7cb13693766f393bf5cb0759d4447bca2","infoHashBuffer":{"type":"Buffer","data":[114,56,66,199,203,19,105,55,102,243,147,191,92,176,117,157,68,71,188,162]},"announce":[],"urlList":[]}}