{"title":"This Day Burns mp3","uid":8845965,"size":59277276,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:72c6e2fc544e4cf61b686afb43be5173f7fd7ca1&amp;dn=This+Day+Burns+mp3+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Fisthat","files":7,"time":1377385758,"description":"Since the formation of This Day Burns in 2010, they have released a 6 song self-titled record and played numerous Vancouver Island shows.\n\nThey have shared the stage with bands such as Death By Stereo and Vancouver based Ninjaspy. This Day Burns was also featured in Live n' Unsigned's Victoria Top 3 Bands for May 2013.\n\nThis Day burns was formed in summer of 2010 in the wake of Victoria based hard-rock band Saul.\n\nBand members Chris Heretic and Jon Sinclair found bassist Matt Williams, (Funk Vigilante) and then vocalist Jasmine Wietzke (Before the Storm) through a craigslist ad she posted. A few jams later, they solidified the line-up and decided it was time to move forward.\n\nThis Day Burns singer/bassist/drummer/guitarist Matt Williams decided to leave the band to pursue other goals in May of 2013. It was not long before Skye McLean (Robot Metropolis, Archon Legion) was approached by the band and added to the ranks.\n\nThe band hopes to continue to write and record music in smaller batches, releasing music more frequently to stay fresh and exciting in a fast-moving and ever changing industry.\n\nThis Day Burns work ethic, variety of sound and adaptable live show will make them a band to watch as they grow and progress.","torrent":{"xt":"urn:btih:72c6e2fc544e4cf61b686afb43be5173f7fd7ca1","amp;dn":"This+Day+Burns+mp3+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72c6e2fc544e4cf61b686afb43be5173f7fd7ca1","infoHashBuffer":{"type":"Buffer","data":[114,198,226,252,84,78,76,246,27,104,106,251,67,190,81,115,247,253,124,161]},"announce":[],"urlList":[]}}