{"title":"VA - 2012 - ...First Came Memphis Minnie FLAC","uid":9378193,"size":278182395,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:72dba7ff9b4caee53c371e9f6559cdafe62fab7d&amp;dn=VA+-+2012+-+...First+Came+Memphis+Minnie+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eika256","files":-1,"time":1387658000,"description":"VA - 2012 - ...First Came Memphis Minnie\n\nThis set has been announced as Maria Muldaur's 40th album, which it is, since she conceived of it and produced it, but it's actually a tribute to the guitar-playing blues great Memphis Minnie, and several of the tracks that Muldaur sings on here have been previously released, including previously released tracks of Memphis Minnie songs that Muldaur cut with Alvin Youngblood Hart, Del Rey, Roy Rogers, and Steve James. There are also classic tracks from Phoebe Snow and Koko Taylor included, again previously released, along with new recordings for this tribute done by Bonnie Raitt, Rory Block, and Ruthie Foster. So, it's not like this is a new Maria Muldaur album, but then it's Muldaur's baby, a loving tribute to a one-of-a-kind blues artist. Muldaur has been singing Memphis Minnie songs (and Minnie wrote or adapted over 200 songs throughout her career, which lasted from the 1920s until the mid-'50s) since her career began in the 1960s, including Muldaur's signature take on &quot;Tricks Ain't Walkin'&quot; (the song was actually written by Lucille Bogan, but Minnie made it her own, as she did everything she touched), included here in a version with Del Rey and Dave Earl helping out on guitar and mandolin, respectively. There's nothing fancy here -- the productions are sparse and appropriate, and even though tracks came from different sources and directions, they all fall together into a nice flow. (AllMusic)\n\nTrack list:\n01 - Maria Muldaur - Me and My Chauffeur Blues (with Roy Rogers)\n02 - Bonnie Raitt - Ain't Nothin' in Ramblin' (with Steve Freund)\n03 - Maria Muldaur &amp; Alvin Youngblood Hart - I'm Going Back Home\n04 - Maria Muldaur - I'm Sailin' (with Del Rey &amp; Steve James)\n05 - Rory Block - When You Love Me\n06 - Maria Muldaur - Long As I Can See You Smile (with Del Rey, Roly Salley &amp; Steve James)\n07 - Maria Muldaur - Lookin' the World Over (with Del Rey &amp; Steve James)\n08 - Phoebe Snow - In My Girlish Days\n09 - Maria Muldaur &amp; Alvin Youngblood Hart - She Put Me Outdoors\n10 - Ruthie Foster - Keep Your Big Mouth Closed\n11 - Maria Muldaur - Tricks Ain't Walkin' (with Del Rey &amp; Steve James)\n12 - Maria Muldaur - Crazy Cryin' Blues (with Del Rey &amp; Steve James)\n13 - Koko Taylor - Black Rat Swing\n\nEnjoy and share!","torrent":{"xt":"urn:btih:72dba7ff9b4caee53c371e9f6559cdafe62fab7d","amp;dn":"VA+-+2012+-+...First+Came+Memphis+Minnie+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72dba7ff9b4caee53c371e9f6559cdafe62fab7d","infoHashBuffer":{"type":"Buffer","data":[114,219,167,255,155,76,174,229,60,55,30,159,101,89,205,175,230,47,171,125]},"announce":[],"urlList":[]}}