{"title":"Hitman Codename 47 (CloneCD)","uid":3610513,"size":329337301,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7460e5932eeedfc0992ad838e2a42f8898cb980c&amp;dn=Hitman+Codename+47+%28CloneCD%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Evil Bastardo","files":1,"time":1170572295,"description":"\n\n                           Hitman: Codename 47\n\n                         Torrent By Evil Bastardo\n\n\n   The very first in the Hitman Series from Eidos Interactive. A very excellent\ngame, from the makers of Tomb Raiders and many others, only available for PC.\nSystem requirements are relatively low by today&amp;#039;s standards, but still the graphics and sound are awsome. I absolutely love the Hitman series, and have played through this particular one so many times that I composed my own walk- through to complete every mission and get all weapons. The last time I played through on the hardest difficulty level, I found I had to make some changes to my walkthrough to include different strategies.\n\n   Included in this Pack: 1) CloneCD Image files of Hitman: Codename 47 V.1.0 (1 CD), with Official Patch from IO Interactive, and No CD crack files for Patched and unpatched versions, included on the CD. (I did not crack this game myself, but got the files from www.megegames.com. I left the info files intact with the crack files so credit can be given where credit is due. Props to the peeps who really do this shit!) 2) The Hitman Font, Put a hit on your text docs. (Downloaded from the website www.hitmanforum.com. A Hitman Devoted website, for news, trailers, wallpaper, demos, Chat &amp; more.) 3) Official and Fan art Hitman wallpapers for your desktop from all Hitman Games. (Also downloaded from www.hitmanforum.com.) 4) My Walkthrough, in case you get stuck. (Written and composed By Me, and can be found on www.supercheats.com among others) 5) CD Case cover (slim front only) and CD Face JPEGs, for use with various label making software.\n\n   Directions: 1) Unpack CloneCD Files\n              2a) Burn with Application compatible with .cue and .img files.\n                  (Slysoft CloneCD [Image files were made with this], PowerISO,                   Alcohol 120%, Nero and probably others)\n              2b) Or, Mount in Virtual Drive compatible with .cue and .img                   files. (PowerIso [works best for me], Daemon Tools, Alcohol                     120% and probably many others)\n               3) Install game.\n              4a) Copy Crack Content from folder on CD to game directory on                       Harddrive (C:/Program Files/Eidos Interactive/Hitman...)\n              4b) Or, Run Patch from folder on CD, Then Copy crack files from                     folder on CD to game directory on harddrive.\n               5) Unpack Archived Font and picture files to your Windows                          folder on your harddrive.\n               6) Have fun as Agent 47, Contract Killer for hire.                                 The more mayhem, the merrier!","torrent":{"xt":"urn:btih:7460e5932eeedfc0992ad838e2a42f8898cb980c","amp;dn":"Hitman+Codename+47+%28CloneCD%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7460e5932eeedfc0992ad838e2a42f8898cb980c","infoHashBuffer":{"type":"Buffer","data":[116,96,229,147,46,238,223,192,153,42,216,56,226,164,47,136,152,203,152,12]},"announce":[],"urlList":[]}}