{"title":"Anberlin - Vital (2012) [24 bit FLAC] vinyl","uid":8166032,"size":1851883618,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:74919c98d783651e150526d67f6b98c9f31fd30a&amp;dn=Anberlin+-+Vital+%282012%29+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"24.96","files":-1,"time":1361336686,"description":"  Anberlin - Vital (2012) [24 bit FLAC] vinyl\n\n  Released: 2012\n  Duration: 42:53\n  Genre: Pop/Rock\n  Style: Alternative, Emo\n  Codec: FLAC\n  Bit Rate: ~ 5,800 kbps\n  Bits Per Sample: 24\n  Sample Rate: 192,000 Hz\n\n  01. Self-Starter (3:18)\n  02. Little Tyrants (3:21)\n  03. Other Side (4:06)\n  04. Someone Anyone (3:28)\n  05. Intentions (3:09)\n  06. Innocent (4:18)\n  07. Desires (3:06)\n  08. Type-Three (3:57)\n  09. Orpheum (3:50)\n  10. Modern Age (4:13)\n  11. God, Drugs &amp; Sex (6:15)\n\n  Moving on from the breakthrough emo-pop sound the band showcased on 2010's Brendan O'Brien-produced Dark Is the Way, Light Is a Place, Anberlin's 2012 effort, Vital, features a heavier metal and electronica-infused sound. Once again centered around the passionate, resonant vocals of Stephen Christian and paired with longtime producer Aaron Sprinkle, this is an ambitious, arena-ready album that, while still reflecting the band's knack for melody, reveals a bent toward bombastic, electronic-tinged hard rock. Although Anberlin have never shied away from angular sounds, much of the band's previous work revealed a mix of sparkling, U2-style uplift and plaintive, Paramore-style emo. On Vital, Anberlin amp it up, bringing the group closer to the grinding, anthemic approach of Muse or even heavier acts like Tool. In that sense, one wonders if the move is a consciously retro one, with an eye toward the '90s heyday of alt-rock radio when bands like the Smashing Pumpkins -- with whom Anberlin toured for this album -- as well as Filter, Soundgarden, and Garbage ruled the airwaves. Whatever the reasons behind the change, Vital features some of the band's most vitriolic and impassioned-sounding work, and cuts like the propulsive &quot;Little Tyrants&quot; and the equally driving &quot;Someone Anyone&quot; are infectious, fist-pumping anthems that address themes of war, anger, and desperation. Which isn't to say the album is a homogeneously dark vision. On the contrary, there is a strong electronic thread running through many of the tracks, and songs like the sparkling, delicate ballad &quot;Innocent,&quot; the moody &quot;Other Side,&quot; and the epic &quot;Orpheum&quot; -- purportedly inspired by the Arab Spring -- mix the group's layered guitar attack with shimmery synth lines and programmed rhythmic backgrounds. Ultimately, while Vital is Anberlin's most challenging album to date, as the title implies, it is perhaps the band's most rewarding album.","torrent":{"xt":"urn:btih:74919c98d783651e150526d67f6b98c9f31fd30a","amp;dn":"Anberlin+-+Vital+%282012%29+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74919c98d783651e150526d67f6b98c9f31fd30a","infoHashBuffer":{"type":"Buffer","data":[116,145,156,152,215,131,101,30,21,5,38,214,127,107,152,201,243,31,211,10]},"announce":[],"urlList":[]}}