{"title":"Eric Hufschmid - Dishonest Scientists Are Just Educated Monkeys","uid":4756115,"size":19088544,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:75e09bef2192e985cea048dee64442385dcb33cb&amp;dn=Eric+Hufschmid+-+Dishonest+Scientists+Are+Just+Educated+Monkeys&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Hufschmid_Jr","files":-1,"time":1236460259,"description":"The Topic Of Todays Study Is:\n\n* We Need Scientists We Can Trust.\nDishonest Scientists Are Just Educated Monkeys, Or Scholarly Criminals.\nWe Assume That Scientists Are Intelligent People Who We Can Look To For Advice, But We're Not Going To Get Sensible Advice From An Educated Monkey. \n\n\n* Most People Are Mentally Incompetent, Irresponsible, And Extremely Selfish.  Adult Men Who Cannot Carry On A Serious Discussion About 9/11 Or The Holocaust Should Be Classified As Mentally Disturbed.\n\n\n* Philosophy Of The Pirate Bay?:\nThe Purpose Of Royalties Is To Allow People Who Produce Intangible Entertainment Products To Make A Living, But Many Entertainment Companies Are Doing More Than Merely Making A Living.\nSteven Spielberg And Howard Stern Are Selfish Animals Who Are Never Satisfied No Matter How Much Money They Have.\n\n\n* Most People Live In A Fantasy World.\nPeople Who Live In A Fantasy World Are Causing Trouble Because Instead Of Seriously Analyzing Problems, They Ignore Reality And Tell Themselves Whatever Makes Them Feel Good, Such As The Iraq War Is Helping Iraq.\n &lt;a href=&quot;\nhttp://www.erichufschmid.net/Hufschmid-26Mar2008.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.erichufschmid.net/Hufschmid-26Mar2008.html&lt;/a&gt;\n\n-------------------------------------------------------------------------------------\n------------------------------------------------------------------------------------\n\nA Partial Of The Audio Transcript:\n\nA few people have been asking me when I'll create another audio file. To help you understand my situation, since I'm almost completely ignored by the media and people on the Internet, I don't know what to talk about next, or if I should clarify something I've already spoken about, so I just wait for something to inspire me.\n\nI've been in business for myself since 1991, and I've been making software for industries. The other day somebody who works at a large corporation called me to complain that the old Microsoft DOS version of my software wasn't working any longer. He told me that he's been working at the company for 13 years, and that my software was there when he arrived, and he has no idea where the original disk is.\n\nOur economic system was never designed for software. Businesses have to sell products in order to survive, but it's not easy to sell software because the human mind has a resistance to purchasing products that are intangible. \n\n My proposal to allow the government to support software companies would probably frighten a lot of people because there's currently a widespread fear and disgust of government. However, a government is just an organization of people, so whether a government is useful or dangerous depends on which people we put into it, and how we design the government.\n\nMany people claim that governments are inherently dangerous because everybody will become corrupt when put into a position of leadership, but that theory is ridiculous, as I explained in my audio file for November 3, 2007. Our governments are crummy because the majority of voters consistently make terrible decisions. \n\nMost voters all over the world are still refusing to face the fact that the 9/11 was an Israeli false flag operation. And even fewer people can look at the evidence that Jews were responsible for the world wars and they're lying to us about the Holocaust and the Apollo moon landing. Most people are mentally incompetent, irresponsible, and extremely selfish. Women and children are submissive, so we have to expect them to ignore world problems.\n\nAll of us who have tried to discuss 9/11 or the Holocaust have been shocked that the majority of men absolutely refuse to face reality. If only a minority of people had this mental disorder, then we could dismiss it as a genetic defect, but since the majority of people have this problem, this is evidence that the human mind was never designed to face reality.\n\nMy assumption as to why the human mind has this problem is that it has never before been necessary for humans to face reality. In fact, thousands of years ago the people who created a fantasy world for themselves probably had an advantage. For example, when a spouse or child died, the sad and confused people could comfort themselves by imagining that only his body is dead, and that he's actually still alive but in another, more wonderful area of the universe. When people were lonely, they could talk to imaginary friends, or they could talk to the ghosts of their friends. And if people were frightened about dying from lack of food, or when they became lost in the forest, it probably helped them to remain calm by imagining that a loving god was watching over them and protecting them. \n\n\nToday, however, this tendency to create a fantasy world is extremely detrimental. The people who refuse to face reality are allowing phenomenal crimes, and organized crime gangs, and wars. And they are easily manipulated by people who claim to speak for their particular fantasy god, or by the people who claim to have contact with the ghosts of their dead relatives. And these people are so out of touch with reality that they don't notice that their political candidates are not even close to being appropriate as world leaders.\n\nThe majority of people enjoy believing in ghosts, leprechauns, devils, gods, angels, and other fantasies. This behavior may have been beneficial 10,000 years ago, but it's unacceptable for this modern era. We have to face the fact that many of the mental qualities that were useful ten thousand years ago are detrimental in this modern world. Humans today have to be more than intelligent monkeys. The qualities that brought humans to this modern era are not the qualities that we need for the future. We are no longer living like animals, and so animal behavior is no longer acceptable.\n\nHave you ever noticed how many people are withdrawn into fantasies? The University of Kansas has a Center For The Study Of Science Fiction, and its been there since 1982. The director of the Center, Professor James Gunn, was recently awarded the silly title &quot;Damon Knight Memorial Grand Master&quot; He was given that title by the organization called Science Fiction And Fantasy Writers Of America, Inc. This behavior reminds me of when I was in elementary school.\n\nA significant percentage of our population is living in a make-believe world. The adult men seem to prefer science-fiction, cowboy, or religious fantasies. I suspect that we would help the world tremendously simply by restricting voters to the men who are capable of having serious discussions about 9/11, the Holocaust, and the Apollo moon landing. \n\nIn my previous audio file I suggested that society be in control of corporations, rather than the stockholders. If we combine that concept with the concept of restricting income, we could reduce the income of everybody in a corporation to a sensible level. A few decades ago the typical business executive was making about 20 times as much as the ordinary worker. Why do we need any more of a difference than that? Actually, we don't even need that much of a difference.\n\nIt's possible that some of today's businessmen would have a temper tantrum and refuse to be businessmen if they were not allowed the opportunity become billionaires, but my attitude is, so what? The men who refuse to run a business for a reasonable income should be pushed aside. There are lots of people willing to run a business for a sensible income. We don't need businessmen who work only if we provide them with a gigantic mechanical rabbit to chase after. Those type of men should be regarded as intelligent dogs. \n\nthe billionaires seem to be using their money to expand their crime network. The Rothschild family, for example, gave funding to the Rockefeller family. Paul Allen, who became wealthy by working with Bill Gates of Microsoft, provided financial backing for Steven Spielberg, Jeffrey Katzenberg and David Geffen to create the movie company DreamWorks.\n\nThe billionaires also create philanthropies, and this creates the impression that they want to help society, but I don't see any society improving from their philanthropies. Some of their donations seem to be to satisfy their own particular fantasies, such as when Paul Allen gave the city of Seattle a Science Fiction Museum. But some of the philanthropies appear to be deliberate attempts to manipulate schools and promote Jewish propaganda. A good example are the donations to the Public Broadcasting Service. They recently broadcast a television show called Bush's War. This is an attempt by the Jews to blame the Iraq war on George Bush. A more honest television program would have described it as Israel's War. And the Public Broadcasting Service should be referred to as the Jewish Propaganda Service. \n\nBy preventing people from becoming extremely wealthy, we can significantly reduce the problem of criminals who use their money to expand their network.\n\nBy the way, most of the so-called &quot;truth seekers&quot; are trying to convince us that only a small number of Jews are involved in this crime network, and that the majority of Jews are innocent victims, just like you and me. But there's no way only a few thousand Jews could be producing so much propaganda in so many nations, and there's no way only a few thousand Jews could be manipulating so many schools, businesses, government officials, and police departments all over the world. We're suckers if we don't assume every Jew is guilty until proven innocent. \n\nBesides, the Jews don't care about the innocent Goyim, so why should we care about the innocent Jews? The innocent Jews can either do something to help us, or be considered as guilty as the other Jews. An innocent Jew who does nothing to help us is not truly innocent. \n\nOur governments are already cheating us on a routine basis, so if we were to create an agency to supervise software development, we can be sure that it would be as dishonest as the FBI, the FDA, and other corrupt agencies. We can be certain that the agency would give money to their friends and cheat the businesses that they didn't like or who were not part of their crime network. And they might also secretly fund software to aid them in false flag operations, or crimes in banking or the stock markets. \n\nBillions of dollars are wasted every year around the world on security cameras, guns, X-ray equipment at airports, and other types of crime prevention, but it's not doing anything to reduce crime. The reason is because crime is not caused by a shortage of security devices. It's caused by the human mind. No matter what type of security system we develop, it will be defeated. In order to reduce crime, we have to deal with people. There's no sense wasting any more money or engineering talent on crime prevention technology. We have to deal with the fact that most of the population simply can't cope with the modern world. They can't control their emotions; they can't think very well; and most of them refuse to face reality.\n\nWe can dress a monkey in human clothing, but its going to behave like an animal no matter how many security cameras are watching over it, and no matter how many times we beat it with a stick.\n\nThe reason we have trouble dealing with crime is because a lot of the crimes are trivial, and a lot of the criminals are our own relatives and friends. It's difficult for us to do something about a person who is wonderful 99% of the time and only occasionally causes trouble. We can also see the temptation to commit crimes within our own mind. All of us have the same animal-like cravings. However, it should be obvious that the situation with crime is getting worse, and we must start experimenting with different policies. \n\nThroughout most of human history there was no pity for people who couldn't behave properly, but during the past couple centuries, especially in America, Canada, and Australia, there has been an attitude that we should feel sorry for the misfits. Unfortunately, feeling sorry for people doesn't help them, and it doesn't help us.\n\n\n\nWe can't create a better world when a significant percentage of the population is cheating us. We also have to deal with the people who are honest but who simply can't behave in an appropriate manner for this modern era. \n\n\n\nAmerica should be used as evidence that a democracy is an idiotic concept. America is slowly destroying itself and there is nobody in control of this nation to do anything to stop it. The only people with significant influence over America are the organized crime gangs.\n\nCongressman Ron Paul and other so-called &quot;patriots&quot; believe that we can solve our problems by a mysterious action that they refer to as &quot;returning to the Constitution&quot;, but the Constitution is what has failed us. The Constitution set up a very simplistic, idiotic government. We need to develop something better.\n\nOne of the most serious problems with the Constitution is that it promotes the theory that everybody is virtually identical, and that we're all equally qualified to be government officials and businessmen and voters. We have to face the fact that people are not identical. Some of us are better behaved than others, and some of us are more talented, and some of us have serious mental disorders. We should design a society in which we have higher standards for people in leadership positions rather than pretend that everybody is equal. \n\nAt the moment entertainment companies demand royalties whenever people purchase or play music or television shows, but this is a ridiculous method of dealing with the problem. Furthermore, these entertainment businesses are abusing the situation and exploiting both the artists and the customers.\n\nFor example, Sony developed video recording equipment in the 1970s, and in 1976 Universal City Studios took them to court to stop the development of the product. The people in control of Universal Studios didn't want anybody to have the ability to record a television program. They weren't thinking about what's best for society. They were simply worried that they would lose money if people were capable of recording television shows.\n\nThe courts decided that Sony was allowed to produce home video recording equipment, but the people in control of the entertainment businesses refused to accept this. So they've been continually pressing for laws to restrict our ability to record audio and video, and today they're trying to stop people from using the Internet from passing music and television shows around.\n\nThe purpose of royalties is to allow people who produce intangible entertainment products to make a living, but many entertainment companies are doing more than merely making a living. For example, according to Forbes magazine, Steven Spielberg had an income of $340 million in 2005, and the radio host Howard Stern had an income of $308 million.\n\nSome of their money may have come from other businesses, but the point is that these people are not simply making a living. They are making a phenomenal amount of money, and yet they complain that they're being cheated by people who copy their material. These people are selfish animals who are never satisfied no matter how much money they have. They don't belong in positions of importance. They're examples of people who need to be replaced with better behaved people.\n\nFurthermore, many entertainment companies advertise to children. As I mentioned in other files, I don't think we should allow any business to advertise to children. I would describe this as exploitation of children.\n\nAccording to the theory of free enterprise, competition will prevent businesses from making excessive amounts of money and from exploiting the public. So, where are the better behaved and lower cost competitors to Steven Spielberg and Howard Stern?\n\nJulia Roberts was paid $25 million for her role in the movie Mona Lisa Smile. Where is the competition to Julia Roberts? Why don't other actresses offer to do the same work for less money? How can a business survive the competition when they waste $25 million on just one actress in just one movie? And where is the competition to Tom Cruise, Mike Wallace, Barbara Walters, Wolf Blitzer, Sumner Redstone, and Oprah Winfrey? How is it possible for these people to dominate the entertainment business for decades?\n\nMost people assume that Spielberg and the others dominate entertainment and make phenomenal amounts of money because they're special people with special talent, but the evidence suggests that they're part of the Jewish crime network, and they discriminate against everybody who's not part of their network. \n\nBy the way, somebody told me about an old television show from the 1960s called The Invaders. It's another variation of the story of aliens coming to the earth to take control. The aliens look just like Caucasian humans. One of the remarks an alien makes to the humans is &quot;Our mission is to take over the news media of your country.&quot; It seems to be another production in which the Jews are laughing at us for not being able to see what they're doing. \n\nthere's a lot of evidence that Einstein was just another criminal Jew who plagiarized his theories. If you've listened to the Kay Griggs interviews, then you may remember a vague remark she made about Einstein being involved in homosexual pedophilia while he was at Princeton University. This is the type of behavior we see with the Jewish crime network, not with real scientists. Even the photographs of Einstein and the descriptions of his personal life appear to make him some sort of weirdo. \n\nMany of the people who get to the top of society are doing so through crime. Hollywood seems to attract some of the most psychotic of these criminals. I think that's one of the reasons the movies and television shows are so full of psychotic behavior, and why they promote pirates, Italian crime gangs, horror stories, and ghosts.\n\nThe Protocols of Zion and Harold Rosenthal show that part of the reason the Jews are promoting psychotic behavior is to break down society, but I think part of the reason is because Hollywood is under the control of people with serious mental disorders, and they actually enjoy this material. \n\nDon't be impressed by a college diploma. The people who graduate from college are certainly capable of memorizing information, and some excel at performing math operations, but many of them are criminals or mental defects. Just look at how many of them are lying to us right now about 9/11, the Apollo moon landing, and the Holocaust. For a few examples, Professor Steven Jones is a physicist, and Kee Dewdney is a mathematician, and Jim Hoffman, who works with Professor Jones, is some type of math expert. \n\nJohn Carmack, for example, who did the programming for the three-dimensional graphics for such video games Doom and Quake, is obviously exceptional at three-dimensional geometry, but he wastes his talent on video games. He's also fascinated with space travel and he's involved with a private company that is trying to develop rockets.\n\nPaul Allen, of Microsoft, and Richard Branson of Virgin Airlines, are also involved in funding private companies that build rockets. The Apollo moon landing hoax has fooled a lot of people into believing that space travel is easy and fun. People assume that if NASA could get to the moon with the crude technology of the 1960s, then private companies today could easily build more advanced rockets for a lot less money.\n\nThis reasoning would be valid if NASA really did put men on the moon in 1969, but no nation has the ability to do it today. I think it's important to expose this moon landing hoax so that people realize that space travel is difficult and dangerous. We should put our effort into making the Earth a wonderful place to live. We shouldn't be encouraging Star Trek fantasies. \n","torrent":{"xt":"urn:btih:75e09bef2192e985cea048dee64442385dcb33cb","amp;dn":"Eric+Hufschmid+-+Dishonest+Scientists+Are+Just+Educated+Monkeys","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75e09bef2192e985cea048dee64442385dcb33cb","infoHashBuffer":{"type":"Buffer","data":[117,224,155,239,33,146,233,133,206,160,72,222,230,68,66,56,93,203,51,203]},"announce":[],"urlList":[]}}