{"title":"Sabrina OnLine, [Jpeg-Gif][tntvillage.scambioetico.org]","uid":4767887,"size":39723397,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:75e3967ee1ca6aa2d84b5e65192f847ca7e1d336&amp;dn=Sabrina+OnLine%2C+%5BJpeg-Gif%5D%5Btntvillage.scambioetico.org%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"reptile75","files":510,"time":1236942299,"description":"Sabrina OnLine, [Jpeg-Gif][tntvillage.scambioetico.org]\n\n:::-&gt;Dettagli Tecnici&lt;-:::\n\nAutore: Eric W. Schwartz\nLingua originale: Inglese (americano)\nTraduttore italiano: Gian Andrea Del Turco\nNumero pagine: 511 (in continua crescita)\nFormato: Jpeg e Gif\nContenuto: G Rated (consigliato per un publico dai 14 anni in su)\n\n:::-&gt;Trama&lt;-:::\n\nLa bizzarra vita di una puzzola dalle sembianza umane.\n\n:::-&gt;Furry&lt;-:::\nFurry fandom ÃƒÂ¨ un fandom incentrato su personaggi antropomorfi. L'antropomorfismo trattato al furry generalmente include l'attribuzione al soggetto di intelligenza umana, espressioni facciali, anatomia, capacitÃƒÂ  di parlare, bipedalismo, vestiti, e altri attributi tipicamente attribuiti ad animali. L'arte celebrata dal furry fandom include produzioni cinematografiche o semplicemente cartoni animati che coinvolge personaggi antropomorfi, piÃƒÂ¹ di qualsiasi altro tipo. Per questa ragione, ogni rappresentazione, puÃƒÂ² essere cosiderata parte del genere furry semplicemente includendo personaggi animali antropomorfizzati, anche se la maggior parte dei personaggi vengono piÃƒÂ¹ spesso usati in fumetti, cartoni animati, film d'animazione, novelle allegoriche, e videogiochi. La fantascienza e i generi fantasy utilizzano spesso antropomorfismo, e quindi sono particolarmente diffusi e apprezzati nel furry fandom. Fin dagli anni '80, il termine furries si riferisse ad animali antropomorfi. Anche se i mammiferi sono i piÃƒÂ¹ comuni, rettili o uccelli possono essere considerati furry.\nStoria:\nSecondo lo storico del fandom Fred Patten, il concetto di furry ha avuto origine in un convegno sulla fantascienza del 1980, quando un personaggio disegnato da Steve Gallacci intitolato Albedo Anthropomorphics iniziÃƒÂ² una discussione sui personaggi antropomorfi nei romanzi di fantascienza, che a sua volta diede inizio a un gruppo di discussione nei convegni di fantascienza e di fumetti. Patten definÃƒÂ¬ il Furry Fandom come &quot;una diffusione organizzata di arte e di prosa riguardante i Furry, o i personaggi mammiferi antropomorfi&quot;\n\nIl termine specifico &quot;Furry Fandom&quot; ÃƒÂ¨ stato inizialmente usato nelle fanzine all'inizio del 1983, ed ÃƒÂ¨ diventato lo standard per definire il genere (anche se non c'ÃƒÂ¨ ancora nessuna forma di standardizzazione e le parole possono essere usate per scopi commerciali). Comunque, i fan pongono l'inizio del furry molto prima. Opere cinematografiche come Kimba, The White Lion rilasciato nel 1965, il romanzo di Richard Adams' intitolato Watership Down, pubblicato nel 1972 (e il suo omonimo film), come anche Robin Hood vengono spesso citati come esempi degli inizi del furry fandom. Per distinguere i soggetti dai pure personaggi animali, come Lassie o Old Yeller, gli animali vengono definiti come funny animals, un termine usato fin dal 1910.\n\nDurante gli anni 80, i furry fan cominciarono a pubblicare fanzine, creando un nuovo gruppo sociale che cominciÃƒÂ² ad organizzare varie riunioni. Nel 1987, c'era abbastanza interesse per organizzare la prima furry convention.[8]Nel decennio successivo, internet diventÃƒÂ² accessibile alla popolazione e diventÃƒÂ² il piÃƒÂ¹ popolare mezzo dei fan furry per socializzare. Il newsgroup alt.fan.furry ÃƒÂ¨ stato creato nel novembre del 1990, e ambienti virtuali come i MUCK diventarono anch'essi popolari in Internet per i fan per incontrarsi e comunicare. Uno dei piÃƒÂ¹ antichi e grande MUCK esistente ÃƒÂ¨ FurryMUCK.\n\nArte e Letteratura:\nI fan del furry partecipano all'arte come amatori, illustratori professionali, autori di strips, pittori, scultori, scrittori, musicisti. Insomma un movimento che oltre che di pensiero e affinitÃƒÂ  puÃƒÂ² definirsi anche artistico in tutti i sensi, data la prolifica produzione in quasi tutti i campi dell'arte stessa.\n\nMentre la maggior parte della fan-art viene diffusa tramite media non professionali, come siti personali, una parte ÃƒÂ¨ pubblicata in antologie dalla Amateur press association, oppure da Fanzine. Solo una piccola parte di quest'arte ÃƒÂ¨ stata infine divulgata alle masse, sotto forma di film di animazione o servizi televisivi.\n\nEsistono inoltre numerosi webcomic, cioÃƒÂ¨ fumetti che escono a &quot;puntate&quot; online, che vengono definiti &quot;furry-comics&quot;; alcuni di questi riescono a raggiungere un notevole livello di notorietÃƒÂ , come il caso di T.H.E. FOX, la cui prima pubblicazione risale al 1986.\nEsistono siti interamente dedicati alle immagini furry , dove gli animali antropomorfi vengono definiti anche &quot;anthro&quot;. Molti artisti mantengono un proprio sito","torrent":{"xt":"urn:btih:75e3967ee1ca6aa2d84b5e65192f847ca7e1d336","amp;dn":"Sabrina+OnLine%2C+%5BJpeg-Gif%5D%5Btntvillage.scambioetico.org%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75e3967ee1ca6aa2d84b5e65192f847ca7e1d336","infoHashBuffer":{"type":"Buffer","data":[117,227,150,126,225,202,106,162,216,75,94,101,25,47,132,124,167,225,211,54]},"announce":[],"urlList":[]}}