{"title":"The singing Detective (2003) (Robert Downey Jr.)","uid":4375949,"size":733378560,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7790274c79c7c8ab57f7f345f8f5eb7091fbba5c&amp;dn=The+singing+Detective+%282003%29+%28Robert+Downey+Jr.%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"Pruna","files":-1,"time":1220405429,"description":"A pulp mystery writer comes down with a paralyzing and debilitating illness. To escape the pain that he&amp;#039;s constantly in, he daydreams himself into the world of his mysteries. There, he plays the part of The Singing Detective, a healthy, handsome savvy guy who sings, shoots, sleuths, and is followed by mystery and murder. In real life, the writer is so exhausted by pain that he sometimes flips back and forth from reality to his dream life without meaning to. \nThe viewer gradually realizes that the writer&amp;#039;s dreams are weird mirrors of what he feels has happened to him in reality. Betraying friends, nameless thugs, missing objects, and backstabbing women populate his dreams--but the writer clearly feels that some of these things are truly happening. The writer has gone insane, and is helped through his physical and mental illness by his wife (Robin Wright Penn) and psychotherapist (a nearly-unrecognizable Mel Gibson). \nAs the writer makes progress toward sanity, his disease begins to lose its hold on him. While he is still ill and unstable, he is clearly improving, beginning to draw away from the dark, depressing fantasy life that he&amp;#039;d concocted. He learns to let his dreams go, and let the people in them die. \n\nAnd that is when the fantasy, and it&amp;#039;s denizens, come to take him back. \n\nRuntime: 1:49:02\nResolution: 528 x 288\nCodec: Xvid\nAudio sample rate: 48000 Hz\nBitrate: 122 kb/s\n\n\nWell, Iron Man stirred up my interest in Robert Downey Jr&amp;#039;s acting skills, and I started to go through the lists of things he&amp;#039;d done. I noticed that there was no open torrent for this movie and I thought I&amp;#039;d fill the gap. This movie is weird, scary, surreal and generally awesome if you&amp;#039;re into stuff like Lynch or Cronenberg. It&amp;#039;s very entertainingly fucked-up, and Downey is a much better actor than I suspected; his character here is filled with rage and mentally unstable, very powerful and frightening even while lying strapped down in a bed. ","torrent":{"xt":"urn:btih:7790274c79c7c8ab57f7f345f8f5eb7091fbba5c","amp;dn":"The+singing+Detective+%282003%29+%28Robert+Downey+Jr.%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7790274c79c7c8ab57f7f345f8f5eb7091fbba5c","infoHashBuffer":{"type":"Buffer","data":[119,144,39,76,121,199,200,171,87,247,243,69,248,245,235,112,145,251,186,92]},"announce":[],"urlList":[]}}