{"title":"Frank Zappa - Lumpy Gravy TQMP","uid":5204370,"size":195095123,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:77bb47ec99d497c8678e094aabb9ff82b89ee431&amp;dn=Frank+Zappa+-+Lumpy+Gravy+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zootallure","files":14,"time":1260305089,"description":"Lumpy Gravy, Frank Zappa's first solo album, was released months before the Mothers of Invention's third LP (even though its back cover asked the question: &quot;Is this phase two of We're Only in It for the Money?&quot;) and both were conceptualized and recorded at the same time. We're Only in It for the Money became a song-oriented anti-flower power album with one contemporary/musique concrÃƒÂ¨te/sound collage hybrid piece by way of conclusion. Lumpy Gravy collaged bits of orchestral music, sonic manipulations, spoken words, and occasional pop ditties into two lumps of 16 minutes each. This album presents Zappa's first recordings with a decent orchestra, the 50-piece Abnuceals Emuukha Electric Symphony Orchestra. His symphonic writing was very much influenced by Stravinsky and VarÃƒÂ¨se. It still had to lose its sharp edges and find the lushness found in 200 Motels. The segments of music are loosely tied together by bits of dialogue from inside the piano. MOI members and friends were invited to talk with their head inside a grand piano with the sustain pedal depressed (the technique was immortalized in the song &quot;Evelyn, A Modified Dog&quot;). The reverberating space gave the voices an eerie quality, but made it very difficult to convincingly edit the material. Thus, the plot emanating from these portions remains very vague (it was clarified 25 years later in Civilization Phaze III). The song bits include &quot;Oh No,&quot; &quot;Theme from Lumpy Gravy&quot; (aka &quot;Duodenum&quot;), &quot;King Kong,&quot; and &quot;Take Your Clothes off When You Dance,&quot; all in instrumental versions, all making their first appearance on record. The starting point of Zappa's &quot;serious music,&quot; Lumpy Gravy suffers from a lack of coherence, but it remains historically important and contains many conceptual continuity clues for the fan. The opening line of part one (&quot;The way I see it, Barry, this should be a dynamite show&quot;) became a classic reference.\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at:  &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health :-)\t\t","torrent":{"xt":"urn:btih:77bb47ec99d497c8678e094aabb9ff82b89ee431","amp;dn":"Frank+Zappa+-+Lumpy+Gravy+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77bb47ec99d497c8678e094aabb9ff82b89ee431","infoHashBuffer":{"type":"Buffer","data":[119,187,71,236,153,212,151,200,103,142,9,74,171,185,255,130,184,158,228,49]},"announce":[],"urlList":[]}}