{"title":"440Hz - Rock &amp; Ride","uid":9854094,"size":58171459,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7884355458d028676ee9312e3bf03549c948946c&amp;dn=440Hz+-+Rock+%26amp%3B+Ride&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"RocknRide","files":8,"time":1396201747,"description":"I have had serious issues with RSI &amp; Tendonitis in my hands &amp; wrists (among other parts). Before RSI set in too much, I was involved with 2 Toronto bands: PsychoActivist &amp; Pallbearer. I've always wanted to do an instrumental solo album, so I began to write and make some rough recordings for reference, to jam along with and polish up the sound, write solos, and add details to the tunes. Unfortunately my condition worsened before I could complete my project. I did get 2 songs complete and sounding nice, but the rest I was unable to complete. No sense in letting my hard work go to waste though. Even though most of the tracks sound very raw, have metronome style drum tracks, lack solos, or are otherwise incomplete, I still feel the need to share my efforts &amp; passion with the world.\n\nThe songs: A Glimpse Beyond, &amp; The Traveler, are complete and remain fully as my intellectual property. The rest of the material is CC (creative common).\n\nYou are not only welcome to, but I encourage you to, use them in any NON PROFIT way that you desire. Record your own version, add solos, use riffs for your songs, use them for a movie soundtrack, or whatever you like. \n\nI am the sole proprietor of these songs, you have my FULL permission to download, seed, burn CDs, etc. So long as there is NO PROFIT! My music is free to everyone in the world! ","torrent":{"xt":"urn:btih:7884355458d028676ee9312e3bf03549c948946c","amp;dn":"440Hz+-+Rock+%26amp%3B+Ride","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7884355458d028676ee9312e3bf03549c948946c","infoHashBuffer":{"type":"Buffer","data":[120,132,53,84,88,208,40,103,110,233,49,46,59,240,53,73,201,72,148,108]},"announce":[],"urlList":[]}}