{"title":"SRN Solo Antivirus Software 2010 v9.0.1 + Keygen [RH]","uid":5277327,"size":3969851,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:791020bdbb88e99d90c65674cfe0e15e3e24c13a&amp;dn=SRN+Solo+Antivirus+Software+2010+v9.0.1+%2B+Keygen+%5BRH%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RobbingHood","files":1,"time":1263419774,"description":"\n\n\n   .-._______                                                         _______.-.\n--( )_)______)   SRN Solo Antivirus Software 2010 v9.0.1 + Keygen    (______(_( )--\n (    ()___)                                                           (___()    )\n      ()__)                                                             (__()\n-(___()_)                                                                 (_()___)-\n\n\n&lt;---------------------------------------------------------------------------------&gt;\n SPONSORED LINK                    SPONSORED LINK                   SPONSORED LINK\n ^^^^^^^^^^^^^^                    ^^^^^^^^^^^^^^                   ^^^^^^^^^^^^^^\n&lt;---------------------------------------------------------------------------------&gt;\n\nSRN Micro Systems Support Website for all SRN Micro Systems Products &amp; Cracks:   &lt;a href=&quot;\nhttp://www.srnmicro.com/customers/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.srnmicro.com/customers/&lt;/a&gt;\n\nNOTE: Please do not forget to leave behind as much information as possible  \nabout where the product is from and about your personal identification data. \nYou'll then be contacted as soon as possible by the SRN Support Team! \n\n\nThank you for choosing SRN Micro Systems,\n\nThe SRN Micro Systems Support Team\n\n&lt;---------------------------------------------------------------------------------&gt;\n&lt;---------------------------------------------------------------------------------&gt;\n\n\n\n                 SRN Solo Antivirus Software 2010 v9.0.1 + Keygen\n\n\n\nSolo Antivirus 2010 9.0.1 offers you a useful software that can not only scan for \nall viruses, it contains a unique System Integrity Checker to protect you from new \nSpyware, Internet Worms, Backdoor programs, malicious VB and Java scripts. It also\neffectively removes all existing Internet Worms, File infecting viruses, malicious\nVB and Java scripts, Trojans, Adware, Spyware, Backdoors, boot sector, partition \ntable, file and macro viruses. \n\nSRN Micro, the growing antivirus software developing concern launched new improved \nversion of Solo Antivirus 2010 - Version 9.0. The new version effectively fights \nagainst viruses and spyware. The new version comes with improved scan engine and \nonline update facility. SOLO antivirus software provides complete detection, cure \nand protection for your computers at cost effective price. It cleans all kinds of \ne-mail, Internet, boot sector, partition table, file macro and script viruses. \n\nSolo has been completely tested and it meets the global standard. Solo anti-virus \nnot only scans for all viruses, it contains a unique System Integrity Checker to \nprotect you from new Spyware, Internet Worms, Backdoor programs, malicious VB and \nJava scripts. It also effectively removes all existing Internet Worms, File \ninfecting viruses, malicious VB and Java scripts, Trojans, Adware, Spyware, \nBackdoors, boot sector, partition table, file and macro viruses.\n\nSolo antivirus has been recognized as one of the most efficient and user friendly \nantivirus software available in the market today. Solo is updated regularly and \nthese updates are available for registered users at free of cost.\n\n\n\nBenefits of Solo Antivirus Software 2010 v9.0.1:\n\n&gt; System Integrity Checker \nMonitors system registry, system.ini, win.ini and startup to protect you from \nnew Internet Worms and Backdoors.\n\n&gt; Solo Scanner \nDetects and disinfects all types of viruses, and provides facility to remove \nviruses in Windows locked files.\n\n&gt; Solo Sentry System \nMonitors active processes, and stops malicious code found in memory.\n\n&gt; Solo Scheduler \nScheduled scan tasks can be done hourly, weekly or monthly.\n\n&gt; Effective resource management \nSolo uses very low percentage of system resources. So it won't affect your system \nperformance unlike other antivirus software.\n\n&gt; Automatic update facility \nSolo automatically downloads updates whenever new signature files found on the web.\n\n\n\nGeneral features of Solo Antivirus Software 2010 v9.0.1:\n\n- Contains System integrity Checker to block fast spreading Internet Worms\n- Provides efficient and permanent solution for all types of viruses.\n- Doesn't corrupt any file after cleaning the viruses.\n- Contains a sentry system to stop viruses.\n- Daily-weekly scheduler to automatically trigger off scanning process\n- Multiple infections to be cleaned at one time - it saves the scanning time.\n- Virus independent - protects against future viruses.\n- Provides database facility to enter new virus signature in the database.\n- User friendly and can be even used by a novice user.\n- Automatic update facility available.\n- Technical support will be provided for registered users.\n- Solution for new viruses will be provided within the shortest possible time.\n\n\n\nChanges in Solo Antivirus Software 2010 v9.0.1:\n\n- Enhanced scan engine scans files on the fly and sets new standard on the scan \n  engine perfomance.\n- Solo contains a unique system integrity checker to protect your system from new \n  Internet worms, backdoors, and spyware.\n- Solo includes features such as a sentry system, an automatic update facility, \n  a schedule scan facility, an emergency disk tool, and so on.\n- Other features include memory scan during installation, Windows locked files \n  disinfection, and a simple and easy-to-use interface.\n\n\n\nSupported Platforms:\n\n- Windows ME, Windows 98, Windows 98 Se and Windows 95\n- Windows XP Home, Windows XP Professional, Windows 2000 Professional, \n  Windows NT 4.0 Workstation\n- Windows Vista Home Basic, Windows Vista Home Premium, Windows Vista Ultimate \n  and Windows Vista Business.\n- Windows 2003 Server\n- Windows 2000 Server, Windows 2000 Advanced Server and Windows NT Server\n\n\n\nMore info: &lt;a href=&quot;\nhttp://www.srnmicro.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.srnmicro.com/&lt;/a&gt;\n\n\n\n&lt;---------------------------------------------------------------------------------&gt;\n&lt;---------------------------------------------------------------------------------&gt;\n\n\n\n&gt;&gt;&gt;When using TPB please read these important notes: \n****************************************************\n\n01- AV software may warn about keygens, patches, cracks etc because of their \n    capabilities and signatures (generating codes, etc). Sometimes also they're \n    added to the virus/spyware database and will be detected as malware. If not \n    trusting keygens, patches, cracks etc don't use them.\n\n02- To avoid AV software removing/blocking clean cracks etc: exclude the crack \n    or folder from being auto-protected &amp; auto-scanned by the AV software.\n\n03- If AV software removed a clean crack usually it can be restored \n    (if it's not in Quarantaine then look at History or something similar).\n\n04- To avoid risks when using cracks also Sandboxie can be used to test them:\n   &lt;a href=&quot; http://www.sandboxie.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.sandboxie.com/&lt;/a&gt;\n   &lt;a href=&quot; http://thepiratebay.se/torrent/4918844/Sandboxie_v3.38___Keys_[RH]&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/torrent/4918844/Sandboxie_v3.38___Keys_[RH]&lt;/a&gt;\n\n05- Before running .exe-files, keygens, patches, cracks etc always check first \n    if they can be unpacked. Often some thirth party added a virus to the \n    original file, repacked it, and uploaded it again.\n\n06- Letting AV software software sending scan results to their companies \n    can cause keygens, patches, cracks etc being added to their virus-database.\n\n07- Firewalls which are set to automatically decide for connections will allow \n    connections for lots of apps &amp; MALWARE!. To avoid so firewalls should be set \n    to decide yourself which connection to allow or not.\n\n08- Clicking on unknown links can coz malware being silently installed on a pc!\n\n09- Usually (new) torrents with extreme many downloads &amp; seeders in a short time \n    are very suspicious! Torrents with a SKULL-logo are trusted.\n\n10- Some (frustrated) people use multiple accounts and post lots of FAKE comments \n    and/or files trying to spread confusion. Usually they NEVER seriously reply \n    on comments and don't have any torrent, or to look reliable just a few.\n\n11- In general often there are more fake &amp; negative comments than reliable &amp; \n    positive comments.\n\n12- In some countries uploading/downloading copyright-protected material is \n    forbidden, but showing some appreciation to reliable uploaders is not.\n\n13- Posting FAKE comments &amp; uploads on TPB can result in getting banned from TPB!\n\n\nFor reporting bad or suspicious torrents:  &lt;a href=&quot;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/forumdisplay.php?fid=29&lt;/a&gt;\n\nFor visiting &quot;TPB's Most Ridiculous Comments&quot;:  &lt;a href=&quot;\nhttp://forum.suprbay.org/showthread.php?tid=24699&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/showthread.php?tid=24699&lt;/a&gt;\n\nFor visiting my account*:  &lt;a href=&quot;\nhttp://thepiratebay.se/user/RobbingHood/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/RobbingHood/&lt;/a&gt;\n\n*All torrents scanned with:\n1- Norton Internet Security  \n2- Avast! Antivirus AV Pro  \n3- AVG Antivirus Pro   \n4- Kaspersky AV Pro  \n5- NOD32 AV  \n\nAlso scanned with reputed antispyware software. Reported malware \ndetected by other anti-malware software probably are false positives!\n\n\n&lt;---------------------------------------------------------------------------------&gt;\n\n\nTo the &quot;United Reliable The Pirate Bay Users&quot;,\n\nNowadays a lot of TPB members abuse their TPB membership by intenionally posting \nfake comments &amp; files. Their meaning is just to spread confusion and try to \nfrustrate TPB and it's users. And less downloaders = less seeders = less \ndownloadspeed etc etc. \n\nIt's in the benefit of TPB and all reliable users to warn each other about people \nwho intenionally keep posting fake comments &amp; files. It's an easy answer against \nthose who intenionally keep posting fake comments &amp; files, which is a never \nending issue. \n\nWhen reporting errors or false positives just keep in mind that what goes up for \none does not always goes up for another. That's for both the working of an app \nand about false positives! Remember: whatever is said, say it constructive! \nLet's just try to help each other and TPB by thinking about what's said &amp; posted. \nThings are all up to you, the &quot;United Reliable The Pirate Bay Users&quot;!\n\n\nEnjoy The Pirate Bay\n                                         \n* Status torrent at January 13, 2010 - 20.30 CET: clean, tested &amp; working.","torrent":{"xt":"urn:btih:791020bdbb88e99d90c65674cfe0e15e3e24c13a","amp;dn":"SRN+Solo+Antivirus+Software+2010+v9.0.1+%2B+Keygen+%5BRH%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"791020bdbb88e99d90c65674cfe0e15e3e24c13a","infoHashBuffer":{"type":"Buffer","data":[121,16,32,189,187,136,233,157,144,198,86,116,207,224,225,94,62,36,193,58]},"announce":[],"urlList":[]}}