{"title":"Mark Durie and Bat Ye'or - The Third Choice: Islam...and Freedo","uid":6955155,"size":949663,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:796b4f308e0c583484e68495e379dea415ff3663&amp;dn=Mark+Durie+and+Bat+Ye%5C%27or+-+The+Third+Choice%3A+Islam...and+Freedo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":2,"time":1326553311,"description":"The Third Choice: Islam, Dhimmitude and Freedom\n\nThe Third Choice provides a compelling introduction to Islam on the basis of its primary sources, the Qur'an and the life of Muhammad. Topics covered include the sharia; interpretation of the Qur'an; abrogation; women's rights (including female genital mutilation); lawful deception (taqiyya); Muhammad's responses to opposition; Islamic antisemitism; religious freedom; and prospects for reforming Islam. \n\nAfter this critical introduction of Islam, there follows an explanation and critique of Islam's policy for non-Muslims living under Islamic conditions.  The doctrine of the three choices (conversion, the sword, or the dhimma pact of surrender to Islam) is explained, including an analysis of the meaning of tribute payments (jizya) made by non-Muslims (dhimmis) to their Muslim conquerors.  Durie describes the impact of dhimmitude on the human rights of non-Muslims in Islamic contexts around the world today, in the light of global Islamic resurgence and advancing Islamization, including pressure being exerted through the United Nations for states to conform to sharia restrictions on freedom of speech.  \n\nThe Third Choice offers indispensable keys for understanding current trends in global politics, including the widening impact of sharia revival, deterioration of human rights in Islamic societies, jihad terrorism, recurring patterns of Western appeasement, interfaith dialogue initiatives, and the increasingly fraught relationship between migrant Muslim communities in the West and their host societies.\n\nAuthor: Mark Durie and Bat Ye'or (Foreword)\nPublisher: Deror Books\nPublication Date: February 28, 2010\n\nFormats:\n.mobi (compatible with Amazon Kindle, etc.)\n.epub (compatible with Sony Reader, Cruz Reader, iPad, iPodTouch/iPhone, etc.)\n\nFree Calibre eBook reader: &lt;a href=&quot;\nhttp://calibre-ebook.com/download&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://calibre-ebook.com/download&lt;/a&gt;\n","torrent":{"xt":"urn:btih:796b4f308e0c583484e68495e379dea415ff3663","amp;dn":"Mark+Durie+and+Bat+Ye%5C%27or+-+The+Third+Choice%3A+Islam...and+Freedo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"796b4f308e0c583484e68495e379dea415ff3663","infoHashBuffer":{"type":"Buffer","data":[121,107,79,48,142,12,88,52,132,230,132,149,227,121,222,164,21,255,54,99]},"announce":[],"urlList":[]}}