{"title":"Nancy LaMott - Live At Tavern On The Green [EAC-FLAC]","uid":11172499,"size":325951745,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:79aed306fc5d45e91067ddc97c0faf1d47d5887b&amp;dn=Nancy+LaMott+-+Live+At+Tavern+On+The+Green+%5BEAC-FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"jayb","files":-1,"time":1412718763,"description":"Nancy LaMott - Live At Tavern On The Green\n\nRecording Date:\tOctober 27, 1995\nRelease Date:\tFebruary 1, 2005\nDuration:\t52:23\nGenre:\t\tVocal\nStyles:\t\tCabaret, Traditional Pop\nLabel:\t\tMidder Music CD#7\n\n01 Listen To My Heart\t\t\t David Friedman\t\t\t\t04:24\t\n02 Welcome\t\t\t\t Nancy LaMott\t\t\t\t01:20\t\n03 The People That You Never Get To Love Rupert Holmes\t\t\t\t03:21\t\n04 Sailin' On\t\t\t\t Alan Menken/Dean Pitchford\t\t03:59\t\n05 I Didn't Know What Time It Was\t Lorenz Hart/Richard Rodgers\t\t05:23\t\n06 Jeepers Creepers\t\t\t Johnny Mercer/Harry Warren\t\t03:48\t\n07 How Deep Is The Ocean?\t\t Irving Berlin\t\t\t\t04:42\t\n08 Waters Of March\t\t\t Antonio Carlos Joabim\t\t\t05:18\t\n09 I Got The Sun In The Morning\t\t Irving Berlin\t\t\t\t05:16\t\n10 The Promise (I'll Never Say Goodbye)\t Alan &amp; Marilyn Bergman/David Shire\t04:51\t\n11 Thank You's\t\t\t\t Nancy LaMott\t\t\t\t00:56\t\n12 Help Is On The Way\t\t\t David Friedman\t\t\t\t04:12\t\n13 There's Always An Encore\t\t Nancy LaMott\t\t\t\t00:33\t\n14 Secret O' Life\t\t\t James Taylor\t\t\t\t04:20\n\nFrom nancylamott.com:\n\n&quot;Recorded live at Nancy's last engagement at Tavern on the Green, just seven weeks before her untimely death, this CD is filled with radiant, joyful, gorgeously sung performances, as well as charming, funny, often-touching patter.\n\nFeaturing some of your favorite Nancy LaMott standards plus many songs you've never heard her sing on CD before, this CD captures, for all time, the magic that was Nancy Live.&quot;\n\nAllMusic Review by Jonathan Widran:\n\nThere's a very good reason that the sticker on this lovely cabaret-styled live concert date is billed as the singer's &quot;first new release in eight years&quot; -- she died of cancer in December, 1995, just weeks after the performance documented here. The release of this disc and the rest of her catalog in 2005 isn't quite like the Eva Cassidy story. Cassidy was an unknown when she died, but Nancy LaMott, discovered in the late '80s on the Manhattan club scene by composer and producer David Friedman, was quite a growing sensation when her time came. She recorded a total of five albums on the label Friedman created for her, appeared on numerous morning talk shows, was a critical favorite and performed for the Clintons at the White House several times. The uniqueness of this release goes far beyond her emotionally compelling voice, unpretentious flair for phrasing and charming verbal asides; her choice of material is unique and atypical. For every standard love song (&quot;I Didn't Know What Time It Was&quot;), there's a wittily rendered ditty like &quot;Jeepers Creepers&quot; or &quot;I Got the Sun in the Morning,&quot; or a literary type piece like Rupert Holmes' &quot;The People That You Never Get to Love.&quot; Her best performance is the restrained version of &quot;Waters of March,&quot; which is done with sparse, piano based accompaniment. She's also all aces on Friedman's inspirational tunes &quot;Listen to My Heart&quot; and &quot;Help Is on the Way,&quot; which display an optimism that stands in the face of her lifelong health struggles. While it's doubtful Lamott will enjoy the posthumous phenomenon Cassidy has, hers is still a timeless talent well-worth discovering.\n\nOne of the greatest cabaret singers of all time.\nIf you like her, please support her legacy by purchasing her work.","torrent":{"xt":"urn:btih:79aed306fc5d45e91067ddc97c0faf1d47d5887b","amp;dn":"Nancy+LaMott+-+Live+At+Tavern+On+The+Green+%5BEAC-FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79aed306fc5d45e91067ddc97c0faf1d47d5887b","infoHashBuffer":{"type":"Buffer","data":[121,174,211,6,252,93,69,233,16,103,221,201,124,15,175,29,71,213,136,123]},"announce":[],"urlList":[]}}