{"title":"Mary Kubica - The Good Girl","uid":14403216,"size":153029906,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:79d8e6f472b0981c48f026e7f9198f349846f4f7&amp;dn=Mary+Kubica+-+The+Good+Girl&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Cybotage","files":2,"time":1461387144,"description":"\n\r\n&quot;I've been following her for the past few days. I know where she buys her groceries, where she has her dry cleaning done, where she works. I don't know the color of her eyes or what they look like when she's scared. But I will.&quot;\r\n\r\nBorn to a prominent Chicago judge and his stifled socialite wife, Mia Dennett moves against the grain as a young inner-city art teacher. One night, Mia enters a bar to meet her on-again, off-again boyfriend. But when he doesn't show, she unwisely leaves with an enigmatic stranger. With his smooth moves and modest wit, at first Colin Thatcher seems like a safe one-night stand. But following Colin home will turn out to be the worst mistake of Mia's life.\r\n\r\nColin's job was to abduct Mia as part of a wild extortion plot and deliver her to his employers. But the plan takes an unexpected turn when Colin suddenly decides to hide Mia in a secluded cabin in rural Minnesota, evading the police and his deadly superiors. Mia's mother, Eve, and detective Gabe Hoffman will stop at nothing to find them, but no one could have predicted the emotional entanglements that eventually cause this family's world to shatter.\r\n\r\nAn addictively suspenseful and tautly written thriller, The Good Girl is a propulsive debut that reveals how even in the perfect family, nothing is as it seems","torrent":{"xt":"urn:btih:79d8e6f472b0981c48f026e7f9198f349846f4f7","amp;dn":"Mary+Kubica+-+The+Good+Girl","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79d8e6f472b0981c48f026e7f9198f349846f4f7","infoHashBuffer":{"type":"Buffer","data":[121,216,230,244,114,176,152,28,72,240,38,231,249,25,143,52,152,70,244,247]},"announce":[],"urlList":[]}}