{"title":"Democracy Now - 19 may 2011","uid":6406543,"size":458901256,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:79f07ecee33367216a429677c3d9516c2a265203&amp;dn=Democracy+Now+-+19+may+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1305825165,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for May 19, 2011\n\n- Al-Qaeda Unveils Interim Leader, Releases bin Laden Tape\n- Gitmo Prisoner Dies of Apparent Suicide\n- 12 Afghans Killed Protesting Deadly NATO Raid\n- 6th U.S. Soldier Charged in Afghan &quot;Kill Team&quot; Case\n- Obama to Deliver Mideast Address\n- Report: Gaddafi's Wife, Daughter Flee Libya\n- 4 Journalists Freed in Libya\n- U.S. Sanctions Assad Regime, Crackdown Continues in Border Town\n- Freed Al Jazeera Journalist Recounts Syria Jailing\n- Mothers of Hikers Jailed in Iran Stage Hunger Strike\n- IMF Chief Resigns Following Arrest on Rape Charges\n- Hundreds to Protest Education Cuts in D.C. Rally\n\n\nSpecial reports\n\n- &quot;Malcolm X: A Life of Reinvention&quot;: Manning Marable's Exhaustive Biography of the Civil Rights Leader\n\nEvents are being held today across the country to mark what would have been Malcolm X's 86th birthday. Earlier this year a major new biography of Malcolm X was published titled ,&quot;Malcolm X: A Life of Reinvention.&quot; The book's author, Columbia University Professor Dr. Manning Marable, died at the age of 60 just days before its publication. Two decades in the making, the nearly 600-page biography is described as a re-evaluation of Malcolm X's life, providing new insights into the circumstances of his assassination, as well as raising questions about Malcolm X's own autobiography. We speak with Zaheer Ali, one of the researchers who worked with Dr. Marable on the biography. &quot;In a sense, this book is kind of iconoclasm in that way in that it takes Malcolm off the pedestal to examine him as a human being struggling through these political and religious currents he was in,&quot; says Zaheer.\n\n\n- Manning Marable's Controversial New Biography Refuels Debate on Life and Legacy of Malcolm X\n\nAfter two decades of work, Dr. Manning Marable completed a new biography, Malcolm X: A Life of Reinvention.&quot; Dr. Marable used material for his book that recently made available, thus providing a new insight into the famed civil rights leader. His biography, however, has also refueled the debate on many controversial aspects of Malcolm X's life and interpretation of his politics and legacy. To discuss the Dr. Marable's biography, we host a roundtable discussion with three guests. Amiri Baraka is an acclaimed poet, playwright, music historian and activist based in Newark, New Jersey. Herb Boyd is Harlem-based activist, teacher and author who edits the online publication, The Black World Today and writes for several publications, including Amsterdam News. Michael Eric Dyson is a professor of sociology at Georgetown University and is the author of numerous books including, &quot;Making Malcolm: The Myth and Meaning of Malcolm X.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:79f07ecee33367216a429677c3d9516c2a265203","amp;dn":"Democracy+Now+-+19+may+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79f07ecee33367216a429677c3d9516c2a265203","infoHashBuffer":{"type":"Buffer","data":[121,240,126,206,227,51,103,33,106,66,150,119,195,217,81,108,42,38,82,3]},"announce":[],"urlList":[]}}