{"title":"Dr John Watson series by Robert Ryan","uid":9676946,"size":944116,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7a91bbf5621eb6ed50a5a4d7a95a844d22c3623a&amp;dn=Dr+John+Watson+series+by+Robert+Ryan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PirateBook","files":2,"time":1393581594,"description":"\nRobert Ryan was born in Liverpool but moved to London when he was eighteen to attend university. \n\nHe lectured in natural sciences for several years before moving into journalism in the mid-1980s, first with The Face and then the Dylan Jones-edited Arena. During this time, he also wrote for The Daily Telegraph, US GQ, US Conde Nast Traveler, Esquire and The Sunday Times.\n\nGenre: Mystery\n\n\nDead Man's Land: \n\nDeep in the trenches of Flanders Fields, men are dying in their thousands every day. So one more death shouldn't be a surprise.\nBut then a body turns up with bizarre injuries, and Sherlock Holmes' former sidekick Dr John Watson - unable to fight for his country due to injury but able to serve it through his medical expertise - finds his suspicions raised. The face has a blue-ish tinge, the jaw is clamped shut in a terrible rictus and the eyes are almost popping out of his head, as if the man had seen unimaginable horror. Something is terribly wrong.\n\nBut this is just the beginning. Soon more bodies appear, and Watson must discover who is the killer in the trenches. Who can he trust? Who is the enemy? And can he find the perpetrator before he kills again?\nSurrounded by unimaginable carnage, amidst a conflict that's ripping the world apart, Watson must for once step out of the shadows and into the limelight if he's to solve the mystery behind the inexplicable deaths.\n\nThe Dead Can Wait: \n\nDr John Watson is fresh from his time in the trenches of Flanders Fields and back home for some much needed R&amp;R. But deep in England's green and pleasant land something evil lurks.\n\nFor enemy spies have inflitrated the home front, in search of vital information to take back to Germany. And when seven dead men are discovered, their bodies laid side by side, there is only one man who can solve this curious crime: Dr John Watson.","torrent":{"xt":"urn:btih:7a91bbf5621eb6ed50a5a4d7a95a844d22c3623a","amp;dn":"Dr+John+Watson+series+by+Robert+Ryan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a91bbf5621eb6ed50a5a4d7a95a844d22c3623a","infoHashBuffer":{"type":"Buffer","data":[122,145,187,245,98,30,182,237,80,165,164,215,169,90,132,77,34,195,98,58]},"announce":[],"urlList":[]}}