{"title":"NBC Celebrity Christmas - 2001 - FLAC","uid":10793364,"size":266642603,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7b47e1a4eadb9a496e0d0627b34425f81f8d8cc0&amp;dn=NBC+Celebrity+Christmas+-+2001+-+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":-1,"time":1408234328,"description":"\nIn preparation for the Upcoming 2000/2001 Winter Holiday Season, NBC along with the Children's Miracle Network charity developed this album of Christmas songs performed by some of the current NBC celebrities on prime time television.  A portion of the proceeds from the sale of each CD were to benefit the charity in its support of over 170 hospitals around the world.\n\nThe songs selected represent a number of holiday songs culled from various NBC-aired television shows. Surprisingly, the songs are actually sung by the actual actors and actresses, and even more surprisingly, these performances are often impressive and wholehearted. Some examples of what to expect are Sean Hayes teaming with Dave Koz for &quot;The Christmas Song&quot; and Jay Leno with his ginormous ski ramp of a chin closing out the album with &quot;'Twas the Night Before Christmas.&quot;   Of course, who hasn't at one time or another thought to themselves, hey, I wish those &quot;West Wing&quot; guys would show up at my house and start singing Christmas carols.  Well, here is your opportunity to do just that.  Or what if you wanted that hot chick from &quot;Married with Children&quot;  to sing a sexy little Christmas number as you drift off to sleep at night?  No, not the daughter.  I'm talking about the older MILF one that bought a new set of fake boobs with her first paycheck from the show.  Here she is just waiting to send you off to Slumber Town with her rendition of &quot;Have Yourself a &quot;Merry Little Christmas&quot;.  \n\nThe only downside I found to this collection was in the second track where John Lithgow performs a seriously creepy rendition of what can only be described as his initial rehearsal as the Trinity Killer years before his debut on the season 4 series of Dexter.  It really gave me goose bumps just listening to his banter with the girl who once was an attractive Fraser groupie and eventually turns into the neurotic Aunt on &quot;Jumanji&quot;.  There are no doubt a few weird moments here, but this album is surprisingly more straight-faced than you'd probably expect, given the comedic nature of NBC television at the time. Yet even while this album exceeds expectations, it's still not something that will replace that scratched up DVD of Rudolph the Red-Nosed Reindeer or Frosty the Snowman that you drop into the DVD player once a year.  But if you're a big fan of NBC or a celebrity junkie and looking for some out-of-the-ordinary Christmas music, this may be something worth looking into.  Everyone else should probably just stick with Bing Crosby and Nat King Cole to fill out your Christmas carols needs. \n\nNow, I know what you are thinking.  How can I download this awesome CD in fine pristine FLAC format that was ripped with care using Exact Audio Copy and all cover material was scanned and cropped with precise professionalism?  As Michael Jackson would say, &quot;What about the children?&quot; and the donations that this would represent?  How can I live with myself having performed such a deed?  Holy Shitballs!  It's the ASCII Pope here to absolve you of your guilt.  \n\n\n\n\n                 _||_\n                  ||\n                 /  \\\n                |    ||         \n                |____||        \n                @&quot;&quot;&quot;&quot;&quot;@        \n          /    @ 0 0 @    /\n          |     @  &gt;  @    |\n          O )   ( - )/  ( O   \n           `   -`_'-   /'/\n             __(===)__/ /\n                    |   /\n            /   | |xxx| | \n           /    | |xxx| |  \n          /     |  O/  |   \n         /      |==(Y)==|    \n        /       |   T   |     \n       /        |   |  |       \n      /         |   |  |        \n     &lt;          |   |  |        &gt;\n     ^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n                 |  |  |\n                 |  |  |\n                 |  |  |\n                   /  /\n                  ^/ ^/\n                   V   V\n\nThese guys wrote the book on absolution.  Of course, you could always donate directly to the charity itself if your anguish becomes too unbearable.  Let us also remember that if you download this torrent, it means you gotta seed this file till your ratio reaches 2 to 1.  If you don't, there is no telling what ASCII Pope is gonna do to your everlasting soul.  I would bet you get put on the express train to Hell where you land your new job as Hitler's room mate.  But why take the chance?  Do you and your conscience a favor and give a little of your time or money to your favorite local or national charity.  But until then, throw some chestnuts on that hearth, warm up a cup of eggnog and enjoy this spectacular collection of songs from these celebrities as their careers fade into oblivion.  Merry Xmas and God Bless us, everyone.\n","torrent":{"xt":"urn:btih:7b47e1a4eadb9a496e0d0627b34425f81f8d8cc0","amp;dn":"NBC+Celebrity+Christmas+-+2001+-+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b47e1a4eadb9a496e0d0627b34425f81f8d8cc0","infoHashBuffer":{"type":"Buffer","data":[123,71,225,164,234,219,154,73,110,13,6,39,179,68,37,248,31,141,140,192]},"announce":[],"urlList":[]}}