{"title":"Hee Haw 10th Anniversary Celebration","uid":8792718,"size":749932585,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7b4926bd690ac9d1ce9a175810b320ca5decb0df&amp;dn=Hee+Haw+10th+Anniversary+Celebration&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"KatSucks","files":2,"time":1375990871,"description":"Hee Haw 10th Anniversary Celebration\n\nNow fans of Buck Owens, Roy Clark, and all the Kornfield Kounty characters can take front-row seats at their 10th-anniversary concert with this release. HEE HAW 10th ANNIVERSARY documents this special event, which took place in 1978 at the Grand Ole Opry House and featured some of the day's most popular country performers.\n\nIn the summer of 1969, HEE HAW moseyed into the CBS time slot occupied by The Smothers Brothers Comedy Hour. Conceived as a rural alternative to Rowan &amp; Martin's Laugh-In, the show ranked in the top 20 nationally when CBS pulled the plug in 1971. But co-hosts Buck Owens and Roy Clark, along with the whole Kornfield Koundy gang, sang and joked on in syndication. In 1978, they grinned at the critics in a two-hour 10th-Anniversary shindig, which was videotaped with an audience of invited guests and fans at the Grand Ole Opry House. Mixing nostalgia with new performances by country music's biggest stars, this special edition of HEE HAW never missed a funnybone.\n\nHere's one for you trivia buffs - Did you know that Kenny Rogers met his wife Marianne Gordon while visiting the HEE HAW set? Kenny elaborates and then does himself proud with The Gambler, one of the biggest hits of 1978. As for Gordon - she's part of the show's tribute to the easy-on-the-eyes HEE HAW Girls. Junior Staples gets his due in a flashback sequence that shows his rare ability to mangle the English language when reading a cue card. Turning serious, HEE HAW pays it's respects to former cast members who passed on. Grandpa Jones his good friend and old fishing buddy Stringbean, while Buck Owens remembers his music partner and best friend for 16 years, Don Rich, with a medley of hits that made both of them famous.\n\nA lot happened on the show in ten years - just check out the video montage of reliable HEE HAW guest artists Tammy Wynette singing her way through a parade of striking outfits and memorable hairdos. Legendary guitar pickers Merle Travis and Chet Atkins also drop by. You'll never guess who gives Chet a kiss when he finishes his number. Another segment covers the celebrities who joined Archie Campbell for the popular song routine Pfft! You Were Gone. Talk about delivery - Johnny Cash has a big surprises in store for Archie.\n\n1978 Special 2-Hour Anniversary Shindig\nIncluding Appearances By:\nKenny Rogers\nBarbara Mandrell\nJunior Samples\nGrandpa Jones\nBuck Owens\nTammy Wynette\nMerle Travis\nChet Atkins\nArchie Campbell\nJohnny Cash\nMinnie Pearl\nand more ","torrent":{"xt":"urn:btih:7b4926bd690ac9d1ce9a175810b320ca5decb0df","amp;dn":"Hee+Haw+10th+Anniversary+Celebration","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b4926bd690ac9d1ce9a175810b320ca5decb0df","infoHashBuffer":{"type":"Buffer","data":[123,73,38,189,105,10,201,209,206,154,23,88,16,179,32,202,93,236,176,223]},"announce":[],"urlList":[]}}