{"title":"Robot Brains - Circuits and Systems for Conscious Machines (Male","uid":4910227,"size":2060576,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7b5a32fa105a7b792afd3679c0cebc300bf42325&amp;dn=Robot+Brains+-+Circuits+and+Systems+for+Conscious+Machines+%28Male&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1243114165,"description":" &lt;a href=&quot;http://www.image-upload.net/images/916j8psrxh2xv9nn68o0.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/916j8psrxh2xv9nn68o0.jpeg&lt;/a&gt;\n\nPentti O. Haikonen, &quot;Robot Brains: Circuits and Systems for Conscious Machines&quot;\nWiley-Interscience | 2007 | ISBN: 0470062045 | 224 pages | PDF\n\nHaikonen envisions autonomous robots that perceive and understand the world directly, acting in it in a natural human-like way without the need of programs and numerical representation of information. By developing higher-level cognitive functions through the power of artificial associative neuron architectures, the author approaches the issues of machine consciousness.\nRobot Brains expertly outlines a complete system approach to cognitive machines, offering practical design guidelines for the creation of non-numeric autonomous creative machines. It details topics such as component parts and realization principles, so that different pieces may be implemented in hardware or software. Real-world examples for designers and researchers are provided, including circuit and systems examples that few books on this topic give.\nIn novel technical and practical detail, this book also considers:\nthe limitations and remedies of traditional neural associators in creating true machine cognition;\n\nbasic circuit assemblies cognitive neural architectures;\nhow motors can be interfaced with the associative neural system in order for fluent motion to be achieved without numeric computations;\nmemorization, imagination, planning and reasoning in the machine;\nthe concept of machine emotions for motivation and value systems;\nan approach towards the use and understanding of natural language in robots.\nThe methods presented in this book have important implications for computer vision, signal processing, speech recognition and other information technology fields. Systematic and thoroughly logical, it will appeal to practising engineers involved in the development and design of robots and cognitive machines, also researchers in Artificial Intelligence. Postgraduate students in computational neuroscience and robotics, and neuromorphic engineers will find it an exciting source of information.","torrent":{"xt":"urn:btih:7b5a32fa105a7b792afd3679c0cebc300bf42325","amp;dn":"Robot+Brains+-+Circuits+and+Systems+for+Conscious+Machines+%28Male","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b5a32fa105a7b792afd3679c0cebc300bf42325","infoHashBuffer":{"type":"Buffer","data":[123,90,50,250,16,90,123,121,42,253,54,121,192,206,188,48,11,244,35,37]},"announce":[],"urlList":[]}}