{"title":"Thief III Deadly Shadows (GOG)","uid":12071821,"size":2153752550,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7ba2588e0a2a918527c730b175097e61bbb4aa6b&amp;dn=Thief+III+Deadly+Shadows+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"-Virtus-","files":8,"time":1435532782,"description":"About the game:\n=======================\nIn the third installment of the Thiefâ„¢ series, master-thief Garrett is contacted by Keeper Artemus with a mission to steal two valuable artifacts. At the same time, Garrett learns about a prophecy: the coming of a Dark Age. He embarks upon a journey to unravel a mystery that threatens the existence of the order of Keepers. Is it possible that there is a traitor in their midst?\n\nThe stealth and thievery game, Thiefâ„¢: Deadly Shadows comes with a number of improvements over two previous parts. Released in 2004, it left behind the aging Dark Engine, using a heavily modified Unreal engine instead. Realistic lighting effects have been implemented: each character and object now casts its own shadow. A third person's view has been made available in addition to the standard first person perspective.\n\nThe stealth system that made Thiefâ„¢: The Dark Project and Thiefâ„¢ 2: The Metal Age famous is still in place. You have to stick to the shadows and avoid making noise, as guards will react to anything suspicious. It is also the first game of the series that introduced free roaming. The City, divided into several unlockable districts, is yours to explore. You can interact with the city's inhabitants: pickpocket, steal, or even mug them for loot.\n\n\nFeatures:\n=======================\nIt falls in its predecessor's footsteps, using light and sound to provide a one-of-a-kind stealth gaming experience.\nFor the first time in the series, Garrett can freely roam the City. Explore dark alleys, overhear conversations, pickpocket guards, and even perform secondary missions which will influence player's standing with in-game factions.\nNew tools and moves added to Garrett's repertoire: climbing gloves allow you to scale walls, and can also flatten yourself against the walls to hide.\n\n\nVersion:\n=======================\nLatest game version as of today or GOG setup 2.0.0.6\n\n\nInstructions:\n=======================\nRun Setup and Install \nPlay - Enjoy - Seed!\n\n\nEssential improvements:\n=======================\nMod versions are the newest as of today. \n\n1. Sneaky Upgrade Unofficial patch:\nRead this page and if there are no newer versions for either Standard or Fat, then choose one version of Sneaky Upgrade from my torrent and install. Done! Play\n\nTIP: Skip intro videos:\nGo to the installation folder.\nGo to the System folder and open DEFAULT.INI.\nGo to the  section.\nChange ShowIntroMovies=True to ShowIntroMovies=False\nSave your changes.\n\n\nSystem Requirements:\n=======================\nProcessor: 1.8 GHz \nVideo card: 3D card compatible with DX7 (DX9 recommended)\nSystem memory: 512MB RAM (1 GB recommended)\nOperating system: Windows XP / Vista / 7 / 8\nHard disk drive: 2 GB available space \n\n\n\n\n             If you enjoyed the game then share with others by seeding\n                        Remember to support quality games","torrent":{"xt":"urn:btih:7ba2588e0a2a918527c730b175097e61bbb4aa6b","amp;dn":"Thief+III+Deadly+Shadows+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ba2588e0a2a918527c730b175097e61bbb4aa6b","infoHashBuffer":{"type":"Buffer","data":[123,162,88,142,10,42,145,133,39,199,48,177,117,9,126,97,187,180,170,107]},"announce":[],"urlList":[]}}