{"title":"Learn C++ - Programming Abstractions by seyamco","uid":5307029,"size":3936643824,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:7c2b30045d208753ad377889c658dba290850a79&amp;dn=Learn+C%2B%2B+-+Programming+Abstractions+by+seyamco&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"seyamco","files":28,"time":1264433675,"description":"Introduction to Computer Science Programming Abstractions\n\n\n\n\nThis course is the natural successor to Programming Methodology and covers such advanced programming topics as recursion, algorithmic analysis, and data abstraction using the C++ programming language, which is similar to both C and Java. If you've taken the Computer Science AP exam and done well (scored 4 or 5) or earned a good grade in a college course, Programming Abstractions may be an appropriate course for you to start with, but often Programming Abstractions (Accelerated) is a better choice. Programming Abstractions assumes that you already have familiarity with good programming style and software engineering issues (at the level of Programming Methodology), and that you can use this understanding as a foundation on which to tackle new topics in programming and data abstraction. \n\nTopics: Abstraction and its relation to programming. Software engineering principles of data abstraction and modularity. Object-oriented programming, fundamental data structures (such as stacks, queues, sets) and data-directed design. Recursion and recursive data structures (linked lists, trees, graphs). Introduction to time and space complexity analysis. Uses the programming language C++ covering its basic facilities.\n\nPrerequisites: Solid performance in Programming Methodology and readiness to move on to advanced programming topics. A comparable introductory programming course (including high school AP courses) is often a reasonable substitute for our Programming Methodology. ","torrent":{"xt":"urn:btih:7c2b30045d208753ad377889c658dba290850a79","amp;dn":"Learn+C%2B%2B+-+Programming+Abstractions+by+seyamco","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c2b30045d208753ad377889c658dba290850a79","infoHashBuffer":{"type":"Buffer","data":[124,43,48,4,93,32,135,83,173,55,120,137,198,88,219,162,144,133,10,121]},"announce":[],"urlList":[]}}