{"title":"The Mortality Doctrine Series - James Dashner","uid":13146767,"size":12255676,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7c4dfd9fb7a8817d64d73d958e071bbc991be3de&amp;dn=The+Mortality+Doctrine+Series+-+James+Dashner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":12,"time":1452030355,"description":"01. Gunner Skale [The Mortality Doctrine, #0.5] - James Dashner\r\n \r\nFrom James Dashner, the New York Times bestselling author of the Maze Runner series, comes an original thirty-page e-short returning fans to the fast-paced, high-tech world from The Eye of Minds, the first book in the Mortality Doctrine series. Find out how Gunner Skale, the best gamer on the VirtNet, becomes a legend in this story available exclusively online.\r\n \r\n02. The Eye of Minds [The Mortality Doctrine, #01] - James Dashner\r\n \r\nMichael is a gamer. And like most gamers, he almost spends more time on the VirtNet than in the actual world. The VirtNet offers total mind and body immersion, and it’s addictive. Thanks to technology, anyone with enough money can experience fantasy worlds, risk their life without the chance of death, or just hang around with Virt-friends. And the more hacking skills you have, the more fun. Why bother following the rules when most of them are dumb, anyway?\r\n\r\nBut some rules were made for a reason. Some technology is too dangerous to fool with. And recent reports claim that one gamer is going beyond what any gamer has done before: he’s holding players hostage inside the VirtNet. The effects are horrific—the hostages have all been declared brain-dead. Yet the gamer’s motives are a mystery.\r\n\r\nThe government knows that to catch a hacker, you need a hacker.\r\nAnd they’ve been watching Michael. They want him on their team.\r\nBut the risk is enormous. If he accepts their challenge, Michael will need to go off the VirtNet grid. There are back alleys and corners in the system human eyes have never seen and predators he can’t even fathom—and there’s the possibility that the line between game and reality will be blurred forever.\r\n \r\n03. The Rule of Thoughts [The Mortality Doctrine, #02] - James Dashner\r\n \r\nMichael completed the Path. What he found at the end turned everything he’d ever known about his life—and the world—completely upside down.\r\n\r\nHe barely survived. But it was the only way VirtNet Security knew to find the cyber-terrorist Kaine—and to make the Sleep safe for gamers once again. And, the truth Michael discovered about Kaine is more complex than they anticipated, and more terrifying than even the worst of their fears.\r\n\r\nKaine is a tangent, a computer program that has become sentient. And Michael’s completing the Path was the first stage in turning Kaine’s master plan, the Mortality Doctrine, into a reality.\r\n\r\nThe Mortality Doctrine will populate Earth entirely with human bodies harboring tangent minds. Any gamer who sinks into the VirtNet risks coming out with a tangent intelligence in control of their body.\r\n\r\nAnd the takeover has already begun.\r\n \r\n04. The Game of Lives [The Mortality Doctrine, #03] - James Dashner\r\n \r\nMichael used to live to game, but the games he was playing have become all too real. Only weeks ago, sinking into the Sleep was fun. The VirtNet combined the most cutting-edge technology and the most sophisticated gaming for a full mind-body experience. And it was Michael’s passion. But now every time Michael sinks, he risks his life.\r\n\r\nThe games are over. The VirtNet has become a world of deadly consequences, and Kaine grows stronger by the day. The Mortality Doctrine—Kaine’s master plan—has nearly been realized, and little by little the line separating the virtual from the real is blurring. If Kaine succeeds, it will mean worldwide cyber domination. And it looks like Michael and his friends are the only ones who can put the monster back in the box—if Michael can figure out who his friends really are","torrent":{"xt":"urn:btih:7c4dfd9fb7a8817d64d73d958e071bbc991be3de","amp;dn":"The+Mortality+Doctrine+Series+-+James+Dashner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c4dfd9fb7a8817d64d73d958e071bbc991be3de","infoHashBuffer":{"type":"Buffer","data":[124,77,253,159,183,168,129,125,100,215,61,149,142,7,27,188,153,27,227,222]},"announce":[],"urlList":[]}}