{"title":"Orson Scott Card - Women of Genesis","uid":11756177,"size":1063323,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7d90a59654949d8959828871afcacd667b0908ea&amp;dn=Orson+Scott+Card+-+Women+of+Genesis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"valken666","files":1,"time":1426386408,"description":"Credits go to drifter101. \n\n1\nIn SARAH, Orson Scott Card uses his fertile imagination and uncanny insight into human nature to flesh out a unique woman-one who is beautiful, tough, smart and resourceful in an era when women get short shrift in life as well as in the historical record. Sarah takes on a vivid reality as a woman desirable to kings, a devoted wife and a faithful follower of the God of Abraham, chosen to experience an incomparable miracle. Set in the splendour and excess of Egypt and the starkly beautiful desert landscapes of the Sinai Peninsular, SARAH is an altogether believable and provocatve drama.\n\n2\nBorn into a time and place where a woman speaks her mind at her peril, and reared as a motherless child by a doting father, Rebekah grew up to be a stunning, headstrong beauty. She was chosen by God for a special destiny. Rebekah leaves her father's house to marry Isaac, the studious young son of the Patriarch Abraham, only to find herself caught up in a series of painful rivalries, first between her husband and his brother Ishamael, and later between her sons Jacob and Esau. Her struggles to find a place in the family of Abraham are a true test of her faith, but through it all she finds her own relationship with God and does her best to serve His cause in the lives of those she loves.\n\n3\nLeah was so young when her sister Rachel was born that she could not remember a time when Rachel was not the darling of the family-pretty, clever, and cute, whereas Leah plugged along being obedient, hard-working, and responsible. Then one day a good-looking marriageable kinsman named Jacob showed up, looking for a haven from his brother's rage, and Leah fell in love at once. It didn't surprise her at all that Jacob saw only Rachel. But surely, as the two sisters worked and lived alongside Jacob for seven years, he would come to realize that Leah was the one he ought to marry","torrent":{"xt":"urn:btih:7d90a59654949d8959828871afcacd667b0908ea","amp;dn":"Orson+Scott+Card+-+Women+of+Genesis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d90a59654949d8959828871afcacd667b0908ea","infoHashBuffer":{"type":"Buffer","data":[125,144,165,150,84,148,157,137,89,130,136,113,175,202,205,102,123,9,8,234]},"announce":[],"urlList":[]}}