{"title":"Horace Silver - Blowin' the Blues Away (1959) [Ja","uid":4839829,"size":104161663,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7d9d7309b0a3f67fb4e5ab52f95f82782e85c217&amp;dn=Horace+Silver+-+Blowin%5C%27+the+Blues+Away+%281959%29+%5BJa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"schon55","files":15,"time":1239459766,"description":"Horace Silver - Blowin' the Blues Away\nOriginal Year: 1959\nLabel. Blue Note (1999, RVG Remastered)\nTotal time: 42:57\nBitrate: 320 kbps\n\nBlowin' the Blues Away is one of Horace Silver's all-time Blue Note classics, only upping the ante established on Finger Poppin' for tightly constructed, joyfully infectious hard bop. This album marks the peak of Silver's classic quintet with trumpeter Blue Mitchell, tenor saxophonist Junior Cook, bassist Gene Taylor, and drummer Louis Hayes; it's also one of the pianist's strongest sets of original compositions, eclipsed only by Song for My Father and Horace Silver and the Jazz Messengers. The pacing of the album is impeccable, offering up enough different feels and slight variations on Silver's signature style to captivate the listener throughout.  Two songs -- the warm, luminous ballad 'Peace' and the gospel-based call-and-response swinger 'Sister Sadie' -- became oft-covered standards of Silver's repertoire, and the madly cooking title cut wasn't far behind.  And they embody what's right with the album in a nutshell -- the up-tempo tunes ('Break City') are among the hardest-swinging Silver had ever cut, and the slower changes of pace ('Melancholy Mood') are superbly lyrical, adding up to one of the best realizations of Silver's aesthetic. Also, two cuts ('Melancholy Mood' and the easy-swinging 'The St. Vitus Dance') give Silver a chance to show off his trio chops, and 'Baghdad Blues' introduces his taste for exotic, foreign-tinged themes. Through it all, Silver remains continually conscious of the groove, playing off the basic rhythms to create funky new time patterns. The typical high-impact economy of his and the rest of the band's statements is at its uppermost level, and everyone swings with exuberant commitment. In short, Blowin' the Blues Away is one of Silver's finest albums, and it's virtually impossible to dislike. ~ Steve Huey, AMG\n\nCan it really be over forty years since this excellent example of Horace Silver's music was recorded? This has everything. The Trio as well as the Quintet with the greatest tenor player, Junior Cook. The music with the driving title track, the stirring Sister Sadie and the wonderful track which is so aptly entitled 'Peace'. Possibly the best that Horace Silver has recorded? Whether it is or not, this CD spends as much time on my player as the original LP did 30+ years ago. Wonderful music by one of the greats of jazz. ~ David Beckett\n\nPersonnel:\nHorace Silver (Piano) \nBlue Mitchell (Trumpet) \nJunior Cook (Tenor Saxophone) \nGene Taylor (Double Bass) \nLouis Hayes (Drums) \n\nHorace Silver - Blowin' the Blues Away Tracks:\n01  Blowin' The Blues Away (Horace Silver) 4:45 \n02  The St. Vitus Dance (Horace Silver) 4:09 \n03  Break City (Horace Silver) 4:57 \n04  Peace (Horace Silver) 6:02 \n05  Sister Sadie (Horace Silver) 6:19 \n06  The Baghdad Blues (Horace Silver) 4:52 \n07  Melancholy Mood (Horace Silver) 7:10 \n08  How Did It Happen (Don Newey) 4:40 \n\n","torrent":{"xt":"urn:btih:7d9d7309b0a3f67fb4e5ab52f95f82782e85c217","amp;dn":"Horace+Silver+-+Blowin%5C%27+the+Blues+Away+%281959%29+%5BJa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d9d7309b0a3f67fb4e5ab52f95f82782e85c217","infoHashBuffer":{"type":"Buffer","data":[125,157,115,9,176,163,246,127,180,229,171,82,249,95,130,120,46,133,194,23]},"announce":[],"urlList":[]}}