{"title":"The Beatles - Unsurpassed Broadcasts (13 CD)","uid":9603985,"size":3244526293,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7dd59ba2ab5470a0ef82f7b8007f5db6b6d1c511&amp;dn=The+Beatles+-+Unsurpassed+Broadcasts+%2813+CD%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"tbeat03","files":1,"time":1392181822,"description":"THE BEATLES\nUNSURPASSED BROADCASTS (2nd Edition) (13 CD)\n\n[packaged to .RAR due to this site doesn't support too much files extracted]\n\n\nDue to the surfacing of some new and some upgrades of the recordings The Beatles did for the BBC in 1962-1965, the old Beatles at the Beeb catalogue has gotten a facelift. It is being re-released in full, and is starting to appear as individual releases, packaged as bundled flac and cue files on the internet, together with artwork for those who still like to store physical media on their shelves.\n The releases is the undertaking of a single collector, who has done improvements to the material in the following fashion:\n\n    new and better versions of quite a number of songs were broadcast by the BBC last year and has been included, \n    some vinyl-only bootlegs have been found to contain material in better quality than previous CD releases, \n    audio equipment for the home computer has improved and has been put to good use in 'cleaning up' the sound quality. \n\nThe standard catalogue for the Beatles BBC recordings has for the past few years been Purple Chick's The Complete BBC Sessions (upgraded for 2004), and this new set is called Unsurpassed Broadcasts. The first two volumes released thus far have been Vol. 2 and 3. They have been distributed freely on the internet, and if you have connections, I'm sure you will be able to find them.","torrent":{"xt":"urn:btih:7dd59ba2ab5470a0ef82f7b8007f5db6b6d1c511","amp;dn":"The+Beatles+-+Unsurpassed+Broadcasts+%2813+CD%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7dd59ba2ab5470a0ef82f7b8007f5db6b6d1c511","infoHashBuffer":{"type":"Buffer","data":[125,213,155,162,171,84,112,160,239,130,247,184,0,127,93,182,182,209,197,17]},"announce":[],"urlList":[]}}