{"title":"Elvis Found Alive  dvdrip avi","uid":7762837,"size":4769705070,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:80210fac925406ab68ab3e19c1c0725629bee827&amp;dn=Elvis+Found+Alive++dvdrip+avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbub37","files":1,"time":1351281734,"description":"Direced and Produced by Joel Gilbert. Elvis has been Found, ALIVE! After visting Graceland, Directer Joel Gilbert made a freedom of informantion act request for US government files on Elvis Presley, incredibly, documents arrived from the FBI revealing an address for Federal agent &quot;Jon Burrows.&quot;Elvis' 1970s alias, in Simi Vally, California. after a brief confrontation, Elvis agreed to chronicle the secret history of his life and &quot;death&quot; in a exclsive interview. \n\nin Elvis Found Alive, Elvis reflects on his early life and career, and describes his admiration for his look-alike, comic book hero Captain Marvel Jr, He explains that social unrest in the lat 1960's and terrorism by the Weather Underground drove him to ask President Nixon to make him a Federal Agent.&quot;if I could help save America, maybe it was my true destiny that God had prepared me for.&quot;\n\nElvis reveals that he battled  Weatherman Underground Bill Ayers and the Mafia crime families during the 1970's, leading to a fake death to go undercover. What followed was a long struggle to return to his singing career, and an Obama administration that is proventing it to this day. Elvis Presley remains the single most influential and respected figure in the hisory of Rock and Roll music. Today he is a symbol of America, as recognizable as the flag.\nGet ready. hes back!!\n\n\n\n","torrent":{"xt":"urn:btih:80210fac925406ab68ab3e19c1c0725629bee827","amp;dn":"Elvis+Found+Alive++dvdrip+avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80210fac925406ab68ab3e19c1c0725629bee827","infoHashBuffer":{"type":"Buffer","data":[128,33,15,172,146,84,6,171,104,171,62,25,193,192,114,86,41,190,232,39]},"announce":[],"urlList":[]}}