{"title":"Walt Whitman's Secret by George Fetherling(retail EPUB MOBI AZW3","uid":10824085,"size":6384433,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:80a536e005de1051ddc0bb5b5633f7ad87e64fc4&amp;dn=Walt+Whitman%27s+Secret+by+George+Fetherling%28retail+EPUB+MOBI+AZW3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gratefuldawg77","files":6,"time":1408564785,"description":"As compelling and revelatory as Colm Toibin's The Master, Walt Whitman's Secret mines the life of the most influential poet in the American canon for insights about creativity, relations between the sexes and the dangers of excessive patriotism.\n\nIn this wonderfully imagined novel, Walt Whitman's secret isn't his homosexuality but another one entirely. It's a political secret, one that the greatest American poet of the nineteenth century has pledged himself to keep until he is on his deathbed.\n\nOnly in that way can Whitman protect the great love of his life - a Confederate deserter he met in Washington during the Civil War - from the calumnies and scandals that have muddied his own reputation ever since the first publication of Leaves of Grass. The person who finally hears his confession is Horace, his unpaid amanuensis and helper, a young man who will go on to fill nine fat volumes with a verbatim record of the great man's tabletalk and often deceptive reminiscences. Only after Whitman has gone does Horace realize that Whitman seems to be making him a bequest of not only the secret but of his own complex personality as well","torrent":{"xt":"urn:btih:80a536e005de1051ddc0bb5b5633f7ad87e64fc4","amp;dn":"Walt+Whitman%27s+Secret+by+George+Fetherling%28retail+EPUB+MOBI+AZW3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80a536e005de1051ddc0bb5b5633f7ad87e64fc4","infoHashBuffer":{"type":"Buffer","data":[128,165,54,224,5,222,16,81,221,192,187,91,86,51,247,173,135,230,79,196]},"announce":[],"urlList":[]}}