{"title":"Sonny Chiba - Masutatsu Oyama Trilogy","uid":9444240,"size":12740543195,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:80a601f763bd3bd8b5793c45d244ab1e66a664e3&amp;dn=Sonny+Chiba+-+Masutatsu+Oyama+Trilogy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rahan68","files":-1,"time":1389062772,"description":"Three action packed films starring Sonny Chiba are included. This trilogy is based on the life of Chiba's mentor, master Masutatsu Oyama. In Karate Bear Fighter, Oyama wins the all-Japan Karate tournament, but those in the conventional karate world are resentful of his skill and try to banish him. In Karate Bull Fighter, Oyama denounces martial arts after killing a gang leader in a bar fight. In Karate for Life, the Karate Society of Japan ostracizes Oyama after fighting both a bull and a bear. But during a promoter prearranged game where the opponents play dirty, Oyama loses all self-control.\n\nThis collection presents all three films in the MAS OYAMA trilogy, which finds martial arts legend Sonny Chiba playing the role of his real-life mentor Masutatsu Oyama, who was famous for creating a new form of karate in the postwar period. The first of the films, KARATE BULL FIGHTER (1975), is the story of Oyama's humble beginnings as a penniless hopeful. In KARATE BEAR FIGHTER (1975), Oyama wins a nationwide tournament using his new style. And in KARATE FOR LIFE (1977), the newly minted master sets up his own dojo.","torrent":{"xt":"urn:btih:80a601f763bd3bd8b5793c45d244ab1e66a664e3","amp;dn":"Sonny+Chiba+-+Masutatsu+Oyama+Trilogy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80a601f763bd3bd8b5793c45d244ab1e66a664e3","infoHashBuffer":{"type":"Buffer","data":[128,166,1,247,99,189,59,216,181,121,60,69,210,68,171,30,102,166,100,227]},"announce":[],"urlList":[]}}