{"title":"British Forts in the Age of Arthur","uid":11772558,"size":32477161,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:82390e827839e9ce215899ceddbf64616b061b57&amp;dn=British+Forts+in+the+Age+of+Arthur&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1427132032,"description":"When the Romans left Britain around AD 410 the island had not been fully subjugated. In the Celtic fringes the unconquered native peoples were presented with the opportunity to pillage what remained of Roman Britain. By way of response the Post-Roman Britons did their best to defend themselves from attack, and to preserve what they could of the systems left behind by the Romans. The best way to defend their territory was to create fortifications. While some old Roman forts were maintained, the Post-Roman Britons also created new strongholds, or re-occupied some of the long-abandoned hill-forts first built by their ancestors before the coming of the Romans.\n\nPacked with photographs, diagrams and full color artwork reconstructions, this book provides a unique examination of the design and development of the fortifications during the Age of Arthur, analyzing their day-to-day use and their effectiveness in battle. It closely describes the locations that are linked to the most famous warlord of the Dark Ages, the legendary Arthur - Tintagel, Cadbury and &quot;Camelot&quot;. Although these great bastions were to eventually fall, for a few brief decades they succeeded in stemming the tide of invasion and in doing so safeguarding the culture and civilization of Post-Roman Celtic Britain","torrent":{"xt":"urn:btih:82390e827839e9ce215899ceddbf64616b061b57","amp;dn":"British+Forts+in+the+Age+of+Arthur","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82390e827839e9ce215899ceddbf64616b061b57","infoHashBuffer":{"type":"Buffer","data":[130,57,14,130,120,57,233,206,33,88,153,206,221,191,100,97,107,6,27,87]},"announce":[],"urlList":[]}}