{"title":"Drm.Removal.v4.2.0.Patch-BBB","uid":6482323,"size":27447891,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8326c77e778bd9d43030fe7f86bbed1edc32b2ff&amp;dn=Drm.Removal.v4.2.0.Patch-BBB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anacondaz","files":-1,"time":1308577570,"description":"Drm-Removal 4.2.0\n\nEasily convert DRM protected music files and various audio files to unprotected MP3, CD, iPod and other MP3 player file formats at high speed and CD quality - legally. With just a few mouse clicks you can enjoy all your protected songs on iPod, any other MP3 player, CD player, mobile phone or PC - without any restrictions or DRM protection.\n\nFast and simple to use DRM protected media converter. Easily converts ALL audio and video files from your PC to unprotected MP3, WMA, AAC, iPod at high speed and preserving original quality. Legally. With a single click your got your MP3, AVI (or other audio and video) converted and copied directly to iPod without loosing ID3 tags and quality. Convert iPod media library to MP3 or WMA that you can play in any of yours players - in your car, your music station or portable video player. Convert WMA to MP3 and remove DRM. Convert M4P to MP3, WMA to MP3, Napster to MP3, iTunes to MP3, ...\n\nKey features of Drm-Removal.\n\n- Drm-Removal will convert ALL audio formats that you can listen to in your Windows Media Player, iTunes player or Apple Quick Time. Media copy protection will be removed after convertion.\n- Drm-Removal will convert ALL video formats (do not care is it protected content or not) that you can play with Windows Media player, iTunes player or Apple Quick Time. Media copy protection will be removed after convertion.\n- Simple user interface and very fast conversion speed (up to 40x) from playback speed will let you enjoy your converted and unprotected audio and video in seconds.\n- Drm-Removal is simple to install, easy to use and fast to convert!\n- Freedom from audio and video copy-protection formats - Learn more .... Remove DRM with Drm-Removal.\n- DRM removal software - unprotects your media, convert drm protected files.\n- Drm-Removal Supported formats, DRM Converter, Audiobooks converter, ...\n\nHome Page - http://drm-removal.com/\n","torrent":{"xt":"urn:btih:8326c77e778bd9d43030fe7f86bbed1edc32b2ff","amp;dn":"Drm.Removal.v4.2.0.Patch-BBB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8326c77e778bd9d43030fe7f86bbed1edc32b2ff","infoHashBuffer":{"type":"Buffer","data":[131,38,199,126,119,139,217,212,48,48,254,127,134,187,237,30,220,50,178,255]},"announce":[],"urlList":[]}}