{"title":"Frank Miller - 300 (Digital-Restored) (Request)","uid":10216341,"size":133741476,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:837d588c0684969a9987bb23e8927ea8d1afbeef&amp;dn=Frank+Miller+-+300+%28Digital-Restored%29+%28Request%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1400972949,"description":"Restored in this case means post-scan correction/adjusting of color, blacks, light and darkness. To say more than that is pointless geeking out.\n\n--------------------------------------------------------------------------------\n\n300\n\nWritten and Illustrated by Frank Miller\nColors by Lynn Varley\n\nDark Horse, 1999, 88 pages \n\nMost everyone knows what this is by now, but Publisher's Weekly said...\n\nThe Battle of Thermopylae ranks as one of the ancient world's most important events, where Spartan King Leonidas and his 300-man bodyguard met the massive army of Emperor Xerxes of Persia, who intended to add Greece to his empire. To no one's surprise, the Spartans were destroyed. While the battle bought the Greeks enough time to defeat the mighty Persians, it was more important for the metaphor it created: occasionally one has to lose to win. This is clearly the inspiration behind Miller's attempt to place this epic tale in the context of a graphic novel. A renowned comics artist and writer known for hard-boiled stories of almost operatic intensity and stylishly overwrought violence, Miller (Sin City) injects his own brand of graphic sensationalism into this ancient tale of national survival. Miller clearly isn't as interested in being a historian as he is in telling a story, but his portrayal of the ancient world is compelling. His drawings of the bearded Leonidas are pensive and starkly imperial. The Persian King Xerxes is represented as majestically African, his body covered in a gaudy and bejeweled network of meticulously rendered chains and bracelets. Form and content are ideally wedded: Miller's writing is stark, his drawings moody and dramatic, and intensified by Varley's grimly appropriate palette of earth and blood. The reader can see and feel the harshness of both the Grecian landscape and Sparta's battle-worshipping culture, as Miller presents the complex historical moment facing the 300.","torrent":{"xt":"urn:btih:837d588c0684969a9987bb23e8927ea8d1afbeef","amp;dn":"Frank+Miller+-+300+%28Digital-Restored%29+%28Request%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"837d588c0684969a9987bb23e8927ea8d1afbeef","infoHashBuffer":{"type":"Buffer","data":[131,125,88,140,6,132,150,154,153,135,187,35,232,146,126,168,209,175,190,239]},"announce":[],"urlList":[]}}