{"title":"Grateful Dead - Wake Of The Flood (1973) 2013 HDTracks 24-96-FLA","uid":11150734,"size":970640431,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:83e82e460d8ab973edb1f633e55a24afdfa1e66f&amp;dn=Grateful+Dead+-+Wake+Of+The+Flood+%281973%29+2013+HDTracks+24-96-FLA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"hal4000","files":-1,"time":1412343113,"description":"The Grateful Dead was an American rock band formed in 1965 in Palo Alto, California. The band was known for its unique and eclectic style, which fused elements of rock, folk, bluegrass, blues, reggae, country, improvisational jazz, psychedelia, and space rock, and for live performances of long musical improvisation. &quot;Their music,&quot; writes Lenny Kaye, &quot;touches on ground that most other groups don't even know exists.&quot; These various influences were distilled into a diverse and psychedelic whole that made the Grateful Dead &quot;the pioneering Godfathers of the jam band world&quot;. They were ranked 57th in the issue The Greatest Artists of all Time by Rolling Stone magazine. They were inducted into the Rock and Roll Hall of Fame in 1994 and their Barton Hall Concert at Cornell University (May 8, 1977) was added to the Library of Congress's National Recording Registry. The Grateful Dead have sold more than 35 million albums worldwide.\n\nAfter satisfying their nine-title/dozen-disc deal with Warner Brothers, the Dead began their own record labels: Grateful Dead Records (for group releases) and Round Records (for solo projects). Wake of the Flood was the first Dead disc issued entirely under the band's supervision -- which also included manufacturing and marketing. Additionally, the personnel had been altered as Ron &quot;Pigpen&quot; McKernan had passed away. The keyboard responsibilities were now in the capable hands of Keith Godchaux -- whose wife Donna Jean Godchaux also provided backing vocals. It had been nearly three years since American Beauty -- their previous and most successful studio album to date -- and, as always, the Dead had been honing the material in concert. A majority of the tracks had been incorporated into their live sets -- some for nearly six months -- prior to entering the recording studio. This gave the band a unique perspective on the material, much of which remained for the next 20-plus years as staples of their concert performances. However, the inspiration and magic of the Grateful Dead's music has always been a challenge to capture in the non-reciprocal confines of a studio. Therefore, while Wake of the Flood was certainly as good -- if not arguably better than -- most of their previous non-live efforts, it falls far short of the incendiary performances the band was giving during this era. There are a few tracks that do tap into some of the Dead's jazzier and exceedingly improvisational nature. &quot;Eyes of the World&quot; contains some brilliant ensemble playing -- although the time limitations inherent in the playback medium result in the track fading out just as the Dead start to really cook. Another highlight is Bob Weir's &quot;Weather Report Suite,&quot; which foreshadows the epic proportions that the song would ultimately reach. In later years, the band dropped the opening instrumental &quot;Prelude,&quot; as well as &quot;Part One,&quot; choosing to pick it up for the extended &quot;Let It Grow&quot; section. The lilting Jerry Garcia ballad &quot;Stella Blue&quot; is another track that works well in this incarnation and remained in the Dead's rotating set list for the remainder of their touring careers.\n\nHDTracks PCM-24Bit-96Khz-FLAC.","torrent":{"xt":"urn:btih:83e82e460d8ab973edb1f633e55a24afdfa1e66f","amp;dn":"Grateful+Dead+-+Wake+Of+The+Flood+%281973%29+2013+HDTracks+24-96-FLA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83e82e460d8ab973edb1f633e55a24afdfa1e66f","infoHashBuffer":{"type":"Buffer","data":[131,232,46,70,13,138,185,115,237,177,246,51,229,90,36,175,223,161,230,111]},"announce":[],"urlList":[]}}