{"title":"Fly me to the Moon (2008) [Rocksocker]","uid":4738965,"size":4614114276,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:84117532e05f22ce39fc756d0abf24a0e34dc3d2&amp;dn=Fly+me+to+the+Moon+%282008%29+%5BRocksocker%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rocksocker","files":38,"time":1235448162,"description":"Fly Me to the Moon (2008) [Rocksocker]\nWidescreen Edition DVD\n--------------------**\n\n\n\nPlot\n--**\nChristopher Lloyd, Kelly Ripa, Nicollette Sheridan, and Tim Curry lend their voices to director Ben Stassen's (Haunted Castle and Encounter in the Third Dimension) animatedchildren's fantasy about three preteen flies who hitch a ride into space on the Apollo 11 moon mission. The year is 1969, and Americans all across the country are buzzing about the first manned mission to the moon. Even the insects aren't immune to the excitement, as evidenced by the enthusiasm of adolescent flies Nat (voice of Trevor Gagnon), IQ (voice of Philip Daniel Bolden), and Scooter (voice of David Gore). Over the years, Nat's grandpa (voice of Lloyd) has often recalled the time he hitched a ride on Amelia Earhart's airplane during the famed aviator's cross-Atlantic flight, and now Nat's dreams of recreating that feat on a much larger scale are finally set to come true. But while the three young flies only believe that they'll be gone for a few minutes, the fact is that they'll be drifting through space for almost an entire week. Just as they're about to sneak aboard the ship, the flies are spotted by a keen-eyed NASA ground control official and stored in a test tube for future study. Later in the flight, when the ship's engine malfunctions, the only ones capable of fixing the problem are the three tiny stowaways. But their mission isn't accomplished just yet, because grandpa's old flame Nadia (voice of Sheridan) has just arrived from Russia to warn him that a tiny fly-spy named Yegor (voice of Curry) has been assigned the task of traveling to Cape Canaveral and sabotaging the computer flight plans. Should Nat, IQ, and Scooter fail to act in time, Yegor's mission could spell disaster not only for the three thrill-seeking flies, but the entire U.S. space program. ~ Jason Buchanan, All Movie Guide\n\n\nLanguages\n-------**\t\nEnglish\nFrench\n\n               \nRelease Date\n----------**\nDecember 2nd, 2008\n\n\nGenre\n---**\nFantasy\n\n\nFormat\n----**\nWidescreen Edition DVD\n\n\nMPAA Rating\n---------**\nG General audience\n\n\nRuntime\n-----**\n1 hour 25 minutes\n\n\nStudio\n----**\nUniversal Studios\n\n\n\n\n\nI hope you enjoy this torrent, please feel free to write any comments about the quality of my torrents, I do read them! Also, if you've enjoyed this torrent please seed at 2:1 ratio, this will help the torrent community! :)\n\n[Rocksocker]\n\n","torrent":{"xt":"urn:btih:84117532e05f22ce39fc756d0abf24a0e34dc3d2","amp;dn":"Fly+me+to+the+Moon+%282008%29+%5BRocksocker%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84117532e05f22ce39fc756d0abf24a0e34dc3d2","infoHashBuffer":{"type":"Buffer","data":[132,17,117,50,224,95,34,206,57,252,117,109,10,191,36,160,227,77,195,210]},"announce":[],"urlList":[]}}