{"title":"Bon Jovi - Born To Be My Baby  (2nafish)","uid":5213068,"size":187545604,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:841ba6f2ce01210be1b568f238f5a23f37577a2e&amp;dn=Bon+Jovi+-+Born+To+Be+My+Baby++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1260676423,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Born to Be My Baby&quot; is a song performed by American rock band Bon Jovi. It was written by Jon Bon Jovi, Richie Sambora, and Desmond Child. It was released as the second single from their hugely successful album New Jersey in 1989. It peaked at #3 on the Billboard Hot 100 in 1990. The song also made it to #7 on the Mainstream Rock Tracks chart, #22 in the UK, and #30 in Australia.\n\n&quot;Born to Be My Baby&quot; was the second of five singles from the New Jersey album to chart in the Top 10 of the Billboard Hot 100, the most singles from an album to chart in the Top 10 for a rock band.\n\nThe video for the song was done in all black-and-white, like many of the band's videos from the New Jersey album.\n\nA very low budget video, it was shot all in the studio, chronicling the recording process for &quot;Born to Be My Baby&quot;. In the full length video, there is actually dialogue between band members and the band does the chorus again, unsatisfied with the original version. The video prominently features photogenic shots of Jon Bon Jovi singing, as well as the band gathering around a microphone to sing the &quot;na-na-na-na-na&quot; part. The video also features Jon Bon Jovi's wife of 18 years Dorothea.\n\nThe video was featured on New Jersey: The Videos, a promotional VHS that is no longer manufactured. The video was notably absent from the video collection Cross Road: The Videos.\n\nThe song can be described almost as a forgotten gem as it was notably absent from the band's 1994 compilation Cross Road, and also as it doesn't receive nearly as much radio airplay as the Slippery When Wet singles and New Jersey's two #1 singles receive.\n\nHowever, the song has remained a favorite among fans and the band has obviously taken note, as it has been a setlist staple on Bon Jovi's last four tours (&quot;Crush Tour&quot;, &quot;Bounce Tour&quot;, &quot;Have a Nice Day&quot; and &quot;Lost Highway&quot; Tour), and was also featured on the band's acoustic re-invention album This Left Feels Right, where the song became a romantic ballad.\n\nNew Jersey is Bon Jovi's fourth album, released on September 19, 1988. New Jersey was particularly notable for producing five Billboard Hot 100 Top 10 singles, the most top ten hits to date for a rock album. New Jersey was supported by the massive New Jersey Syndicate Tour, which ran from 1988 to 1990. Additionally, the album was supported by two home video releases: New Jersey: The Videos (a collection of music videos from New Jersey) and Access All Areas (a chronicle of the band's world tour). The album was remastered and re-released in 1998, adding the music video for &quot;Lay Your Hands on Me&quot; as a bonus track.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:841ba6f2ce01210be1b568f238f5a23f37577a2e","amp;dn":"Bon+Jovi+-+Born+To+Be+My+Baby++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"841ba6f2ce01210be1b568f238f5a23f37577a2e","infoHashBuffer":{"type":"Buffer","data":[132,27,166,242,206,1,33,11,225,181,104,242,56,245,162,63,55,87,122,46]},"announce":[],"urlList":[]}}