{"title":"Portrait Professional Max 6.3.5Portable","uid":5300365,"size":12480853,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8457bc0fb9a8668c7f9a28e58f8fde482d59b9e9&amp;dn=Portrait+Professional+Max+6.3.5Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"strausbergq","files":1,"time":1264199809,"description":"Portrait Professional is new intelligent portrait airbrushing software that has been 'trained' in human beauty. It lets you improve your photos instantly, just by moving sliders. With Portrait Professional, it's incredibly easy and fast to:\n\n\n*Subtly reshape all or any aspect of the face to make it more attractive\n*Fix skin blemishes such as spots or pimples\n*Reduce and/or remove wrinkles\n*Remove grease, sweat or unsightly shine highlights from the skin\n*Adjust the lighting on the face to make it more flattering\n*Remove red eye\n*Whiten teeth and eyes\n\nHow does the automatic touch-up work?\nPortrait Professional has been shown hundreds of photographs of beautiful human faces, and using sophisticated statistical techniques, it has learnt how to subtly airbrush and touch-up photographs to make them more beautiful.\n\nAll you have to do is choose how much to enhance the lighting, the skin texture and even how many wrinkles to remove. You can even subtly re-sculpt the face to make your subject look as good as possible by just moving a few sliders.\n\nPortrait Professional touches up and enhances people in the same way that good lighting and perfect makeup is used to make someone look more attractive. The software really can make anyone look as good as a celebrity in a magazine.\nMax option\nFor users that prefer to do their photo enhancement directly with RAW files and 16 bits per color TIFF files we offer the Max option.\nThe Max option enables Portrait Professional to work directly with 16 bits per color tiffs and RAW files straight from the camera.\nThe Max option means you can maintain the highest possible quality image editing throughout the production process without having to resort to any other program.\n","torrent":{"xt":"urn:btih:8457bc0fb9a8668c7f9a28e58f8fde482d59b9e9","amp;dn":"Portrait+Professional+Max+6.3.5Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8457bc0fb9a8668c7f9a28e58f8fde482d59b9e9","infoHashBuffer":{"type":"Buffer","data":[132,87,188,15,185,168,102,140,127,154,40,229,143,143,222,72,45,89,185,233]},"announce":[],"urlList":[]}}