{"title":"[FTL3] DRAGON AGE ORIGINS 1.02 PATCH + CRACK WORKING","uid":5204883,"size":4811974,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:846bdd5734f90aec3ee56d50cdd3c6ea17c15a55&amp;dn=%5BFTL3%5D+DRAGON+AGE+ORIGINS+1.02+PATCH+%2B+CRACK+WORKING&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"FTL3","files":1,"time":1260327860,"description":"Instructions within.\n\nWith web seed for super fast seeding!\n\n\nFor more NODVDs, Cracks, Mini-images for the latest games out there, visit    &lt;a href=&quot;\nhttp://thepiratebay.se/user/FTL3&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/FTL3&lt;/a&gt;\n\n\nNote: All files are scanned with virustotal and verified clean. As long as virustotal shows less than 10/41 suspected means its clean (of a false positive i.e. clean!).\n\nClean:\nhttp://www.virustotal.com/analisis/1abcc3f1477a6f2144fec31c1ab9a588c63bf1bfa543e0746c7ad3fb06a2d4b6-1260357204\n\n------------------------------------------------------------------------\n\nBalance\n\n    * Daggers now apply 0.5 points of damage per additional point in dexterity and 0.5 points of damage per additional point in strength, as originally intended. This increases dagger damage for high-dexterity characters.\n    * During combat, mana or stamina reserves now correctly regenerate more quickly when reserves are low. This allows players to occasionally use an talent or spell in the later stages of lengthy fights.\n    * When exploring, mana and stamina now regenerate more quickly at higher character levels. This reduces downtime between fights.\n    * The spells Force Field, Crushing Prison, Cone of Cold, and Blizzard now have shorter durations and/or longer cooldowns. This ensures that combatants can no longer stun-lock each other by repeatedly casting the same spell.\n    * The cooldowns for several low-level sustained abilities are now shorter. This ensures that players are not penalized for accidentally deactivating them.\n    * Certain battles were not scaling properly, resulting in excessively difficult fights. They now scale as intended.\n    * Enemy corpses now drop health poultices and money more appropriately, resulting in less clutter in the player's inventory. \n\nGameplay\n\n    * In rare cases, enemy corpses were selectable when they contained no loot. This no longer occurs.\n    * Party members whose combat tactics were set to defensive behavior no longer stop attacking after using a spell or talent.\n    * In rare cases, combat tactics conditions could fail to determine whether a character had enough mana or stamina to use an ability. This no longer occurs.\n    * The Rally talent no longer repeats its audio effect if it is active during certain conversations.\n    * The Rally talent no longer deactivates upon area transitions or conversations.\n    * The Shimmering Shield spell now deactivates when the character is out of mana. \n\nPlot *Spoiler Warning*\n\n    * Promotional downloadable content items now remain in the player's inventory when standard items are removed at the end of the dwarf noble origin.\n    * Repeatedly talking to Duncan after gathering the vials in the Korcari Wilds but not the treaties no longer provides duplicate experience.\n    * Leliana's personal plot can now be completed if the player substantially increased her approval (through gifts) before talking to her.\n    * During the siege of Redcliffe, enemies are no longer able to spawn in locations that would break the plot.\n    * Bann Teagan no longer disappears when he is supposed to be accessible during Urn of Sacred Ashes. \n\nPC Specific\n\n    * Controlling a summoned creature (like a ranger's pets) during certain special area transitions no longer results in odd behavior.\n    * Creating a character in a custom module did not create a folder for saves. This could result in corruption of main campaign saves. This no longer occurs.\n    * In some cases, the class icon was set incorrectly for characters imported from the downloadable Character Creator. This no longer occurs.\n    * The options menu now includes a setting to automatically download previously purchased content that is not currently installed.\n    * After installing new downloadable content, the game now always reminds the user to restart the game.\n    * The icons for some promotional downloadable content items were missing. They now appear correctly.\n    * The screenshot upload GUI would stop working from time to time on the client. There was a memory override that was fixed. It is a client fix. It doesn't affect the other problems we have seen on the server.","torrent":{"xt":"urn:btih:846bdd5734f90aec3ee56d50cdd3c6ea17c15a55","amp;dn":"%5BFTL3%5D+DRAGON+AGE+ORIGINS+1.02+PATCH+%2B+CRACK+WORKING","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"846bdd5734f90aec3ee56d50cdd3c6ea17c15a55","infoHashBuffer":{"type":"Buffer","data":[132,107,221,87,52,249,10,236,62,229,109,80,205,211,198,234,23,193,90,85]},"announce":[],"urlList":[]}}