{"title":"Strawfoot - Chasing Locust (2007)","uid":7900562,"size":74795462,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:84755c97251beeaca468f35bd9038d85d8d3ce79&amp;dn=Strawfoot+-+Chasing+Locust+%282007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mr_Kurtz","files":-1,"time":1354959347,"description":"Strawfoot - Chasing Locust (2007) mp3\n\n\nDirge-Country pioneers Strawfoot brings a dark sound of candy coated salvation and hellfire damnation to the stage, weaving a dark tapestry of haunting, cautionary tales. Songs of outlaw scarecrows, wayward preachers, falling pianos, and the devil paint a dark and menacing landscape, creating an original sound steeped in the rich, dark history of America and beyond. A seven-piece band consisting of violin, banjo, harmonica, upright bass, guitar, percussion and mandolin, the Strawfoot congregation has quickly become a fan favorite wherever they take the stage, gaining fans across America and abroad.\n\nDuring the Civil War, many soldiers didnt know their left from their right. To teach them to march, hay was tied to their left foot, straw to their right. Rather than calling out Left, Right, Left, Soldiers marched to the cadence of Hayfoot, Strawfoot. Its about marching forward.\n\nBubbling under the surface, there is a musical revolution. Creeping through the shadows, a collection of musicians and artists are gaining attention from the public eye as they push through the prefab world of pop, finding their way into the light. They look to the past with reverence, all the while pushing forward towards the future. As vast as the Mississippi, this revolution encompasses a melting pot of styles and influences.\n\nSome call it Alternative Country, others call it Gothic Americana. Many have tried to categorize the sound, but the influences are far too expansive. This dark folk music takes listeners on a journey through time and circumstance with violins, banjos, harmonicas, accordions and mandolins mixing with electric guitars, powerful drumming and upright bass to create a dynamic, raw sound. Like a medicine show without the snake oil, the shows are filled with an incomparable energy.\n\nStrawfoot has created their own genre and accomplish this rare feat with blues guitar riffs, the country pluck of the banjo, fiddlin and harp blowin. The lyrics and vocals oscillate between humorous rants and painfully poetic pleas. These cats have always been a favorite in the Lou.. Come one come all to the congregation!","torrent":{"xt":"urn:btih:84755c97251beeaca468f35bd9038d85d8d3ce79","amp;dn":"Strawfoot+-+Chasing+Locust+%282007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84755c97251beeaca468f35bd9038d85d8d3ce79","infoHashBuffer":{"type":"Buffer","data":[132,117,92,151,37,27,238,172,164,104,243,91,217,3,141,133,216,211,206,121]},"announce":[],"urlList":[]}}