{"title":"The.Fruit.of.Grisaia.S01E01.720p.WEBRip.x264-ANiHLS","uid":11187088,"size":337970116,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:850ad5452bc1602bbaf6a9aff7e3e3b5825f9399&amp;dn=The.Fruit.of.Grisaia.S01E01.720p.WEBRip.x264-ANiHLS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xKTRx","files":-1,"time":1412940487,"description":"The.Fruit.of.Grisaia.S01E01.720p.WEBRip.x264-ANiHLS\n\n\n\nMihama Academy - on the surface, a closed learning environment established to nurture students who find themselves at odds with the world around them; in actuality, a prison built to preserve fruit that has fallen too far from its tree.\n\nWhatever the circumstances behind its establishment, Mihama Academy is at present home to five female students, all with their own reasons for &quot;enrollment&quot;. For better or worse, each girl has established a routine obliging of her current situation; life moves at an idle, yet accommodating pace within the walls of Mihama.\n\nYet with the arrival of the institute's first male student, the nearly preposterously opaque Kazami Yuuji, the students at Mihama begin to fall out of step with their predetermined rhythms. Will Yuuji prove to be the element the girls around him needed to take hold of their lives once more, or will the weight of their pasts prove too steep a wall to overcome?\n\nAnd in the first place, just who is he? While the true nature of the &quot;job&quot; he is wont to alight to at the most haphazard of moments remains shrouded in secrecy, one thing is for certain: his encroachment upon the quiet orchard known as Mihama Academy will prove itself momentous in one way or another. And of course, one cannot discount the possibility that perhaps Yuuji himself carries the weightiest past of any of the students...","torrent":{"xt":"urn:btih:850ad5452bc1602bbaf6a9aff7e3e3b5825f9399","amp;dn":"The.Fruit.of.Grisaia.S01E01.720p.WEBRip.x264-ANiHLS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"850ad5452bc1602bbaf6a9aff7e3e3b5825f9399","infoHashBuffer":{"type":"Buffer","data":[133,10,213,69,43,193,96,43,186,246,169,175,247,227,227,181,130,95,147,153]},"announce":[],"urlList":[]}}