{"title":"Radio - An Illustrated Guide","uid":8653459,"size":66213230,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:8534108077e79434d5ee25f45ba60ee9bb138de8&amp;dn=Radio+-+An+Illustrated+Guide&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1373158466,"description":"'Radio - An Illustrated Guide'\n\nWBEZ Alliance, 1999, 36 pages\n\nWritten and Illustrated by Jessica Abel and Ira Glass\n\nRadio: An Illustrated Guide is a comic book that explains how to make a radio program. Specifically, it explains how to make the public radio program This American Life. In comic book form, the producers of This American Life explain how to find a story, how to do an interview, how to edit sound, how to write for radio and how to mix a radio story. It also explains how the narrative structure of a radio story works, and how it's different from other kinds of stories. This American Life is the most popular documentary program on American radio, with a weekly audience of over a million listeners, on more than 380 public radio stations nationwide. It's produced at WBEZ Chicago and distributed by Public Radio International.\n\nIra Glass\nIra Glass is the host and producer of &quot;The American Life.&quot; The program is heard by over a million people on over 380 public radio stations every week. Glass began working in public radio at the age of 19, in 1978, as an intern at National Public Radio's network headquarters in Washington. After that, he worked for NPR as a tape cutter, production assistant, associate producer, editor, newswriter, reporter and host. He won numerous awards as a producer and reporter. He began producing &quot;This American Life&quot; as a weekly program in 1995 at WBEZ Chicago. The show isthe only program in the history of broadcasting to win serious journalistic honors - the Peabody and Dupont awards - and also be invited to perform at HBO's Aspen Comedy Festival.\n\nJessica Abel\nJessica Abel started making comics in college, at the University of Chicago. Her early efforts appeared in the student anthology Breakdown. After college, in 1992, she won the infamous &quot;Stinky Date&quot; contest in Hate comics, and, since she had arranged to meet Hate's creator Peter Bagge at the Chicago Comics Convention, she decided to put together a sampler of her comics to show him and the rest of the crew from Fantagraphics Books, his publisher. She printed 50 copies of Artbabe number 1, but Fantagraphics publisher Gary Groth, who claims not to remember this encounter, didn't take the bait. Four issues (and four years) later, she won a Xeric grant, put out the first full-sized and professionally printed issue of Artbabe, thus finally appearing on Groth's radar, and beginning a new volume of Artbabe with Fantagraphics in 1997. Abel won the 1997 &quot;Best New Talent&quot; Harvey and Lulu awards and she completed Artbabe Volume 2 in early 1999.\n\nAbel currently lives in Mexico City with boyfriend Matt Madden, where she has been working on her Spanish and making a few minicomics. ","torrent":{"xt":"urn:btih:8534108077e79434d5ee25f45ba60ee9bb138de8","amp;dn":"Radio+-+An+Illustrated+Guide","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8534108077e79434d5ee25f45ba60ee9bb138de8","infoHashBuffer":{"type":"Buffer","data":[133,52,16,128,119,231,148,52,213,238,37,244,91,166,14,233,187,19,141,232]},"announce":[],"urlList":[]}}