{"title":"Christina Milian - Dip It Low","uid":4671887,"size":125753348,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:8551c125d572e7a1d2dbd3a4c0bfba1eba3d44e2&amp;dn=Christina+Milian+-+Dip+It+Low&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"2nafish","files":-1,"time":1232763767,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Dip It Low&quot; is a song by American singer Christina Milian. It was written by Paul Poli and Teedra Moses and produced by Poli for Milian's second studio album, It's About Time (2004), serving as its lead single. While its original version of the song features American rapper Fabolous, various versions of the song has been recorded for foreign markets, featuring French singer Lynnsha, German rapper Samy Deluxe, and Russian rapper Detsl.\n\nThe single is Milian's most successful to date, reaching number five on the U.S. Billboard Hot 100 chart as well as the top five in the United Kingdom and the top ten in the Netherlands, Denmark, Norway, and New Zealand. Milian also performed and promoted the song for a Tommy Hilfiger Jeans commercial. The song was nominated for the Grammy Award for Best Rap/Sung Collaboration in 2005, and was certified gold by the RIAA in early January 2005.\n\nThe music video for &quot;Dip It Low&quot; was directed by Matthew Rolston. Milian is first seen sitting in a small, Asian-decorated area, being very scantily-clad. She is solely wearing a bra and underwear with a robe and high heels. She dances and sings, and clips of her dressed in a sparkling green costume cut in throughout the video. She is seen in a revealing red dress, walking forward on a stage with two dancers and then begins to dance. One of the male dancers then pulls back the front of the dress, revealing a black dress underneath. Throughout the rest of the video she is shown being pulled through black paint in the black dress and continues to dance. The verse that features Fabolous' is completely cut out in the video, and instead a dance sequence is shown.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:8551c125d572e7a1d2dbd3a4c0bfba1eba3d44e2","amp;dn":"Christina+Milian+-+Dip+It+Low","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8551c125d572e7a1d2dbd3a4c0bfba1eba3d44e2","infoHashBuffer":{"type":"Buffer","data":[133,81,193,37,213,114,231,161,210,219,211,164,192,191,186,30,186,61,68,226]},"announce":[],"urlList":[]}}