{"title":"Complete Billie Holiday &amp; The Ellingtonians 1935-37 @320","uid":5486738,"size":182264028,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:857752e5671e242bee9178449f150a65e81cf798&amp;dn=Complete+Billie+Holiday+%26+The+Ellingtonians+1935-37+%40320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"artpepper","files":-1,"time":1270759447,"description":"The Complete Billie Holiday w/The Ellingtonians 1935-37\n\nMp3 320 kbps 44 kHz\n\n\nEach of Duke Ellington's musicians was himself a star and, whenever the occasions arose to play with complete freedom, that is to say, away from Duke's strict rules and regulations, wonderful and amazing things ocurred. \n\nThe most surprising was that, when the very same musicians (who were responsible for the unique Ellington sound) met together, away from their normal ducal environment, the result was a music totally unrelated to it and a new indefinable unified style (a sort of cohesiveness) emerged. \n\nEach personality interlaced and fitted together without any prevaling or interfering attempt so that the most stimulating jazz always and irrepressibly sprang forth. \n\nThen, if besides all that, a temperament such as that of Teddy Wilson's joined them, that cohesiveness touched new heights bringing into life on every ocassion, unforgettable artistic events so ecclectic (though so orthodox) was his perfect harmonic support.\n\n Consequently, we didn't miss the opportunity to put together a few of those events, the bonus being Miss Billie Holiday. Billie, in those days, had reached the summit of her expressive powers, and her fusion with the Ellingtonians simply gave even more prominence to the events we have just referred to. \n\nEverything in this compilation emphasizes a universal feeling of timelessness in which sadness, hapiness and all the perceptible shades and nuances of the human condition are there to be seen and felt as a kind of accusatory lesson which everyone, everywhere should experience absolutely. All musicians were speaking, although with their own individual accents a common language which unquestionably was that of Louis Armstrong. \n\nThis is why we deflected from the chronology to insert &quot;Sun Showers&quot; and &quot;Yours And Mine&quot; by Louis himself (just after Billie's version) which supports this statement. - From liner notes by Alesandro Protti &amp; Roberto Capasso\n\n@artpepper says: a Stunning collection by a supremely gifted singer at the height of her powers, backed by musicians at the heights of theirs. An essential addition to any collection.\n\n\n\n01 Big City Blues (D. Ellington) 2:26\n02 These 'n' That 'n' Those (Fairchild, Pascal) 3:14\n03 You Let Me Down (Dubin, Warren) 2:54\n04 Spreadin' Rythm Around (Koehler, McHugh) 2:56\n05 It's Like Reaching For The Moon (Lewis, Marqusee, Sherman) 3:22\n06 These Foolish Things (Marvell, Strachey, Walker) 3:19\n07 I Cried For You (Arnheim, Freed, Lyman) 3:13\n08 Guess Who? (Freed, Lane) 3:11\n09 Easy To Love (Porter) 3:13\n10 With Thee I Swing (Adlam, Hyde, Stillman) 3:18\n11 The Way You Look Tonight (Fields, Kern) 3:02\n12 Who Loves You? Coots, Davis) 3:16\n13 Pennies From Heaven (Burke, Johnson) 3:17\n14 That's Life I Guess (DeRose, Lewis) 3:10\n15 I Can't Give You Anything But Love (Fields, McHugh) 3:28\n16 Carelessly (Ellis, Kenny, Kenny) 3:08\n17 How Could You? (Dubin, Warren) 2:31\n18 Moanin' Low (Deitz, Rainger) 3:02\n19 Sun Showers (Brown, Freed) 3:08\n20 Sun Showers (Brown, Freed) 2:40\n21 Yours And Mine (Brown, Freed) 3:17\n22 Yours And Mine (Brown, Freed) 2:40\n23 I'll Get By (Ahlert, Turk) 3:09\n24 Mean To Me (Ahlert, Turk) 3:08\n\n\n\ntrack 1 (Recorded in Long Island, on March 12, 1935):\n\nA.Whetsol, F.Jenkins, C.Williams (tp); J.Nanton, L.Brown, J.Tizol (tb); M.Royal (cl)(as); B.Bigard (cl)(ts); J.Hodges (as); H.Carney (bs); D.Ellington (p); F.Guy (bj); W.Braud (b); S.Greer (d); Billie Holiday (v).\n\ntracks 2-4 (Recorded in New York, on December 3, 1935):\n\nRichard `Dick` Clarke (tp); Tom Macey (cl); Teddy McRea (ts); Teddy Wilson (p); John Truehart (g); Grachan Moncur (b); Cozy Cole (d); Billie Holiday (v)\n\ntracks 5-8 (Recorded in New York, on June 30, 1936):\n\nJonah Jones (tp); Johnny Hodges (as); Harry Carney (bs); Teddy Wilson (p); Lawrence Lucie (g); John Kirby (b); Cozy Cole (d); Billie Holiday (v)\n\ntracks 9-11 (Recorded in New York, on October 21, 1936):\n\nIrving `Mouse` Randolph (tp); Vido Musso (cl); Ben Webster (ts); Teddy Wilson (p); Allan Reuss (g); Milt Hinton (b); Gene Krupa (d); Billie Holiday (v)\n\ntrack 12 (Recorded in New York, on October 28, 1936):\n\nIrving `Mouse` Randolph (tp); Vido Musso (cl); Ben Webster (ts); Teddy Wilson (p); Allan Reuss (g); Milt Hinton (b); Gene Krupa (d); Billie Holiday (v)\n\ntracks 13-15 (Recorded in New York, on November 19, 1936):\n\nJonah Jones (tp); Benny Goodman (cl); Ben Webster (ts); Teddy Wilson (p); Allan Reuss (g); John Kirby (b); Cozy Cole (d); Billie Holiday (v)\n\ntracks 16-18 (Recorded in New York, on March 31, 1937):\n\nCootie Williams (tp); Johnny Hodges (as); Harry Carney (cl)(bs); Teddy Wilson (p); Alan Reuss (g); John Kirby (b); Cozy Cole (d); Billie Holiday (v)\n\ntracks 19, 21, 23, 24 (Recorded in New York, on May 11, 1937):\n\nBuck Clayton (tp); Buster Bailey (cl); Johnny Hodges (as); Lester Young (ts); Teddy Wilson (p); Alan Reuss (g); Artie Bernstein (b); Cozy Cole (d); Billie Holiday (v)\n\ntracks 20, 22 (Recorded in New York, on July 2, 1937):\n\nLouis Armstrong (tp, v); Shelton Hemphil, Louis Bacon, Henry Allen (tp); George Matthews, George Washington, J.C. Higginbotham (tb); Pete Clark, Charlie Holmes (as); Albert Nicholas, Bingle Madison, (cl, ts); Luis Russell (p); Pops Foster (b); Paul Barbarin (d)","torrent":{"xt":"urn:btih:857752e5671e242bee9178449f150a65e81cf798","amp;dn":"Complete+Billie+Holiday+%26+The+Ellingtonians+1935-37+%40320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"857752e5671e242bee9178449f150a65e81cf798","infoHashBuffer":{"type":"Buffer","data":[133,119,82,229,103,30,36,43,238,145,120,68,159,21,10,101,232,28,247,152]},"announce":[],"urlList":[]}}