{"title":"JulesJordan - Abella Danger (Abella Danger Is Due For Cavity Fil","uid":15735693,"size":293791840,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:858c57937c2c88dd5d47f888c7d463e41b8afeca&amp;dn=JulesJordan+-+Abella+Danger+%28Abella+Danger+Is+Due+For+Cavity+Fil&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"xxxlavalxxx","files":2,"time":1472836860,"description":"Abella Danger shows up to Jules' place and has a backpack with a change of clothes. Of course, that little backpack is tiny and the strings she changes into are not keeping any of her hot body a secret. Perky titties, tan skin, a bubble booty that she is known for are all on display and her devilish smile shows she is up to no good. Up against the wall, Chris Strokes shows up and doesn't need permission to start fucking the horny Abella. She's ready to go and one cock just won't do for today. Abella Danger is one of the horniest girls to ever grace the focus of Jules' lens and she's in for a deep double penetration today. This cock-hungry slut cannot get enough and her flexible little body helps a lot when it comes to getting her pussy and asshole fucked at the same time. Smiling and enjoying herself the whole time, Jules and Chris get their big cocks sloppy wet with the most intense deep-throating and hole-fucking she's got. The DP Masters do not fuck around and they wreck Abella's juicy holes before giving her all the heaping loads she wants!\tAbella Danger, Chris Strokes, Jules Jordan\r\nCategories: 3 Way, Anal, Ass To Mouth, Big Butts, Big Cocks, Brunettes, Double Penetration, Facial, Natural\r\n \nhttp://imgdone.com/viewer.php?file=43109791140441484561.jpg\r\n \nhttp://imgdone.com/viewer.php?file=72870695893559544750.jpg","torrent":{"xt":"urn:btih:858c57937c2c88dd5d47f888c7d463e41b8afeca","amp;dn":"JulesJordan+-+Abella+Danger+%28Abella+Danger+Is+Due+For+Cavity+Fil","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"858c57937c2c88dd5d47f888c7d463e41b8afeca","infoHashBuffer":{"type":"Buffer","data":[133,140,87,147,124,44,136,221,93,71,248,136,199,212,99,228,27,138,254,202]},"announce":[],"urlList":[]}}