{"title":"Environmentally Sustainable Catalytic Asymmetric Oxidations","uid":15253653,"size":6130999,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8636b1a38e5ad30bb323476fb35709454c4f457e&amp;dn=Environmentally+Sustainable+Catalytic+Asymmetric+Oxidations&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1468087971,"description":"Environmentally Sustainable Catalytic Asymmetric Oxidations - Konstantin Bryliakov (CRC, 2015).pdf\r\n\r\nISBN 978-1-4665-8859-2\r\n\r\nCatalysis plays a vital role in chemical, petroleum, agriculture, polymer, electronics, pharmaceutical, and other industries. Over 90 percent of chemicals originate from catalytic processes. Toughening economic and environmental constraints have proven to be a challenge for meeting the demand of novel efficient and sustainable regio- and stereoselective catalyst systems. Environmentally Sustainable Catalytic Asymmetric Oxidations provides a comprehensive overview of existing ecologically friendly catalyst systems for various asymmetric oxidation processes.\r\n\r\nTopics include:\r\n\r\nA survey of existing transition metal-based catalyst systems for asymmetric epoxidations (AEs) with O2 and H2O2\r\n\r\nAsymmetric sulfoxidations with H2O2 on chiral metal complexes\r\n\r\nAn overview of various transition metal-catalyzed oxidative transformations with H2O2 or O2 used as the terminal oxidant\r\n\r\nOrganocatalytic asymmetric oxidations\r\n\r\nCatalytic processes of stereospecific oxidations of C-H functional groups\r\n\r\nThe role that oxoiron(V) intermediates play in chemo- and stereoselective oxidations catalyzed by non-heme iron complexes\r\n\r\nThe book concludes with a discussion of the opportunities and problems associated with the industrial application of stereoselective processes of catalytic oxidation with H2O2 and O2. It also provides examples of processes with industrial potential.\r\n\r\nSome of the catalysts presented in this book may serve as promising alternatives for existing catalysts—progressively replacing them in manufacturing processes and ultimately making the chemical industry greener and cleaner","torrent":{"xt":"urn:btih:8636b1a38e5ad30bb323476fb35709454c4f457e","amp;dn":"Environmentally+Sustainable+Catalytic+Asymmetric+Oxidations","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8636b1a38e5ad30bb323476fb35709454c4f457e","infoHashBuffer":{"type":"Buffer","data":[134,54,177,163,142,90,211,11,179,35,71,111,179,87,9,69,76,79,69,126]},"announce":[],"urlList":[]}}