{"title":"Terror on the Titanic-Choose Your Own Adventure 24.pdf","uid":11543700,"size":6772236,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:874742537ad1c9df055e9e0f74d2b6f237ba401c&amp;dn=Terror+on+the+Titanic-Choose+Your+Own+Adventure+24.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1416698577,"description":"APRIL 10, 1912. YOU ARE ABOUT TO EMBARK ON THE FIRST VOYAGE OF HE RMS TITANIC.\n\nYou are your friend Jessica have been exploring the world-class ocean liner for a few thrilling days.  You've noticed that the crew is just as excited as you are to be aboard the most luxurious ship in the world.  A little too excited, you think - sometimes it seems you and Jessica already know more about the ship's workings than they do!  One night, you borrow a pair of binoculars and look out to sea.\n\nYou strain to see.  It's massive, filling the view of your binoculars, but fixed, so it can't be another sea craft.  It glows eerily against the dark sea.  The starlight bounces off its reflective edges so that it looks as lit-up as a small city in the distance... but, it's an iceberg!\n\nYou've learned so much about this great ship already.  Now, you're about to make history when you either avert a great tragedy or fend for your life in the deadly, freezing cold waters of the Atlantic Ocean!\n\nThis book is a &quot;new style&quot; CYOA, after deciding to re-publish some of the old school CYOA books, all with new numbers.  #24 used to be &quot;Lost in the Amazon&quot;.\n\nFirst published in 1996, this edition was published in 2006\n\nEnjoy!","torrent":{"xt":"urn:btih:874742537ad1c9df055e9e0f74d2b6f237ba401c","amp;dn":"Terror+on+the+Titanic-Choose+Your+Own+Adventure+24.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"874742537ad1c9df055e9e0f74d2b6f237ba401c","infoHashBuffer":{"type":"Buffer","data":[135,71,66,83,122,209,201,223,5,94,158,15,116,210,182,242,55,186,64,28]},"announce":[],"urlList":[]}}