{"title":"Ain't Times Hard (4CD-JSP)","uid":7341460,"size":801077261,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:88b76671b98953392c6152f0c60bfbf540bcd327&amp;dn=Ain%27t+Times+Hard+%284CD-JSP%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"mudmashers","files":124,"time":1339252708,"description":"Ain't Times Hard: Political and Social Comment in the Blues [JSP] (4CD320kb)\n\n\n\nGiven the fact that life is just plain hard sometimes, maybe even most of the time, it would seem that any era one picks could lay claim to being the worst, the hardest, the most difficult, and yet, somehow, people get through things, undoubtedly to run into hard times again somewhere soon down the road. That's life, as they say, and the blues has always been perfectly suited to convey just how hard life can be. \n\nThis collection of 100 vintage blues songs -- stretching in chronological order from the mid-'20s through the mid-'50s and spread over four CDs -- confirms that hard times are always with us. The tracks compiled here by Neil Slaven aren't of the woke-up-this-morning-and-my-baby-was-gone variety but drift into the wider social and political world of economic woes and desperate measures, and while the blues is, at least on the surface, about being down and out, what emerges here is a kind of dogged determination to break through into a brighter future, even if that future never seems to quite arrive. \n\nThere's resilience here in song after song, and this set is filled with classics like Charlie McCoy and Bo Carter's wonderfully loose &quot;Northern Starvers Are Returning Home,&quot; Charley Jordan's crisp &quot;Starvation Blues,&quot; the Mississippi Sheiks' wry &quot;Sales Tax,&quot; Big Joe Williams' &quot;Providence Help the Poor People,&quot; Roosevelt Sykes' wise &quot;Living in a Different World,&quot; and J.B. Lenoir's poignant &quot;Eisenhower Blues,&quot; among many more, and while things are desperate, almost hopeless and unbelievably tense in song after song, again that determination to rise above hard times is always tangibly present, making this fine set, in the end, more about surviving than drowning. \n\nYep. Times are hard today. Times will probably be hard tomorrow, and probably the day after that. But the blues, for all its moaning about such things, has really always been about getting through them. That fact makes this collection oddly and even powerfully uplifting. Review by Steve Leggett (Allmusic)","torrent":{"xt":"urn:btih:88b76671b98953392c6152f0c60bfbf540bcd327","amp;dn":"Ain%27t+Times+Hard+%284CD-JSP%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88b76671b98953392c6152f0c60bfbf540bcd327","infoHashBuffer":{"type":"Buffer","data":[136,183,102,113,185,137,83,57,44,97,82,240,198,11,251,245,64,188,211,39]},"announce":[],"urlList":[]}}