{"title":"Batman - Black and White","uid":5298321,"size":190176487,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:89ae2eeadf0ddbcf1876b645ed240a344e5b467b&amp;dn=Batman+-+Black+and+White&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"brodahisou","files":-1,"time":1264133686,"description":"Batman: Black and White was originally a four-issue comic book anthology limited series published in 1996 by DC Comics, and then a series of 8-page black and white Batman backup features in Batman: Gotham Knights comic #1-49.  The Batman: Gotham Knights stories were collected into two volumes.  Batman: Black and White Volume 2 collects Batman: Gotham Knights #1-16 and Batman: Black and White Volume 3 collects Batman: Gotham Knights #17-49.\n\nThe origin of the series is told by editor Mark Chiarello in his introduction to the collection of the four-issue limited series, in which he writes about a dinner table-discussion with &quot;a few famous comic-book artists,&quot; at which they pondered the &quot;desert island&quot; question in terms of a single complete run of comics one would be happy to be stranded with.  Ultimately, with &quot;half a minute&quot;'s thought, they &quot;amazingly... all agreed, pound for pound, page for page&quot; that the unequivocal choice was Warren Publishing's Creepy, a high point unmatched since &quot;there has never been such a collection of stellar artists assembled under one banner publication&quot; as in Creepy, whose pages were host to (among others) &quot;Toth, Frazetta, Williamson, Torres, Colan, Ditko, Wrightson, Corben[, etc.].&quot;\n\nWhen Chiarello became a Batman editor &quot;a whole bunch of years&quot; later, he naturally &quot;pitch[ed] the idea of a black and white anthology.&quot;  The series ultimately became &quot;a creative and financial success,&quot; when the first four-issue volume was published between June and September, 1996.  Each of the four issues featured several self-contained short-stories, all written and drawn by a diverse group of comic artists and writers, most of whom had previously worked on Batman comics. Each story varied in theme, setting, and tone (depending on the creative team involved), offering multiple interpretations of Batman - and, in some cases, his supporting characters - usually by exploring their inner pathos and relationships.\n\nAs the title implies, all the artwork is rendered without color, in black and white. Due to the lack of cohesion between stories, and the artistic licence taken in how the various characters are portrayed, it can reasonably be assumed that most - if not all - of the stories are not meant to tie into the mainstream continuity of the Batman comics, instead functioning as stand-alone one-shots, pseudo-Elseworlds, parodies and other forms of alternate universe.\n\n&quot;The Gasworks&quot;, originally published in Gotham Knights #36, is the only &quot;Black &amp; White&quot; story to include color - red permeates the story, the color of both the hallucinogen and the blood.  This is likely the reason this story was moved to the end of the volume 3.\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:89ae2eeadf0ddbcf1876b645ed240a344e5b467b","amp;dn":"Batman+-+Black+and+White","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89ae2eeadf0ddbcf1876b645ed240a344e5b467b","infoHashBuffer":{"type":"Buffer","data":[137,174,46,234,223,13,219,207,24,118,182,69,237,36,10,52,78,91,70,123]},"announce":[],"urlList":[]}}