{"title":"The Experiment - Rubber Band Powered Gun","uid":8843923,"size":16503323,"categoryP":"other","categoryS":"physibles","magnet":"?xt=urn:btih:8ac77b908ac97af8c3c79a16daf2a50cde5bf946&amp;dn=The+Experiment+-+Rubber+Band+Powered+Gun&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Roll4Troll","files":38,"time":1377324008,"description":"This is my first original design of anything so just try it and see if it works. I would appreciate your feedback\n\nYou will need to print 5 standard pins and 1 of everything else. You will also need a few rubber bands for pulling the hammer slider and a nail of the appropriate size (just use the one you may have used for the Liberator).\n\nAssemble it, put an appropriate nail in the hammer body, then put in the Firing Pin Bushing in behind it and stretch a couple rubber bands from the hooks at the front of the frame to the long hammer slider pins.\n\nInsert a .380 cartridge into the barrel. The locking mechanism works by you inserting the pins into the holes and twisting counterclockwise. Once done it should be secure.\n\nTo cock it, pull the hammer slide back and down. Then pull the trigger (from a distance) to fire.\n\nI have designed this to the best of my ability, but do not hold me responsible for anything that this is used for or is the result of.\n\nI have not actually printed these parts, but they should work. You can try different thing so make them work (eg. sanding of a small amount of the pins) If you have any problems constructing it, just have a look at the assembled model.\n\nBest of luck!","torrent":{"xt":"urn:btih:8ac77b908ac97af8c3c79a16daf2a50cde5bf946","amp;dn":"The+Experiment+-+Rubber+Band+Powered+Gun","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ac77b908ac97af8c3c79a16daf2a50cde5bf946","infoHashBuffer":{"type":"Buffer","data":[138,199,123,144,138,201,122,248,195,199,154,22,218,242,165,12,222,91,249,70]},"announce":[],"urlList":[]}}