{"title":"Faster Than Light: Advanced Edition (GOG)","uid":12129939,"size":245714168,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8ad9e7515a62dbc1357c4517fb6f9561b00af095&amp;dn=Faster+Than+Light%3A+Advanced+Edition+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mercs215","files":6,"time":1437011285,"description":"Install instructions:\n1. Run &quot;setup_ftl_advanced_edition_2.3.0.13&quot;\n2. Play\nPLEASE REMEMBER TO SEED, MANY OTHERS WANT THIS GAME! :)\nIf you like this game, support the developers and BUY IT!\n\nTitle: FTL: ADVANCED EDITION\nGenre: Strategy - Simulation - Sci-fi\nWorks on: Windows (XP, Vista, 7, 8)\nLanguages: Audio and text: English\nModes: Single-player\nReleased: September 14, 2012\nSize: 205 MB\nCompany: Subset Games / Subset Games\nStore page: https://www.gog.com/game/faster_than_light\n\nAbout:\nFTL: Advanced Edition features:\n- New systems, playable ships, alien race, weapons, drones, and more!\n- A new sector with new events, written by Tom Jubert and special guest writer Chris Avellone!\n- New music by Ben Prunty!\nDid you ever want to reroute power to the shields, set phasers to stun, or even eject the warp core? Well, now you can! In FTL, you experience the atmosphere of running a spaceship trying to save the galaxy. It's a dangerous mission, with every encounter presenting a unique challenge with multiple solutions. What will you do if a heavy missile barrage shuts down your shields? Reroute all power to the engines in an attempt to escape, power up additional weapons to blow your enemy out of the sky, or take the fight to them with a boarding party? This &quot;spaceship simulation roguelike-like&quot; allows you to take your ship and crew on an adventure through a randomly generated galaxy filled with glory and bitter defeat.\nFTL's complex strategic gameplay allows you to give orders to your crew, manage ship power distribution, and choose weapon targets in the heat of battle. You will encounter unique alien lifeforms and technology. You can upgrade your ship and unlock new ones with the help of six diverse alien races. Be the Captain you want: hundreds of text based encounters will force you to make tough decisions. In the randomized galaxy each play-through will feature different enemies, events, and results to your decisions. Each time you play another challenging session of FTL:Faster Than Light, it won't be quite the same.\nUnlimited adventures in the vast depths of unpredictable space.\nA new randomized galaxy to explore each time you start a new game.\nQuick play sessions (from 5 to about 90 minutes) will allow you to add that spaceship commander feeling to any of your days.\n\nMinimum system requirements - Windows: Windows XP / Windows Vista / Windows 7, 2.0 GHz Processor, 1 GB RAM, 3D graphics card with 128MB RAM and OpenGL 2.0 support, 175MB HDD, Mouse, Keyboard. Compatibility notice: Faster Than Light requires a minimum resolution of 1280 x 720. Integrated Intel HD graphics cards have been known to work but are not officially supported","torrent":{"xt":"urn:btih:8ad9e7515a62dbc1357c4517fb6f9561b00af095","amp;dn":"Faster+Than+Light%3A+Advanced+Edition+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ad9e7515a62dbc1357c4517fb6f9561b00af095","infoHashBuffer":{"type":"Buffer","data":[138,217,231,81,90,98,219,193,53,124,69,23,251,111,149,97,176,10,240,149]},"announce":[],"urlList":[]}}