{"title":"Bus Driver - Full PreCracked - Foxy Games","uid":6814101,"size":87559041,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8bca045b95e60c6a06071209345f4a04db2192c7&amp;dn=Bus+Driver+-+Full+PreCracked+-+Foxy+Games&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"redfoxygames","files":-1,"time":1321132717,"description":"Bus Driver is all about driving buses.\n\nIn Bus Driver, your job is to transport passengers around an attractive and realistic city. You must drive to a timetable on a planned route, whilst obeying traffic rules, and taking care not to upset or injure your passengers. This makes Bus Driver unlike any other driving game - the experience of driving a bus is very different from blazing through a racing circuit.\n\n\nBus Driver offers 12 different kinds of buses to drive, an expansive city environment with various districts, and 30 routes with varying weather conditions set at differing times of day.\n\n12 buses to drive, very detailed models inspired by real-world buses.\n30 routes arranged into 5 tiers with increasing difficulty.\nMultiple duties, such as driving a schoolbus, transporting tourists, sight-seeing tours, and transportation of prisoners.\nHigh replay value based on sophisticated system of traffic rules and game-play related bonuses.\nVarying time-of-day and weather conditions\nLarge city to drive in, with several districts of varying styles (modern, old-town, suburb, airport, harbour, and more).\nLiving roads, with intelligent traffic controlled by our AI system.\nNon-violent gameplay, game about buses suitable for everybody.","torrent":{"xt":"urn:btih:8bca045b95e60c6a06071209345f4a04db2192c7","amp;dn":"Bus+Driver+-+Full+PreCracked+-+Foxy+Games","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8bca045b95e60c6a06071209345f4a04db2192c7","infoHashBuffer":{"type":"Buffer","data":[139,202,4,91,149,230,12,106,6,7,18,9,52,95,74,4,219,33,146,199]},"announce":[],"urlList":[]}}