{"title":"The Seafarers - The Spanish Main (History Sea Travel Ebook).pdf","uid":11116436,"size":45530352,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8cb1aa0e840608d740a653d3b321f4337f859c1c&amp;dn=The+Seafarers+-+The+Spanish+Main+%28History+Sea+Travel+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":-1,"time":1411858216,"description":"Pdf / English / 1979 Time Life The Seafarers Series / 176 pages / 43.4 MB\n\nEssay: The Ruthless conquest of a golden Aztec Empire\n1 The First Challenges to the lords of the Main\nEssay: Carrying the King's wealth to the coffers of Seville\n2 The merchant who enflamed Spain's New World \n3 The fire and fury of El Dragon\nEssay: The heretics who humbled the might of Spain\n4 The rise of a bloodthirsty brotherhood\n5 A sea-roving devil named henry Morgan\n6 The sacking of Cartagena: a last, bold stroke\nEssay: A new era of naval warfare on the embattled Main\n\nThis is an eminently readable account of European history on the Spanish Main, including the coast &amp; islands.\n\nLike other books in this venerable Time-Life Seafarer series, it really filled in some gaps in my knowledge &amp; understanding, illuminating the politics &amp; philosophies that created the conditions which allowed piracy to develop &amp; flourish.\n\nFor example, the buccaneers who became pirates are famous for their hunting &amp; trading in meat &amp; hides but--having seen how few wild animals exist on many Caribbean islands--I never fully understood where those animals were coming from [feral livestock from homesteads in the Spanish Caribbean abandoned in favor of treasure hunting on the mainland], or who the men were [a mixture of former indentured-servants, sailors, slaves &amp; settlers displaced by belated enforcement of Spanish land claims in the outlying islands].\n\nIt was also interesting to learn about efforts to eradicate the pirates through means ranging from political treaties forbidding letters of marque, to the more effective efforts of D'Ogeron, who filled a ship with Parisian prostitutes &amp; sold the ladies to the Tortuga buccaneers as wives, settling them right down.\n\nFelix, Amazon","torrent":{"xt":"urn:btih:8cb1aa0e840608d740a653d3b321f4337f859c1c","amp;dn":"The+Seafarers+-+The+Spanish+Main+%28History+Sea+Travel+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8cb1aa0e840608d740a653d3b321f4337f859c1c","infoHashBuffer":{"type":"Buffer","data":[140,177,170,14,132,6,8,215,64,166,83,211,179,33,244,51,127,133,156,28]},"announce":[],"urlList":[]}}