{"title":"Learning from Clusters A Critical Assessment from an Economic-Ge","uid":6528401,"size":9615281,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8dc3c81af98dffd837d151c8eb367f95a09a95a9&amp;dn=Learning+from+Clusters+A+Critical+Assessment+from+an+Economic-Ge&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_F1_","files":-1,"time":1310234928,"description":"Learning from Clusters: A Critical Assessment from an Economic-Geographical Perspective\n Springer; 1 edition | September 29, 2005 | ISBN-10: 140203671X | 433 pages | PDF | 9.88 MB\n\n The topic of clustering is a central one in contemporary debates on the relationship between the global and the local. This book addresses both conceptual and empirical issues on clustering, learning and regional development. It represents the current state of affairs in this body of literature in a critical way and gives a unique overview of the latest developments. The book reflects a kind of uneasiness scholars have with the general model of clusters that has been so dominant in the field of regional economics and economic geography in the past twenty years. All chapters in this book contribute to the debate, either at the conceptual level, the empirical level or both. At the conceptual level, the cluster model has been criticized because it has been represented as a model that has been idealized too much. Moreover, it has been developed mainly as a theoretical model, without having been accompanied by a great deal of empirical testing of its main propositions.","torrent":{"xt":"urn:btih:8dc3c81af98dffd837d151c8eb367f95a09a95a9","amp;dn":"Learning+from+Clusters+A+Critical+Assessment+from+an+Economic-Ge","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8dc3c81af98dffd837d151c8eb367f95a09a95a9","infoHashBuffer":{"type":"Buffer","data":[141,195,200,26,249,141,255,216,55,209,81,200,235,54,127,149,160,154,149,169]},"announce":[],"urlList":[]}}