{"title":"Magicka.Update.21.(1.3.6.1)-MrEagle","uid":6337169,"size":509185006,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:8e47d1f7a3431993f4fb735a8805e4bb6c17ef75&amp;dn=Magicka.Update.21.%281.3.6.1%29-MrEagle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eagle444","files":8,"time":1303514523,"description":"Changelog for 21 update (1.3.6.1):\n\nLeader boards\nMost of you know what state the leader boards are in today and we all know that it takes away from the fun having people who abuse the system, and a system that allows itself to be abused. We are are working on the security of the leader boards for a future update, but we wanted to ask the community what they think about a possible leader board wipe.\n\nSo please, speak up and say what you think about a possible wipe of the leader boards, together with greater security.\n\nDLC\nWe still have some DLC between here and the PvP patch and some of it is coming very soon. The two new challenge maps, Caverns and Marshlands, are some of the goodies we have in store. We asked the community witch one of them should be free, and the community voted for Caverns, so we are giving it to all of you for free! Marshlands will be a paid DLC for $1.99 and will be released on April 26th.\n\nIf you missed the voting, make sure to like Magickagame on Facebook so you don't miss future updates!\n\nNext patch\nWe are preparing to deploy a new patch soon(tm), it will contain a few small fixes and no major changes. As per usual we are still working on bug fixes and as long as you keep reporting them on our forums, we will continue to work on them. We would like to take this opportunity to once more thank our awesome community for helping us out with tracking down the bugs.\n\nPvP\nWe have done some balance changes for PvP in house and we quickly learned a lot about what needs to be balanced. Some things are still too good, like the ice projectiles together with arcane, and the ease to spam them. We are not sure what to do with them yet, if you have any suggestions regarding the ice shards or other PvP balance changes you would like to see, make sure to post it on our forums.\n\nThere is noting to RSE other than RSE itself.","torrent":{"xt":"urn:btih:8e47d1f7a3431993f4fb735a8805e4bb6c17ef75","amp;dn":"Magicka.Update.21.%281.3.6.1%29-MrEagle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e47d1f7a3431993f4fb735a8805e4bb6c17ef75","infoHashBuffer":{"type":"Buffer","data":[142,71,209,247,163,67,25,147,244,251,115,90,136,5,228,187,108,23,239,117]},"announce":[],"urlList":[]}}