{"title":"Airship Dragoon v1.5.2","uid":11274637,"size":173178129,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8f355fcdf192b2cb6a19060384bdc545eeda2240&amp;dn=Airship+Dragoon+v1.5.2++&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Nimbleton","files":-1,"time":1414123997,"description":"Airship Dragoon v1.5.2  \n\n\nAirship Dragoon has been updated to version 1.5.2.\n\nAs per customer requests, there are now a plethora of hotkeys allowing for the camera to be controlled via the keyboard, as well as opening the inventory, opening the map/radar screen, reloading, and scrolling back and forth through troop selection. Hotkeys can also be customized and rebound. See Options-&gt;Controls in-game.\n\nAidkits can now be used inside the inventory by selecting the arm/reload button. No more having to equip the aidkit, exit the inventory, heal the wounded, and then go back into the inventory screen to re-equip a weapon. \n\n\nAlso to be found in Options is the new Mod Selector. This allows easy access to the included Environment Total Conversion Realism_Mod without having to initialize anything outside of the game. Previous methods of using the Realism_Mod are now redundant, so if you have had it enabled for play, note that you will have to re-enable it via the new Mod Selector. As the Realism_Mod is a dedicated mod, enabling or disabling it requires the game to be exited for it to load/unload the mod for the next time you play. \n\nAdditional changes since version 1.5 are as follows:\n\nReduced height of low walls on buildings by 20cm/8&quot; so it's easier for crouching/cautious mode troopers to spot targets and shoot over. Walls were previously just cover/defensive for crouched troopers, now they offer more aggressive option whilst maintaining minimal exposure to incoming fire.\n\nVery close range Ai will now opt for headshots/weakpoints over body mass centre. Player must still manually aim for the position they want to strike when up close, automated player attacks (via target range buttons, small, blue, far right side of screen) still aim for centre of target if it is visible (more chance of hitting) and head when centre is not.\n\nRefractored passive fire opportunity to discount classes with unsuitable ranges early. No noticeable in-game change but cleaning up code is always nice.\n\nFixed a rare crash bug caused when a trooper is killed whilst firing a lightning gun.\n\nFixed &quot;laser&quot; beam from energy weapons extending beyond impact area. (purely aesthetic)\n\nTweaked how panicking troops go beserk and start shooting, should now be slightly less indiscriminately.\n\nRewrote the tag line on the Fairy Tale Achievement to make it clearer that it is only available in Single Battle Mode.\n\nAdded initial heat damage bonus to Atomic Death Ray when it causes a fire at a target's location.\n\nStopped artillery targeting recently deceased targets. (no noticeable effect in game)\n\nFor those playing with olde","torrent":{"xt":"urn:btih:8f355fcdf192b2cb6a19060384bdc545eeda2240","amp;dn":"Airship+Dragoon+v1.5.2++","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f355fcdf192b2cb6a19060384bdc545eeda2240","infoHashBuffer":{"type":"Buffer","data":[143,53,95,205,241,146,178,203,106,25,6,3,132,189,197,69,238,218,34,64]},"announce":[],"urlList":[]}}