{"title":"Iliada - Homero [Epub][Spanish]","uid":6935694,"size":678497,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:901afe5f453fdb2fae3adc570006953cd9024aa3&amp;dn=Iliada+-+Homero+%5BEpub%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"virana","files":-1,"time":1325816621,"description":"La Iliada, de Homero [Epub]\n\n\nEste es un relato puramente bÃƒÂ©lico, que narra la fatigosa lucha entre griegos y troyanos, ocasionada a partir de la traiciÃƒÂ³n de Helena hacia su esposo Menelao y su fuga hacia Troya junto a ParÃƒÂ­s uno de los prÃƒÂ­ncipes de esta ciudad. \n\nSe nos narra una guerra que durÃƒÂ³ mÃƒÂ¡s de diez aÃƒÂ±os, que costo miles de vidas, que partiÃƒÂ³ la unidad de los dioses y que culminÃƒÂ³ con la destrucciÃƒÂ³n de la sacra Ilion.\n\nEste libro es un importante eslabÃƒÂ³n en la leyenda de la destrucciÃƒÂ³n de Troya, sin embargo no cuenta toda la historia, aquÃƒÂ­ Homero se centra en Aquiles, en como su cÃƒÂ³lera hacia el atrida AgamenÃƒÂ³n casi le dio la victoria a HÃƒÂ©ctor, hijo de PrÃƒÂ­amo, prÃƒÂ­ncipe y esperanza de ilion, pues el berrinchudo Aquiles se negÃƒÂ³ a participar en la contienda durante bastante tiempo, lo cual le costo perdidas considerables a los griegos.\nY aquÃƒÂ­ en el intermedio de la historia empiezan a desfilar ante nosotros increÃƒÂ­bles actos heroicos, numerosas muertes de nobles prÃƒÂ­ncipes, sufrimientos de muchas familias, disputas entre dioses y una ligera vacilaciÃƒÂ³n de la suerte, quien no sabÃƒÂ­a a quien entregarle la victoria.\n\nPero la fatalidad envolviÃƒÂ³ a Troya y los hados decretaron su caÃƒÂ­da. Aquiles regreso a la disputa para vengar a su mejor amigo, el valiente Patroclo, quien fue muerto en su ausencia a manos de HÃƒÂ©ctor. AsÃƒÂ­ la esperanza de Ilion se esfumo y la benevolencia de los dioses abandono las altas murallas de Troya. Pero ni aÃƒÂºn aquÃƒÂ­ la historia se cierra, ni se cuentan aÃƒÂºn todas las desdichas que padeciÃƒÂ³  aquella antigua ciudad.  La leyenda continÃƒÂºa,  nacen aventuras quimÃƒÂ©ricas y nosotros tendremos que engullir mas paginas si queremos saber que paso el final del mito.\n\nAhora hay que aclarar que el poema ÃƒÂ©pico de Homero es increÃƒÂ­blemente denso, lleno de descripciones comparativas que se entretienen en alargar las lÃƒÂ­neas y desorientar un poco.\n Admito que me ha costado trabajo devorar este libro, no por su ritmo que aunque cuesta adaptarse a ÃƒÂ©l una vez acostumbrados al estilo narrativo terminas tomÃƒÂ¡ndole gusto, sino que hice esfuerzos supremos porque despuÃƒÂ©s de ciertas paginas estaba harta de tanta sangre y es que este libro de verdad muestra una guerra cruel. \n\nAdemÃƒÂ¡s aquÃƒÂ­ entre nos, yo estaba de parte de los troyanos.  O sea me pareciÃƒÂ³ una soberana tonterÃƒÂ­a que se hiciese una guerra por una mujer infiel y por un bobo prÃƒÂ­ncipe cobarde. Pero bueno, hay que ver cuanto le gustaba la tragedia a los griegos. Y hablando de los griegos y sus escritos, si quieren lanzarse de cabeza a esta historia es indispensable saber un poco de mitologÃƒÂ­a grecorromana, o si no acabaran mÃƒÂ¡s enredados que un nudo ciego y eso le quitarÃƒÂ­a en gran parte su encanto a la obra.\n\nDe modo que la recomiendo a los que tienen mucha paciencia, a los amantes de los clÃƒÂ¡sicos o a los muy versados en las leyendas griegas, porque en caso de no ser partidario de ninguno de casos, pues entonces terminaran mÃƒÂ¡s aburridos que una ostra. \n\nA mÃƒÂ­ si que me ha gustado, no es exactamente lo que yo esperaba, ni me ha gustado leer los hechos que suceden en una guerra, pero me he entretenido bastante con la escritura de Homero, me han encantado sus narraciones  ingeniosas y he disfrutado al probar grandes porciones de fantasÃƒÂ­a.","torrent":{"xt":"urn:btih:901afe5f453fdb2fae3adc570006953cd9024aa3","amp;dn":"Iliada+-+Homero+%5BEpub%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"901afe5f453fdb2fae3adc570006953cd9024aa3","infoHashBuffer":{"type":"Buffer","data":[144,26,254,95,69,63,219,47,174,58,220,87,0,6,149,60,217,2,74,163]},"announce":[],"urlList":[]}}