{"title":"Need for Speed Rivals - AGB Golden Team","uid":9433998,"size":7103109504,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9042ebaeb9713cb6bf1bcc352a3ce50cd01abab7&amp;dn=Need+for+Speed+Rivals+-+AGB+Golden+Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"razalgul1979","files":-1,"time":1388861911,"description":"Game Name: NEED FOR SPEED RIVALS\nGenre: Racing\nGame production: Ghost Games\nGame publishers: Electronic Arts\nPlatform: PC\nGame Language: English\nRelease Date : 22 November 2013\n\n[Game]\nErase the line between single player and multiplayer in this high-stakes street-racing rivalry.\n\n[ Deluxe Edition]\n\nOrigin-exclusive edition: Control the chaos with the Ultimate Cop Pack. Plus, get ahead of your\nrivals with bonus Speed Points, get the Digital Revolution Livery for BMW M3 (E92) GTS and get\nBurnout Paradise included.\n\n\nLeave standard game modes in the dust.\n\nErase the line between single player and multiplayer in this street-racing rivalry between Cops\nand Racers. Seamlessly join a world where your friends are already racing and chasing. Forget\nisolated game modes. There are no lobbies; no waiting. You and your friends can all share the same\nrace as paths cross and experiences merge.\n\nKey features:\n* All-drive: Imagine your race and your friend?s pursuit colliding?creating a world where no\ntwo events feel the same. Don?t want to play with others? Then simply choose to make Redview\nCounty yours alone and dominate the advanced Racer and Cop AI.\n\n* High-stakes rivalry: Racers are lone wolves out for glory; driving agile cars built for\nhigh-speed racing and epic chases. Cops work in teams to hunt down and bust racers using\nthe full power of the police force. Switch roles whenever you like, and watch the stakes\ngrow through a new scoring system that puts your speed points on the line.\n\n* Next-gen racing: Experience speed that you can truly feel in the fastest racing game around,\npowered by the Frostbite 3 engine. Every detail of the game world is rendered in stunning,\nhigh-definition graphics. Race and chase in snow, hail, rain, dust storms and heavy fog.\n\n* Your car, your identity: Personalize your cars with performance and style modifications.\nPower up your car with the latest upgrades in pursuit technology and personalize your\nbodywork with fresh paint jobs, liveries, custom license plates, rims and decals to show\noff your car to the world.\n\n* Pursuit and evasion tech: Use the latest pursuit tech and modifications to change your\npursuit or escape strategy on the fly. Racers evade Cops using turbo bursts, jammers and\nelectromagnetic pulses. Cops will be armed for aggressive busts, deploying shockwaves,\nspikestrips and calling in police roadblocks or helicopter support. \n\n\n\nRecommended Configuration:\nOS: Windows XP 64bit\nCPU: Core 2 Duo 2.4 GHz or Athlon X2 2.6 GHz\nRAM: 4GB System Memory\nGPU RAM: 512MB Graphics Memory\nGPU: Nvidia GeForce 8800 GT 512MB or AMD Radeon HD 3870\nDX: DirectX 10.1","torrent":{"xt":"urn:btih:9042ebaeb9713cb6bf1bcc352a3ce50cd01abab7","amp;dn":"Need+for+Speed+Rivals+-+AGB+Golden+Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9042ebaeb9713cb6bf1bcc352a3ce50cd01abab7","infoHashBuffer":{"type":"Buffer","data":[144,66,235,174,185,113,60,182,191,27,204,53,42,60,229,12,208,26,186,183]},"announce":[],"urlList":[]}}