{"title":"Boardwalk Empire S01E04-E06 (nlsubs) DutchReleaseTeam","uid":6057361,"size":1792977553,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:90c732ce5b1e31306e75fa5ce49bb120a627736c&amp;dn=Boardwalk+Empire+S01E04-E06+%28nlsubs%29+DutchReleaseTeam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DutchReleaseTeam","files":-1,"time":1292963958,"description":"\nformaat :XviD\ngenre: crime/drama\ndutch subs hardcoded\n\nChronicles the life and times of Nucky Thompson, the undisputed ruler of Atlantic City, who was equal parts politician and gangster.\n\nep 4:\nJimmy is in Chicago aangekomen. Tijdens een verblijf bij de prostituee Pearl ontdekt hij al snel dat zijn nieuwe collega, de impulsieve Al Capone, geen gewone jongen is. Maar de twee kunnen het goed met mekaar vinden en Jimmy is hem dankbaar wanneer hij een nieuw maatpak krijgt. Jimmy beweert op doortocht te zijn, maar toch verwikkelt hij zich meteen in het misdaadleven. In geen tijd krijgen Jimmy en Al ruzie met de Ierse misdaadbaas Charlie Sheridan. Wanneer Al vervolgens een grote mond opzet, laat Sheridan de prostituÃƒÂ©e Pearl zwaar verminken..\n\nep5:\nIn Chicago ontfermt Jimmy zich over Pearl, de verminkte prostituÃƒÂ©e. Maar dat is niet naar de zin van Al Capone en Johnny Torrio, van wie het bordeel eigendom is. Ze krijgt nog enkele dagen de kans om te herstellen, nadien moet ze vertrekken. Met de hulp van opium verbijt ze de pijn. Wanneer Jimmy haar een mooi verhaal over een verliefd koppel vertelt, lijkt ze te denken dat haar leven nooit nog mooi kan worden. Wanneer Jimmy haar even verlaat, pleegt ze zelfmoord. Even later brengt Jimmy zelf voor het eerst een bezoekje aan een opiumbar.\n\nep6 :\nLucky Luciano gaat naar bed met Gillian, van wie hij denkt dat ze de echtgenote van Jimmy is. Dat is niet naar de zin van Arnold Rothstein, die hem er op attent maakt dat Gillian eigenlijk de moeder van Jimmy is. Lucky's verblijf in Atlantic City maakt hem in de ogen van Nucky de hoofdverdachte wanneer er geld gestolen wordt. Nucky en Eli pakken Lucky hard aan, maar weten niet dat de broers D'Alessio de echte daders zijn.\n\nvertaald door  minouhse @ bierdopje.com\n\nDeze serie wordt u aangeboden door het DutchReleaseTeam\n &lt;a href=&quot;\nhttp://www.hetmultimediacafe.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hetmultimediacafe.nl&lt;/a&gt;","torrent":{"xt":"urn:btih:90c732ce5b1e31306e75fa5ce49bb120a627736c","amp;dn":"Boardwalk+Empire+S01E04-E06+%28nlsubs%29+DutchReleaseTeam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90c732ce5b1e31306e75fa5ce49bb120a627736c","infoHashBuffer":{"type":"Buffer","data":[144,199,50,206,91,30,49,48,110,117,250,92,228,155,177,32,166,39,115,108]},"announce":[],"urlList":[]}}