{"title":"Red.Dwarf.S10E04.720p.HDTV.MPEG2-SM10 (Optimised for PS3)","uid":7761036,"size":752145644,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:91966cac9009af06d8e3a83b7af51041f6420b25&amp;dn=Red.Dwarf.S10E04.720p.HDTV.MPEG2-SM10+%28Optimised+for+PS3%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Flying_Milkan","files":2,"time":1351227442,"description":"Red.Dwarf.S10E04.720p.HDTV.MPEG2-SM10 (Optimised for PS3)\n\n\nOriginal Uploader Is Spidermike2010 (PHD)\n\nI have been given permission from Spidermike2010 to upload his torrents, He is the original source of this torrent. Check his Facebook page for upcomming uplaods.\n\n\n\nRuntime: 30 min\n \nLanguage: English\n \nDirector: Ed Bye, Doug Naylor, Andy De Emmony, Rob Grant, Juliet May.\n \nCast: Craig Charles, Danny John-Jules, Chris Barrie, Robert Llewellyn, Norman Lovett, Hattie Hayridge, Chlo&amp;#xEB; Annett, Mac McDonald, Graham McTavish, Tony Hawks.\n \nLink: http://www.imdb.com/title/tt0094535/\n\n\n\nRed Dwarf is a British comedy franchise which primarily comprises ten series (including a ninth smaller series named Back To Earth) of a television science fiction sitcom that aired on BBC Two between 1988 and 1999 and on Dave in 2009 and 2012. It gained cult following.[1] It was created by Rob Grant and Doug Naylor, who also wrote the first six series.\n\nSeries X will consist of six episodes, recorded in front of a studio audience in December 2011-January 2012. The opening episode of this revived series was broadcast on 4 October 2012, on Dave and also on Dave HD.\n\nThanks to fov for the original source file, however MKV's do not work natively on PS3 so this has been given the SM10 touch. Converted to MPEG2 and re-synced to accommodate that change as configured a few filters to maximise colour on those bigger screens.\nThis is a regular upload of mine so feel free to revisit, subsequent weeks.\n\nAs always I will seed until 50-100 completes and then the rest is down to you as I will be using my speeds elsewhere. Thanks in advance and leave a comment or visit the Facebook page to leave feedback:-\n","torrent":{"xt":"urn:btih:91966cac9009af06d8e3a83b7af51041f6420b25","amp;dn":"Red.Dwarf.S10E04.720p.HDTV.MPEG2-SM10+%28Optimised+for+PS3%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91966cac9009af06d8e3a83b7af51041f6420b25","infoHashBuffer":{"type":"Buffer","data":[145,150,108,172,144,9,175,6,216,227,168,59,122,245,16,65,246,66,11,37]},"announce":[],"urlList":[]}}