{"title":"Nutritionism - The Science and Politics of Dietary Advice","uid":8864405,"size":3270639,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:91a8fe8403b97fc6c9e1435fdcc937c3bfa04f2b&amp;dn=Nutritionism+-+The+Science+and+Politics+of+Dietary+Advice&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mikey620","files":1,"time":1377822909,"description":" &lt;a href=&quot;http://s1.gigaimg.com/avaxhome/e6/28/002728e6_medium.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://s1.gigaimg.com/avaxhome/e6/28/002728e6_medium.jpeg&lt;/a&gt;\n\n\n\nNutritionism: The Science and Politics of Dietary Advice (Arts and Traditions of the Table: Perspectives on Culinary History) by Gyorgy Scrinis\n2013 | ISBN: 0231156561 | English | 368 Pages | PDF | 3.15 MB\n\nPopularized by Michael Pollan in his best-selling In Defense of Food, Gyorgy Scrinis's concept of nutritionism refers to the reductive understanding of nutrients as the key indicators of healthy food -- an approach that has dominated nutrition science, dietary advice, and food marketing. Scrinis argues this ideology has narrowed and in some cases distorted our appreciation of food quality, such that even highly processed foods may be perceived as healthful depending on their content of &quot;good&quot; or &quot;bad&quot; nutrients. Investigating the butter versus margarine debate, the battle between low-fat, low-carb, and other weight-loss diets, and the food industry's strategic promotion of nutritionally enhanced foods, Scrinis reveals the scientific, social, and economic factors driving our modern fascination with nutrition.\n\nScrinis develops an original framework and terminology for analyzing the characteristics and consequences of nutritionism since the late nineteenth century. He begins with the era of quantification, in which the idea of protective nutrients, caloric reductionism, and vitamins' curative effects took shape. He follows with the era of good and bad nutritionism, which set nutricentric dietary guidelines and defined the parameters of unhealthy nutrients; and concludes with our current era of functional nutritionism, in which the focus has shifted to targeted nutrients, superfoods, and optimal diets. Scrinis's research underscores the critical role of nutrition science and dietary advice in shaping our relationship to food and our bodies and in heightening our nutritional anxieties. He ultimately shows how nutritionism has aligned the demands and perceived needs of consumers with the commercial interests of food manufacturers and corporations. Scrinis also offers an alternative paradigm for assessing the healthfulness of foods -- the food quality paradigm -- that privileges food production and processing quality, cultural-traditional knowledge, and sensual-practical experience, and promotes less reductive forms of nutrition research and dietary advice.","torrent":{"xt":"urn:btih:91a8fe8403b97fc6c9e1435fdcc937c3bfa04f2b","amp;dn":"Nutritionism+-+The+Science+and+Politics+of+Dietary+Advice","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91a8fe8403b97fc6c9e1435fdcc937c3bfa04f2b","infoHashBuffer":{"type":"Buffer","data":[145,168,254,132,3,185,127,198,201,225,67,95,220,201,55,195,191,160,79,43]},"announce":[],"urlList":[]}}