{"title":"Tomb.Raider.Update.v1.0.718.4.PROPER-P2P","uid":8235924,"size":148818547,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:91d5245a8c674e2a82b83bc8695a781699eb38a8&amp;dn=Tomb.Raider.Update.v1.0.718.4.PROPER-P2P&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Gh0stNet","files":2,"time":1362840374,"description":"\nTomb Raider (c) Square Enix\n\n04-03-2013......Release Date - Protection.................Steam\nAction.............Game Type - Disk(s).................1 BLURAY\n\n ******************************\n**     **RELEASE NOTES**       **\n ****************************** \n\nTomb Raider explores the intense and gritty origin story of Lara Croft\nand her ascent from a young woman to a hardened survivor. Armed only\nwith raw instincts and the ability to push beyond the limits of human\nendurance, Lara must fight to unravel the dark history of a forgotten\nisland to escape its relentless hold. Download the Turning Point\ntrailer to see the beginning of Lara's epic adventure.\n\nFeatures:\n\nSmart / Resourceful Lara Lara must use her brawn and her brains to\novercome an impossible situation. The player must guide Lara through\nphysics puzzles, challenging environments, and a high-octane story to\novercome a harrowing situation and make it off of the island alive.\n\nCombat - Tomb Raider is pushing the action genre forward with visceral\nthird-person combat and a deep weapon and gear upgrade system that Lara\nwill have to strategically employ to overcome increasingly difficult\nenemies and environments, all with a unique Survival Action twist.\n\nDynamic Traversal it wouldnt be Tomb Raider without certain\nsignature elements. In addition to platforming, Lara will have to\nexplore large areas to earn experience points that will upgrade her\nweapons and gear. One of the key elements of dynamic traversal is the\ngear gating gameplay loop: over the course of the game, Lara will\ncontinually improve her gear and will be able to reach previously\ninaccessible locations that will allow her to upgrade her gear and\nweapons even further.\n \n\nChangeLog:-\n----------\n- Addressed some stability and startup issues on machines that have both Intel and NVIDIA graphics hardware.\n- Fix for players being unable to progress related to the boat in the beach area.\n- Some fixes for crashes on startup and when selecting Options.\n- Some small improvements to TressFX hair rendering.\n- Fixes for various graphics glitches, including certain effects not being visible in fullscreen mode.\n- Fixed a problem that caused some users to not be able to use exclusive fullscreen.\n- Added support for separate mouse/gamepad inversion for aiming, as well as support for x-axis inversion.\n- Fixes related to the benchmark scene and benchmark mode.\n- Various other small fixes. \n\n ***************************** \n**   **Install Notes:**      **\n ***************************** \n-Unpack it into the game folder,\n-Play and Enjoy\n\n ******************************** \n**   **Additional Notes:**      **\n ******************************** \n \nPatch is provided by sam2k8 (cs.rin.ru)","torrent":{"xt":"urn:btih:91d5245a8c674e2a82b83bc8695a781699eb38a8","amp;dn":"Tomb.Raider.Update.v1.0.718.4.PROPER-P2P","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91d5245a8c674e2a82b83bc8695a781699eb38a8","infoHashBuffer":{"type":"Buffer","data":[145,213,36,90,140,103,78,42,130,184,59,200,105,90,120,22,153,235,56,168]},"announce":[],"urlList":[]}}