{"title":"Anachid Ahmed aboukhater discographie","uid":7789202,"size":199294973,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:92ff9d05f3138a90e7d402aa6f26ef0ec43a51fe&amp;dn=+Anachid+Ahmed+aboukhater+discographie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alichelsea","files":55,"time":1351973049,"description":"Ahmed Bukhatir was born in Sharjah, United Arab Emirates. He was the fifth child of ten born into his family. His father is Abdul Rahman Bukhatir,who became a successful businessman during the economic boom that occurred in the UAE during the 1970s and 80s. As a child Bukhatir spent several years at an Islamic center in Sharjah learning a form of Quranic recitation called Tajwid, in which the voice is used a cappella and other instruments are not used.Bukhatir began singing professionally at the age of 20, and released his first album in 2000 entitled Entasaf Al-Layl.Throughout his recording career he has continued to sing without musical instruments according to the Islamic Sharia law.[His live performances have attracted sizeable audiences, such as at a Global Peace and Unity (GPU) event in the United Kingdom in 2006 that gained an audience of 35,000 attendees to see the various speakers and performers.He has participated in many charity events including the Muslim Aid Event in London, United Kingdom, in 2010.Along with Islamic nasheeds, Ahmed also performs nasheeds which place emphasis on community issues in multiple societies both within and outside the world of Islam.Today Bukhatir is considered to be among the ten most prominent singers of the Nasheed in the world.\n\n\nDiscography\n\nBukhatir at the Global Peace &amp; Unity event, 2010\nAhmed Bukhatir has released many albums covering many topics that include Islam and community issues. He has recorded songs in English, Arabic, and French.[15]\nYear\tTitle\tSales Results |\n2000\tEntasaf Al-Layl\tBestseller in UAE[3]\n2001\tAl Quds Tunadeena\tBestseller in UAE[3]\n2003\tFartaqi\tMore than 100,000 copies sold in UAE and Europe\n2004\tSamtan\tMore than 150,000 copies sold in UAE and Europe\n2005\tDa'ani\tMore than 150,000 copies sold in UAE and Europe\n2007\tHasanat\tMore than 250,000 copies sold in UAE and Europe\n2010\tMoments with Allah\t(results not reported)\n2012    Ramadhan                 results not reported \n\n             ","torrent":{"xt":"urn:btih:92ff9d05f3138a90e7d402aa6f26ef0ec43a51fe","amp;dn":"+Anachid+Ahmed+aboukhater+discographie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92ff9d05f3138a90e7d402aa6f26ef0ec43a51fe","infoHashBuffer":{"type":"Buffer","data":[146,255,157,5,243,19,138,144,231,212,2,170,111,38,239,14,196,58,81,254]},"announce":[],"urlList":[]}}