{"title":"The Hope of Israel: What is it? Phillip Mauro 1922 Ebook","uid":4740754,"size":5382791,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:943f740b17293ca716698da7f771f7d9c9fcc5dd&amp;dn=The+Hope+of+Israel%3A+What+is+it%3F+Phillip+Mauro+1922+Ebook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"CuriousGeorge","files":-1,"time":1235543619,"description":"&quot;Not giving heed to Jewish fables&quot; - Titus 1:14\n\n \n\n Introduction:\n\n    &quot;There are certain Prophetic passages in the Old Testament, which, apart from the light afforded by the New, might be taken as relating to &quot;Israel after the flesh,&quot; and as foretelling the restoration, at some future day, of their national greatness.\n\n    The erroneous doctrine of the teachers of Israel was based upon an unspiritual interpretation of their own Scriptures; for &quot;they know not the voices of their prophets which were read every sabbath day.&quot;\n\nContents\t\n\n    Forward (Jewish Fables).\n\n1. The Nature and Importance of the Question.\n2. How are the Prophecies of Blessing to Israel to be Interpreted?\n3. How the O.T. Prophecies concerning Israel were Interpreted by Paul.\n4. What the Fathers of Israel were Looking for.\n5. God's Warnings through Moses to His Earthly People.\n6. God's Warnings through Moses (Continued).\n7. God's Promises to the Children of Israel Fulfilled by Moses and Joshua.\n8. Salvation in Zion : The Sure Mercies of David.\n9. The Travail of Zion.\n10. The New Covenant.\n11. Ezekiel's Prophecies: Doom of Jerusalem, The Branch, Valley of Death.\n12. Ezekiel's Temple; Where Did the Spirit Descend at Pentecost?\n13. What the N.T. Teaches as to Future Mercies for the Jews.\n14. The Hope of the Gospel, Christ's Personal Teaching.\n15. Other N.T. Passages on the Future of Israel.\n16. Where is the Promise of His Coming?\n17. The Election hath Obtained it. Hath God Cast Away His People?\n18. Building Again the Tabernacle of David.\n19. Shall Israel Be Restored as a Nation?\n20. The Millennium.\n\nFORWARD\n\nNOT GIVING HEED TO JEWISH FABLES' (Titus 1:14).\n\n     Jewish fables (literally, myths) are no new thing. Paul has plainly warned the household of faith not to give heed thereto. He has not given us a list of those grievous heresies; but it is well known that the one that was most fondly cherished, and that constituted the gravest menace to the truth of the gospel, was the notion that the leading purpose of the mission of the coming Messiah would be the reconstitution of the Jewish nation and its elevation to the highest pinnacle of earthly dominion and glory; for that fatuous doctrine was the cornerstone of orthodox Judaism in Paul's day; and because of his sturdy opposition to it he was persecuted, his enemies plotted to take his life, and he was sent a prisoner to Rome. No wonder that, during the term of his imprisonment there, he wrote to Titus his plain-spoken warning against &quot;Jewish fables.&quot;\n\n     Such being the case, we question if there be anything in all the long history of Christianity that is more difficult to account for than the fact that that particular fable, concerning the purpose of Christ's mission to the Jewish people, has become the central feature of a system of doctrine which, in this 20th century of our era, has found numerous and zealous advocates amongst orthodox Christians. In view of this extraordinary phenomenon, it surely behooves those who take the Holy Scriptures for their guide and instructor in all matters of faith and doctrine, to search them with the utmost care &quot;whether these things be so.&quot; This present volume is the result of a painstaking investigation of that important question.\n\n     The investigation of that question leads inevitably to the subject of the Millennium; and it is believed the reader will find, in the last chapter of the present volume, something fresh upon that subject of perennial interest. Enough at this point to say that, as the author now sees it, the great question concerning the Millennium is not When? but Where?\n\n----------------------------------------------------------------------------------\n\nMy public URL:\t &lt;a href=&quot;\nhttp://thepiratebay.se/user/TalmudTimmy&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/TalmudTimmy&lt;/a&gt;\n\nMy RSS feed:\t &lt;a href=&quot;\nhttp://rss.thepiratebay.se/user/97bdef327d0ba834f331abb3d0fe47a2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://rss.thepiratebay.se/user/97bdef327d0ba834f331abb3d0fe47a2&lt;/a&gt;","torrent":{"xt":"urn:btih:943f740b17293ca716698da7f771f7d9c9fcc5dd","amp;dn":"The+Hope+of+Israel%3A+What+is+it%3F+Phillip+Mauro+1922+Ebook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"943f740b17293ca716698da7f771f7d9c9fcc5dd","infoHashBuffer":{"type":"Buffer","data":[148,63,116,11,23,41,60,167,22,105,141,167,247,113,247,217,201,252,197,221]},"announce":[],"urlList":[]}}