{"title":"Johnny Cash - The Soul of Truth Bootleg Vol IV (2012) [V0]","uid":7251600,"size":248455345,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:95aab92022d99bd6f5d947219e54e9dab0e8b569&amp;dn=Johnny+Cash+-+The+Soul+of+Truth+Bootleg+Vol+IV+%282012%29+%5BV0%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1336467520,"description":"Johnny Cash - Bootleg Vol. IV: The Soul of Truth [2012] [Anthology]\nOriginal Release / Columbia/Sony Legacy / CD\n\nIf not for gospel music, there never would have been a Johnny Cash. When Cash decided he wanted to be an entertainer, there was really only one type of music he intended to sing. Although Cash reinvented himself many times during his life, there was one way in which he never did: His faith. And this faith, with its roots so firmly planted in gospel music, stayed with him throughout his life.\n\nBootleg Vol. IV: The Soul Of Truth presents an intimate and personal look at Cash s passion for gospel music and his own spiritual path. Bootleg Vol. IV presents three rare albums in their entirety: A Believer Sings The Truth; an untitled, unreleased 1975 set; and Johnny Cash Gospel Singer. Among these hard-to-find recordings are 15 unreleased tracks including outtakes from the sessions at which the albums were recorded.\n\nJohnny Cash's son, John Carter Cash, provides liner notes that detail Cash's upbringing on gospel and his passion for recording and performing this music despite resistance from his record labels. Though he would sing many kinds of music in his life, he was never truer than when he sang songs of faith.\n\nTo fully grasp Cash's legend, one must hear his earliest performances, as well as unreleased or under-promoted recordings that somehow remained out of earshot of an adoring (and still-expanding) public. Such is the mission of the Johnny Cash Bootlegs, a series of multiple-disc packages brimming with historical importance but also delivering thoroughly enjoyable listening experiences, each programmed to stand as a captivating doorway into Cash's popular legacy as effectively as any greatest hits compilation.","torrent":{"xt":"urn:btih:95aab92022d99bd6f5d947219e54e9dab0e8b569","amp;dn":"Johnny+Cash+-+The+Soul+of+Truth+Bootleg+Vol+IV+%282012%29+%5BV0%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95aab92022d99bd6f5d947219e54e9dab0e8b569","infoHashBuffer":{"type":"Buffer","data":[149,170,185,32,34,217,155,214,245,217,71,33,158,84,233,218,176,232,181,105]},"announce":[],"urlList":[]}}