{"title":"Sexually Broken--Chanell Heart ladder bound, tag teamed from bot","uid":9965973,"size":1414376249,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:96dbaee568191e44a8409aa238418767b9023d58&amp;dn=Sexually+Broken--Chanell+Heart+ladder+bound%2C+tag+teamed+from+bot&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"merzedes","files":-1,"time":1397568216,"description":"Sexually BrokenChanell Heart ladder bound, tag teamed from both ends, brutal deepthroat, dicked down hard and deep!  Chanell Heart  Matt Williams\n\n\niPod + Low and Hi bitrate MP4 + Pics.\n\nChanell Heart is the perfect package. Smoking hot, genuinely friendly and a true lover of rough and pounding sex. A perfect package like this does not come along every day, and here at Sexuallybroken we like to reward them in the best way possible. By stuffing them full of cock until their eyes bulge. And we are going to bring not one but two cocks to the table to make that happen.\n\nBound in and through a custom made wooden bondage ladder, Chanell has both ends completely exposed and ready for use. We oil down that amazing ass to put a proper shine to it before we start stuffing her full of the dick. The oil is the frosting on that sex cake of an ass. Once she is shined up we go in for the kill. Chanell is going to be chinese fingertrapped, drilled down from both ends without mercy as the dicks attempt to shake hands in the middle, until her brain melts. \n\n10 inches of BBC slam home straight down Chanell's eager gullet. We own every inch of her facepussy while her pussy gets plowed. Back and forth we switch, never slowing down, never letting up, never showing mercy. Chanell cums uncontrollably, over and over, as the cock reshapes her pussy to be custom fitted. We use a leather belt to wrap around her waist and steer her even deeper onto the dick. The belt grabs her hips and bites in deep, trapping her on the cock. Chanell responds by cumming yet again.\n\nPicking up the pace to total destruction, we grab her facehole and slam in all the way with the cock, limiting her breathing, controlling her throat and misting up her eyes. The bondage and dick combine to keep her totally trapped. Chanell has been fucked so hard and so deep she is limp in the ladder, her face destroyed and slick with her own juices. We leave her there, drool slowing trickling out of her mouthole and eyes glazed over, deep in subspace. Good seeing you again Chanell!\n\n\nScreens \n &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2014/04_14cheart4/SexuallyBroken-Chanell-Heart-Matt-Williams-Chanell-Heart-ladder-bound-tag-teamed-from-both-ends-brutal-deepthroat-dicked-down-hard-and-deep.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2014/04_14cheart4/SexuallyBroken-Chanell-Heart-Matt-Williams-Chanell-Heart-ladder-bound-tag-teamed-from-both-ends-brutal-deepthroat-dicked-down-hard-and-deep.php&lt;/a&gt;\n\n\n14 000 down, but how much more to come ?? You decide ;) \n\nThe more you appreciate it, the more we want to do it. Can we get to 15k ??? \n\nWell, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n  &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-) ","torrent":{"xt":"urn:btih:96dbaee568191e44a8409aa238418767b9023d58","amp;dn":"Sexually+Broken--Chanell+Heart+ladder+bound%2C+tag+teamed+from+bot","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96dbaee568191e44a8409aa238418767b9023d58","infoHashBuffer":{"type":"Buffer","data":[150,219,174,229,104,25,30,68,168,64,154,162,56,65,135,103,185,2,61,88]},"announce":[],"urlList":[]}}