{"title":"Jesus Words from the Bible - Preeminent Unviolent Warrior and Te","uid":6923150,"size":171366901,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9743fb53e00771f7e22973403d8e03c48b032140&amp;dn=Jesus+Words+from+the+Bible+-+Preeminent+Unviolent+Warrior+and+Te&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"UnviolentPeacemaker","files":39,"time":1325339938,"description":"1. URGENT, PLS, SEED, SEED, SEED ALL, ALL, ALL ...\nUnviolentPeaceMaker's TPB uploads        &lt;a href=&quot;\nhttp://thepiratebay.se/user/UnviolentPeacemaker/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/UnviolentPeacemaker/&lt;/a&gt; .  \nSOON I MAY BE PREVENTED.  DO IT.  \nKEEP THESE TORRENTS ALIVE.  Thanks.  All of them.\n\n2. NOTE:  High Quality ATT Voice. Dont like it?  Dont download it.  Dont complain.  Dont get in the way.\n\n----------------\n\nThe Man Jesus, and his Teachings, be he man, or myth, person or committee of writers, is deemed by Gandhi to be the greatest exemplar of Unviolent Peace Making, Waging Love, Being Human, Heart Force, Nonviolence... that ever existed or was conceived. Leo Tolstoy, Gandhi's window to Jesus' Teachings, conceived the same.  As did Dr. Martin Luther King, Jr., Oscar Romero, Dom Holder Camara, Teresa of Calcutta and other of the greatest unvolent warriors.\n\nNote, these four gospels are from the modern King James Version, as I recall, but, no matter.\n\nThey are sequenced not in the traditional order, but in the order of writing, from Mark though John.  Notice that it is John, and not the earlier gospel writers that turn Jesus from a Teacher of Truth into a Cult Idol.  Don't hold that against Jesus.  He had been dead many, many years before this, the real crucifixion.\n\nAlso, the nonsense made up about seeing and hearing Jesus after his death are omitted from the materials so as not to clutter Jesus singular teachings about Living, and waging unviolent Love, with hideous pagan idiocy that is the very opposite.","torrent":{"xt":"urn:btih:9743fb53e00771f7e22973403d8e03c48b032140","amp;dn":"Jesus+Words+from+the+Bible+-+Preeminent+Unviolent+Warrior+and+Te","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9743fb53e00771f7e22973403d8e03c48b032140","infoHashBuffer":{"type":"Buffer","data":[151,67,251,83,224,7,113,247,226,41,115,64,61,142,3,196,139,3,33,64]},"announce":[],"urlList":[]}}