{"title":"Dhafer Youssef - Abu Nawas Rhapsody [FLAC] TQMP","uid":5446549,"size":335177080,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:97dd843ded2da4cd040cb55de532b4bff6f174fe&amp;dn=Dhafer+Youssef+-+Abu+Nawas+Rhapsody+%5BFLAC%5D+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pastafari","files":-1,"time":1269035335,"description":"Dhafer Youssef - Abu Nawas Rhapsody\n2010\n\nAnother heavyweight from Youssef.\n\nBrought to you by TQMP\nThe Quality Music Project\n\nBorn in the city of Teboulba, Dhafer Youssef began his musical career in the Koranic school, absorbing the musical influences around him. He was a Muezzin before he saved the money to buy his first oud. With 19, he decided to move Vienna.\n\nThere he met the Austrian percussion player Gerhard Reiter who introduced him to Toni Burger and other members of the Vienna Jazz Scene.\n\nThe Jazz Club Porgy and Bess gave Dhafer a &quot;carte blanche&quot;. For a whole year, he could do whatever he wanted once a month. On these occasions he invited Europe's experimental-Jazz community, e.g.  Iva Bittova, Linda Sherock, Tom Cora, Wolfgang Puschnig. He recorded his first CD Malak (enja) during this residency, featuring Nguyen Le, Markus Stockhausen and Renaud Garcia-Fons among others, which established him as an internationally acclaimed artist.\n\nHaving lived in various European capitals and in Dakar, Senegal, Dhafer moved to New York in 2001 where he recorded his second CD Electric Sufi (enja) featuring Dieter Ilg, Wolfgang Muthspiel, Doug Wimbish, Will Calhoun and Mino Cinelu.\n\nReturning to Paris the same year, Dhafer began to explore the Norwegian Nu-Jazz scene around Nils-Paetter Molvaer and Eivind Aarset. The release of his third album Digital Prophecy (enja) in 2003 reveals Dhafer's profound spiritual singing and playing embedded in the existentialistic world of Norwegian music - with Eivind Aarset (guitar), Rune Arnesen (drums), Bugge Wesseltoft (keyboards), Dieter Ilg (bass), sampling by Jan Bang and the bansouri virtuoso Ronu Majumdar.\n\nThe Norwegian collaboration continued on Dhafer's fourth album Divine Shadows (Jazzland/ Universal) in 2006, produced by Eivind Aarset, featuring Arve Henriksen, Audun Erlien and Rune Arnesen. Unlike previous albums, Dhafer's voice and oud are at the forefront on this album, from the glorious sweeping vocals of the opening track Cantus Lamentus to the purity of the oud on Miel et Cendres. The album has an added complexity and subtlety, aided by the inclusion of the Oslo Session String Quartet, which emphasises the melodies, complementing the textures and colours that the core band conjured up.\n\nIn the years after the release of Divine Shadows, Dhafer concentrated on playing live with different line ups. He toured with his Norwegian band (Aarset, Erlien, Arnesen), the Koehne string quartet from Vienna, the tabla player Jatinder Thakur and drummer/percussionist Satoshi Takeishi or a combination of all of them.\n\nIt was in 2008 when Dhafer focussed more on the acoustic side of Jazz music and decided to form a group in the classic piano, double bass and drums setup.\n\nHis new album Abu Nawas Rhapsody (Jazzland/ Universal) will be released in February 2010 and features three exciting musicians: Tigran Hamasyan, the young Armenian shooting star on piano, Chris Jennings, a Canadian double bass player living in Paris, and New York drummer Mark Guiliana. On the new album we can hear Mark's trademark combination of energetic rhythmic multiple layers with a sense of calm and serenity and Dhafer's voice echoing the immensity of divine bliss.\n\nThis very special mix of musical elements and creative talent produces a soundscape that is new and original. With the musicians' commitment to exploring and experimenting paired with their subtleness and courage to be silent, this is sure to catch the attentive ear of any listener.\n\nDhafer Youssef's &quot;ABU NAWAS RHAPSODY&quot;\n\nIt's not only Abu Nawas' rhapsody, it is also my rhapsody. Maybe it is yours too. It's about mysticism, sexuality, spirituality, and more than anything, love. History repeats itself through our personalities, and as an Arab sometimes I feel that I belong to Abu Nawas's time, or perhaps he to mine.\n\nHow surprisingly real can the sensitivity of poets be, like that of Abu Nawas and Ibn Fared - their thoughts, their approach to life or their way of approaching life.\n\nWhat interests me most is the idea of longing, of yearning and desire in my own universe as well as in the people around me.  \n\nIn the end, what I seek is the Tajalli: the dream, the ecstasy, call it spiritual lust. Beauty is a real, sensual and simple concept:  what we see, hear, taste and feel, guided by desire and inspired by love.\n-- Jazzland Recordings\n\nTracks\n01- Sacre 'The Wine Ode Suite'\n02- Les Ondes Orientales\n03- Khamsa 'The Khamriyat of Abu Nuwas'\n04- Interl'Oud\n05- Odd Elegy\n06- Ya Hobb 'In The Name Of Love'\n07- Shaouk\n08- Shatha\n09- Mudamatan 'The Wine Ode Suite'\n10- Hayastan Dance\n11- Sura\n12- Profane 'The Wine Ode Suite'\n\nArtwork, EAC log and CUE sheet included.\n\nAudio format: FLAC (Free Lossless Audio Codec) &lt;a href=&quot;\nhttp://flac.sourceforge.net/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://flac.sourceforge.net/index.html&lt;/a&gt; \n\nEnjoy, seed and inhale!\n\nLegalise it!\n\nPastafari Cubensis &lt;a href=&quot;\nhttp://thepiratebay.se/user/pastafari/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pastafari/&lt;/a&gt;\nProud Member of the Church of the Flying Spaghetti Monster &lt;a href=&quot;\nhttp://venganza.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://venganza.org&lt;/a&gt;","torrent":{"xt":"urn:btih:97dd843ded2da4cd040cb55de532b4bff6f174fe","amp;dn":"Dhafer+Youssef+-+Abu+Nawas+Rhapsody+%5BFLAC%5D+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97dd843ded2da4cd040cb55de532b4bff6f174fe","infoHashBuffer":{"type":"Buffer","data":[151,221,132,61,237,45,164,205,4,12,181,93,229,50,180,191,246,241,116,254]},"announce":[],"urlList":[]}}