{"title":"Reliability of Safety-Critical Systems - Theory and Applications","uid":12550293,"size":18524394,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:98ed97f6dbf995d71badc3cf772735c610fe4765&amp;dn=Reliability+of+Safety-Critical+Systems+-+Theory+and+Applications&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1444532308,"description":"Reliability of Safety-Critical Systems - Theory and Applications - Marvin Rausand (Wiley, 2014).pdf\r\n\r\nISBN 9781118112724\r\n\r\nPresents the theory and methodology for reliability assessments of safety-critical functions through examples from a wide range of applications Reliability of Safety-Critical Systems: Theory and Applications provides a comprehensive introduction to reliability assessments of safety-related systems based on electrical, electronic, and programmable electronic (E/E/PE) technology. With a focus on the design and development phases of safety-critical systems, the book presents theory and methods required to document compliance with IEC 61508 and the associated sector-specific standards. Combining theory and practical applications, Reliability of Safety-Critical Systems: Theory and Applications implements key safety-related strategies and methods to meet quantitative safety integrity requirements. In addition, the book details a variety of reliability analysis methods that are needed during all stages of a safety-critical system, beginning with specification and design and advancing to operations, maintenance, and modification control. The key categories of safety life-cycle phases are featured, including strategies for the allocation of reliability performance requirements; assessment methods in relation to design; and reliability quantification in relation to operation and maintenance. Issues and benefits that arise from complex modern technology developments are featured, as well as: * Real-world examples from large industry facilities with major accident potential and products owned by the general public such as cars and tools * Plentiful worked examples throughout that provide readers with a deeper understanding of the core concepts and aid in the analysis and solution of common issues when assessing all facets of safety-critical systems * Approaches that work on a wide scope of applications and can be applied to the analysis of any safety-critical system * A brief appendix of probability theory for reference With an emphasis on how safety-critical functions are introduced into systems and facilities to prevent or mitigate the impact of an accident, this book is an excellent guide for professionals, consultants, and operators of safety-critical systems who carry out practical, risk, and reliability assessments of safety-critical systems. Reliability of Safety-Critical Systems: Theory and Applications is also a useful textbook for courses in reliability assessment of safety-critical systems and reliability engineering at the graduate-level, as well as for consulting companies offering short courses in reliability assessment of safety-critical systems","torrent":{"xt":"urn:btih:98ed97f6dbf995d71badc3cf772735c610fe4765","amp;dn":"Reliability+of+Safety-Critical+Systems+-+Theory+and+Applications","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98ed97f6dbf995d71badc3cf772735c610fe4765","infoHashBuffer":{"type":"Buffer","data":[152,237,151,246,219,249,149,215,27,173,195,207,119,39,53,198,16,254,71,101]},"announce":[],"urlList":[]}}