{"title":"Lock On-DCS:Black Shark Rus to Eng Patch with English Cockpit","uid":4803213,"size":815046822,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:99615affab3da39fbcbafc8c51817afba5cf371f&amp;dn=Lock+On-DCS%3ABlack+Shark+Rus+to+Eng+Patch+with+English+Cockpit&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Anthony817","files":-1,"time":1238108372,"description":"This is a &quot;patch&quot; I made in light of the fact of it being so damn hard to make the Russian version of Black Shark convert to the English language.No longer will you need to Download the Full English version of the Sim just to take out the needed files and mess with registry keys!\n\nI have included all files necessary to make the game completely in the English language.I have also included the English cockpit mod to make things that much easier for conversion.\n\n\n&quot;DCS: Black Shark&quot; is a PC game of the Russian Ka-50 attack helicopter and is the first title in a new Eagle Dynamics and The Fighter Collection simulation series: &quot;Digital Combat Simulator&quot; (DCS). Following Eagle Dynamics' tradition of excellence, &quot;DCS: Black Shark&quot; will bring an even more realistic simulation experience than its predecessor &quot;Flaming Cliffs&quot;. &quot;DCS: Black Shark&quot; will offer an unprecedented level of realism in regards to flight dynamics, instruments modeling, avionics systems, and weapon systems. The artificial Intelligence of ground vehicles and helicopters has been improved dramatically as well as weapon modeling. A new Mission Editor includes a powerful electronic mapping system that allows user to easily create missions and campaigns. A new campaign system allows the front line of the battlefield to move back and fourth according to your mission success or failure. Due to the increased flexibility of the DCS system, additional fixed-wing aircraft and helicopter add-ons will follow shortly.\n\nFirst thing is first tho,you must Download the Russian version from here.\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4452950/Digital_Combat_Simulator__Black_Shark_%5BRUS%5D%5B1C%5D(2008)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4452950/Digital_Combat_Simulator__Black_Shark_%5BRUS%5D%5B1C%5D(2008)&lt;/a&gt;\n\nInstall the game then use this No DVD crack,AFTER removing the Starforce driver.\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4708137/play_dcs_black_shark_in_vistax64_without_antistarforce_driver&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4708137/play_dcs_black_shark_in_vistax64_without_antistarforce_driver&lt;/a&gt;\n\nHere is the link to Download the Mod Manager required to install the English cockpit add-on.\n &lt;a href=&quot;\nhttp://www.backup.lockonfiles.com/modules/Downloads/fileuploads/ModMan7110.zip#dl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.backup.lockonfiles.com/modules/Downloads/fileuploads/ModMan7110.zip#dl&lt;/a&gt;\n\nAlso here is the link for the English User manuals(2)for DCS:Black Shark.\n\n\ndelete exclamation marks :) \n\nI have included all instructions in the Readme Located in the torrent for proper conversion to the English language.\n\nHave fun and Please seed this and leave comments!Happy Simming!\n\n\nEdit:Also if you guys want a fully working version of Lock on Flaming Cliffs look no further than here!\n\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4864923/Lock_On__Flaming_Cliffs_(danoobs_Working_Version)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4864923/Lock_On__Flaming_Cliffs_(danoobs_Working_Version)&lt;/a&gt;\n----------------------------------------------------------------------------------\n\nInstructions:\n\nTo remove Starforce******** Go into the game directory and find the Protect icon with the key. Right click and select &quot;Remove SF driver&quot; uninstall and reboot PC.\n\nAdd crack files to game after reboot!\n\n\nTo make the game fully in English:\n\n#1. Rename the following folders [Blackshark] [FUI] [l10n] [Missions] [Sounds] (I always use &quot;_&quot; in front of them so I have them just where they are supposed to be: [_Blackshark] [_FUI] [_l10n] [_Missions] [_Sounds])\n\n#2. Copy (Do not move them, always keep the originals in case something goes wrong and you have to revert and try again) those folders from the English &quot;patch&quot; to the Russian version.\n\n#3. To get the training menu in English:\na. Go to BlackSharkDataScriptsTraining\nb. You should have 2 files there:\nTrainingData.lua and TrainingData_ru.lua\nc. Rename the TrainingData_ru.lua to something else (like &quot;_TrainingData_ru.lua&quot;) or make another folder inside that one and move it there) so only the English file is in the folder.\nd. That's it, training missions menu should be in English.\n\n#4. For the Encyclopedia:\na. Go to BlackSharkDataScriptsEnc\nb. You should have a folder for each different category of objects (helicopters, planes, etc.).\nc. Inside each one of those folders you should see 2 sets of files, one in English &quot;FileName.txt&quot; and &quot;FileName_ru.txt&quot;.\nd. Rename (or move to another folder) all files ending in &quot;_ru.txt&quot;. I prefer to create a sub-folder inside each folder, call it &quot;bck&quot; and move the file there?s so in case I need them, I know they are one folder bellow where they should be, but that's up to you.\ne. That's it. Encyclopedia should be in English.\n\n#5. To get the rest of the screens in English, go to the &quot;binstable&quot; folder, rename the files Common.dll, Cosmos.dll and lua*.dll and copy those files from the English installation.\n\n#6. If you want to get rid of Russian missions, go to the Mission folders and do the same to each name with &quot;strange&quot; characters (I believe they should be in Russian but since we don't have the fonts we see them this way).\n\n#7. If you want the cockpit in English you will need to dl the mod installer tool and do it that way.\n &lt;a href=&quot;\nhttp://www.backup.lockonfiles.com/modules/Downloads/fileuploads/ModMan7110.zip#dl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.backup.lockonfiles.com/modules/Downloads/fileuploads/ModMan7110.zip#dl&lt;/a&gt;\n\nTo make the menu in English,navigate to [Install_Path]l10n, and rename folder RU to RU1 to make main screen in English.\n\n\nNotes: If you have an ATI card, go into CCC and disable Catalyst AI. I had problems runing the game with my 3870x2 untill I disabled it.","torrent":{"xt":"urn:btih:99615affab3da39fbcbafc8c51817afba5cf371f","amp;dn":"Lock+On-DCS%3ABlack+Shark+Rus+to+Eng+Patch+with+English+Cockpit","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99615affab3da39fbcbafc8c51817afba5cf371f","infoHashBuffer":{"type":"Buffer","data":[153,97,90,255,171,61,163,159,188,186,252,140,81,129,122,251,165,207,55,31]},"announce":[],"urlList":[]}}