{"title":"The Ultimate Gift(2007)DVDRip.AC3(ENG)-DROCk","uid":6798480,"size":733830615,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9a5c69216026f0e24fb270c7d49a7d65f6834ae5&amp;dn=The+Ultimate+Gift%282007%29DVDRip.AC3%28ENG%29-DROCk&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drock232","files":-1,"time":1320561251,"description":"Filmmaker Michael O. Sajbel explores the relationship between wealth and happiness with this spiritual-minded tale about a privileged young man who receives a most unexpected inheritance. Adapted from the best-selling book by author Jim Stovall, The Ultimate Gift opens as trust-fund baby Jason Stevens (Drew Fuller) prepares to receive a sizable inheritance from his late grandfather Red (James Garner). Though Jason is convinced that the money is about to come flowing in, he receives a sudden shock upon discovering that Red has instead decided to offer him something much more valuable than simple cash. Realizing that his spoiled grandson has lived a sheltered life in which he has always been handed the very best of everything, Red has devised a crash course in living comprised of 12 gifts that will challenge the arrogant young man in ways that he could never have imagined nor anticipated. In the weeks that follow, Jason will befriend a terminally ill child (Abigail Breslin) and her grief-stricken mother (Ali Hillis) while attempting to determine whether it is money or happiness that truly matters in life. Brian Dennehy and Lee Meriwether co-star in an uplifting drama from the director of The Ride and One Night with the King.\n\nRipped with Handbrake.\n\nLength: 1 Hour 57 Minutes\n\nFile Type: MP4\n\nFrame Width: 624\n\nFrame Height: 352\n\nFrame Rate: 29fps\n\nAudio\n\nBit Rate: 159kbps","torrent":{"xt":"urn:btih:9a5c69216026f0e24fb270c7d49a7d65f6834ae5","amp;dn":"The+Ultimate+Gift%282007%29DVDRip.AC3%28ENG%29-DROCk","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a5c69216026f0e24fb270c7d49a7d65f6834ae5","infoHashBuffer":{"type":"Buffer","data":[154,92,105,33,96,38,240,226,79,178,112,199,212,154,125,101,246,131,74,229]},"announce":[],"urlList":[]}}