{"title":"the secret of nikola tesla TS- VIDEO 6,8 gb","uid":4956301,"size":7115535120,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9ac496ea9d11bedb15e237abb35b73ec140d98cb&amp;dn=the+secret+of+nikola+tesla+TS-+VIDEO+6%2C8+gb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"flipp022","files":13,"time":1245118554,"description":"this is of vhs video tape&gt; to mpeg2&gt; to TS-VIDEO FILE 6.62 GB,\n\nthis quality is better as of the VHS video tape\n\nquality is well, improve colors, as the others version on Internet,\n\nthis is that Nikola Tesla, become never will forget,\n\nformat&gt; pal\n\n\n\nThis is a rare biographical movie Secret of Nikola Tesla - The Movie (original title: Tajna Nikole Tesle) (1980) which shows the life of this great inventor in the time of his greatest discoveries in America. When a young and gifted inventor by the name of Nikola Tesla (Petar Bo?ovi?) arrives in America, he first works for the famous Thomas Edison (Dennis Patrick) but later strikes a fruitful cooperation with George Westinghouse (Strother Martin). Together they battle against Edison in order for Tesla's superior system of alternative current to be accepted by the world community who currently uses only Edison's system of direct current. Later on the mighty financier J.P. Morgan (Orson Welles) joins the game as he provides Tesla with financial support to build his Colorado Springs laboratory only to completely dump him later on after he realizes Tesla's inventions could provide the world with unlimited free energy for everybody. See one of the most important periods of modern history and the tragedy of this great inventor who aspired to change the world towards a better place only to find out it was not ready for it yet. A rare attempt of biographical movie production by the former yugoslav (croatian) cinema, the movie being completely in english","torrent":{"xt":"urn:btih:9ac496ea9d11bedb15e237abb35b73ec140d98cb","amp;dn":"the+secret+of+nikola+tesla+TS-+VIDEO+6%2C8+gb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ac496ea9d11bedb15e237abb35b73ec140d98cb","infoHashBuffer":{"type":"Buffer","data":[154,196,150,234,157,17,190,219,21,226,55,171,179,91,115,236,20,13,152,203]},"announce":[],"urlList":[]}}