{"title":"French Toast, Waffles and Pancakes for Breakfast - Donna Leahy (","uid":12011411,"size":15337911,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9cdae0303c02f06e27ad79822f8e22524f7225fd&amp;dn=French+Toast%2C+Waffles+and+Pancakes+for+Breakfast+-+Donna+Leahy+%28&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MentalZero","files":1,"time":1434144216,"description":"The comprehensive guide to cooking delicious breakfast comfort food with over 100 time-tested recipes and photographs from acclaimed chef Donna Leahy, author of Eggs for Breakfast, Morning Glories and Recipe for a Country Inn.\n\nA chef's passion for breakfast shines in these easy-to-follow recipes for elegant, creative breakfasts featuring French toast, waffles and pancakes. In French Toast, Waffles and Pancakes for Breakfast: Comfort Food for Leisurely Mornings, celebrated cookbook author Donna Leahy shares her favorite mouth-watering recipes for the morning meal. Leahy sets a new standard for breakfast comfort food with creative dishes that are easy to prepare. From sweet to savory, over 100 step-by-step, mouth-watering recipes will become trusted favorites for A.M. entertaining. With gorgeous color photographs and practical tips, French Toast, Waffles and Pancakes for Breakfast will become the go-to breakfast cookbook for enjoying inspired, restaurant-quality comfort food at home","torrent":{"xt":"urn:btih:9cdae0303c02f06e27ad79822f8e22524f7225fd","amp;dn":"French+Toast%2C+Waffles+and+Pancakes+for+Breakfast+-+Donna+Leahy+%28","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9cdae0303c02f06e27ad79822f8e22524f7225fd","infoHashBuffer":{"type":"Buffer","data":[156,218,224,48,60,2,240,110,39,173,121,130,47,142,34,82,79,114,37,253]},"announce":[],"urlList":[]}}