{"title":"StudioLine Photo Classic 3 Plus v3.70.51.0 with Key [TorDigger]","uid":7865229,"size":79102852,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9d3b73af01ff9382c7404603eff6926c7e771ae2&amp;dn=StudioLine+Photo+Classic+3+Plus+v3.70.51.0+with+Key+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TorDigger","files":3,"time":1354040274,"description":"StudioLine Photo Classic 3 Plus is an equally powerful and easy to use software for the convenient management and editing of extensive image collections for any digital photography user. StudioLine Photo Classic 3 Plus manages images of all common graphics formats in a secure &quot;Image Archive&quot; database.\n\nCategorize your images with textual descriptions of any length in system descriptors or your own user descriptors, or assign keywords and ratings. After that, locating individual images or finding images to match a certain theme will be a trivial task.\n\nConvenient Geotagging\n\nWith the help of location data supplied by GPS data loggers or\n\ndigital cameras, photos can be displayed on digital maps or\n\nsatellite images.\n\nManual geotagging is as easy as dragging each photo to its\n\nintended location on a digital map.\n\nStudioLine automatically queries the GeoNames web service for\n\nlocation details such as country, city, and possibly even street\n\nnames. This allows photo collections to be quickly searched, filtered\n\nand sorted by cities, sights or other place names.\n\nImage Editing and Archiving\n\nStudioLine Photo Classic 3 Plus comes with an impressive array of professional editing tools. With\n\na few simple steps you can turn a set of images into a slide show, publish them as a web gallery,\n\nburn a CD/DVD or send them to friends and family via Email.\n\nAlso built-in are extensive print functions for any format and size imaginable, or you can print\n\ncontact sheets, greeting cards, calendars and CD-covers.\n\nPresentation\n\nView your images in your own albums, in the\n\nadvanced Timeline Explorer or by keywords and\n\ncategories. Avoid data loss by backing up your\n\nimage archive, with all metadata and image\n\nedits, to CD, DVD or secondary hard disk.\n\nFunction Tour\n\nCustomizable User Interface\nPanes for image tools, descriptors, hints and folder/image information are clearly organized. Size, move, dock or hide panes to perfectly adapt StudioLine to your work flow.\n\nOrganize Efficiently and Locate Quickly\nThe highly reliable image archive of StudioLine Photo Classic 3 Plus lets you take control of your rapidly growing photo collections.\n\nProfessional Editing\nGet the professional results out of your images with StudioLine's integrated and intuitive image editing.\n\nFlexible Layout and Publishing\nThere are numerous options to share your images, including email, prints, web galleries, export and interfacing with online services.\n\nConvenient Backup and Offload\nPerform incremental CD/DVD backups of your images, complete with descriptions and image tool settings. No third party software required.\n\nSupport for RAW Files\nRAW formats of popular cameras by Canon, Fujifilm, Konica-Minolta, Nikon, Olympus, Pentax, Sony, Sigma and other brands are supported. The extended color space allows for losless editing of your RAW formatted images.\n\nSystem Requirements:\n\nMicrosoft Windows 7 / Vista / XP SP3Â·\nProcessor with a minimum of 1.6 GHz, higher recommended\n2 GB RAM, more recommended\n150 MB disk space for programs (allow extra space for data)\n24 bit graphics adapter with monitor resolution of 1024 x 786 pixels\n\nHomepage: http://www.studioline.net/EN/products/overview-photo-classic/default.htm\n\nInstallation Instructions:\n\n1. Install program\n2. Use given Key to register.\n3. Done, Enjoy","torrent":{"xt":"urn:btih:9d3b73af01ff9382c7404603eff6926c7e771ae2","amp;dn":"StudioLine+Photo+Classic+3+Plus+v3.70.51.0+with+Key+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d3b73af01ff9382c7404603eff6926c7e771ae2","infoHashBuffer":{"type":"Buffer","data":[157,59,115,175,1,255,147,130,199,64,70,3,239,246,146,108,126,119,26,226]},"announce":[],"urlList":[]}}