{"title":"Rosa y Negro [DVDSCREENER][Xvid][Spanish]","uid":5562508,"size":748564480,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9eba472adee0343a202e484561f7814f184782e7&amp;dn=Rosa+y+Negro+%5BDVDSCREENER%5D%5BXvid%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Morck22","files":2,"time":1273877275,"description":"\nEstreno en cines el viernes 14 de mayo de 2010\n(253 visitas)\nRose et noir (2009)\n[Rosa y negro en imdb]\nGÃƒÂ©rard Jugnot\ncolor /\n\n100 minutos\n(1h y 40m) / 2.35:1 / Comedia\nFrancia [PelÃƒÂ­cula sin calificar]\nGÃƒÂ©rard Jugnot, Bernard Le Coq, Juan Diego, Assaad Bouab, StÃƒÂ©phane Debac, SaÃƒÂ¯da Jawad, Patrick Haudecoeur, RaphaÃƒÂ«l Boshart, Aixa VillagrÃƒÂ¡n, Javivi, Elodie Frenck, Arthur Jugnot, Philippe Duquesne, Thierry Heckendorn, Hubert Saint-Macary\nEn 1577, Pic Saint Loup, gran modisto venido a menos, recibe una misiÃƒÂ³n diplomÃƒÂ¡tica del rey Enrique III: confeccionarle un traje de ceremonia de inigualable belleza para la boda concertada de uno de sus sobrinos con la hija de un Grande de EspaÃƒÂ±a. AsÃƒÂ­ es como Saint Loup (un tanto afeminado) se pone en camino, rumbo a esa EspaÃƒÂ±a catÃƒÂ³lica integrista que persigue sin tregua a protestantes, moros, judÃƒÂ­os y homosexuales. Pero lo que ignora es que le acompaÃƒÂ±a un protestante, su fiel secretario, dispuesto a llevar escondida entre sus ropajes una bomba con la que vengar a sus correligionarios de la matanza de San BartolomÃƒÂ©. Y con ellos, su &quot;negro&quot; que tendrÃƒÂ¡ que disfrazar de rubio, su perfumista, su &quot;nariz&quot;, un judÃƒÂ­o marrano y su peluquero, una loca perdida. Todas esas personas no gratas llegan a casa del padre de la novia, un loco malvado que resulta ser nada menos que el Gran Inquisidor de Sevilla... Pic Saint Loup, que ha dedicado toda su vida a volver de color de rosa las vidas que no lo eran, se ve arrojado en el mÃƒÂ¡s negro abismo de los enajenados del Dios de la InquisiciÃƒÂ³n. Es lo que se suele llamar meterse en la boca del lobo....\n\nProducida por Europa Corp., Flamenco Films S.A., France 2 CinÃƒÂ©ma, France 3 CinÃƒÂ©ma, Les Films Manuel Munz, Novo Arturo Films. Distribuida en EspaÃƒÂ±a por Alta Films.\n\nTiempo de espera desde el estreno oficial hasta que ha llegado a EspaÃƒÂ±a: 7.1 meses.\n","torrent":{"xt":"urn:btih:9eba472adee0343a202e484561f7814f184782e7","amp;dn":"Rosa+y+Negro+%5BDVDSCREENER%5D%5BXvid%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9eba472adee0343a202e484561f7814f184782e7","infoHashBuffer":{"type":"Buffer","data":[158,186,71,42,222,224,52,58,32,46,72,69,97,247,129,79,24,71,130,231]},"announce":[],"urlList":[]}}