{"title":"Mantis Burn Racing (Early Access)","uid":15259795,"size":4117649125,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a03cde9a9ba5dde845ab280ae351a0fdd89b4322&amp;dn=Mantis+Burn+Racing+%28Early+Access%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dauphong","files":1,"time":1468171050,"description":"\nAbout This Game\r\nThe race is on in Mantis Burn Racing, where fast-paced bumper-to-bumper racing combines with intuitive, tactile gameplay and stunning visuals in one of the best-looking and immersive top-down racers around. Drive incredible built-for-racing vehicles across highly detailed, visually stunning tracks, in high-risk, high-speed races where winning is everything. Prove your skills in an extensive career mode and take on friends with 4 player local split-screen racing and online modes for up to 8 players in ‘one-more-go’ style competitive racing. With in-depth customisation options providing players with deep tactical choices and excellent replay-ability, this is racing at its rawest but most exciting!\r\n\r\nThe race is on!\r\n\r\nFollow us:andVisit: http://www.voofoostudios.com\r\n\r\nFeatures:\r\n\r\n    Comprehensive Career Mode - Test every aspect of your driving ability in a compelling career structure where you choose your progression path on the road to being crowned Mantis Burn Racing Champion.\r\n    Bumper-to-Bumper Racing - Jump the sand dunes of sun-scorched Sand Town or burn rubber on the asphalt city streets of New Shangri-la in high-risk, high-speed but most of all, highly competitive racing.\r\n    Incredible Vehicles – Choose from a roster of fully customisable built-for-racing vehicles in 3 distinct categories, each with their own unique handling and performance traits with speedy dune-buggies, versatile road-racers and super-strong 6-wheeler trucks competing side-by-side in the same race.\r\n    Stunning Visuals – Race across stunning reversible tracks located in 2 distinct environments with incredible photo-realistic visuals for crystal clear high-octane racing.\r\n    Utterly Believable – Enter a world of realistic, but fun, vehicle handling and dynamic destructible environments where tyres screech and barriers fly.\r\n    Deep Upgrade System – Fine tune your vehicle’s appearance, handling and performance to your exact preference and playing style via a deep, tactical upgrade system that offers an almost infinite amount of vehicle variations, creating a unique race experience for every player.\r\n    Challenging Game Modes – Master demanding game modes that keep the extensive solo career fresh and exciting.\r\n    Intense Multiplayer - 4 player local split-screen racing with extensive online modes for up to 8 players allowing players worldwide to race together seamlessly.\r\n    Original Soundtrack – Race to an original ambient-electro soundtrack written especially for the game.\r\n    Regular Updates – Regular content updates during Early Access with add-ons planned post full launch, including free and paid content packs","torrent":{"xt":"urn:btih:a03cde9a9ba5dde845ab280ae351a0fdd89b4322","amp;dn":"Mantis+Burn+Racing+%28Early+Access%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a03cde9a9ba5dde845ab280ae351a0fdd89b4322","infoHashBuffer":{"type":"Buffer","data":[160,60,222,154,155,165,221,232,69,171,40,10,227,81,160,253,216,155,67,34]},"announce":[],"urlList":[]}}