{"title":"Elton John - The Road To El Dorado - (2000)[FLAC-EAC-CUE]","uid":4185746,"size":430863454,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a102041bd37d40c609d8ca9e74696611ba3dd7ca&amp;dn=Elton+John+-+The+Road+To+El+Dorado+-+%282000%29%5BFLAC-EAC-CUE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"seanprince","files":24,"time":1210658204,"description":"Elton John - The Road To El Dorado - (2000)[FLAC-EAC-CUE]\n\nTrack list\n\nElton John - The Road To El Dorado\n\n01.\tEl Dorado\t\t\t\t\t\t04:22\n02.\tSomeday Out Of The Blue (Theme From El Dorado)\t\t04:47\n03.\tWithout Question\t\t\t\t\t04:47\n04.\tFriends Never Say Goodbye\t\t\t\t04:20\n05.\tThe Trail We Blaze\t\t\t\t\t03:53\n06.\t16th Century Man\t\t\t\t\t03:39\n07.\tThe Panic In Me\t\t\t\t\t\t05:40\n08.\tIt\\&amp;#039;s Tough To Be A God (Duet with Randy Newman)\t\t03:49\n09.\tTrust Me\t\t\t\t\t\t04:45\n10.\tMy Heart Dances\t\t\t\t\t\t04:51\n11.\tQueen Of Cities\t\t\t\t\t\t03:56\n12.\tCheldorado\t\t\t\t\t\t04:26\n13.\tThe Brig\t\t\t\t\t\t02:58\n14.\tWonders Of The New World\n\nBiography\tby Stephen Thomas Erlewine\n\nIn terms of sales and lasting popularity, Elton John was the biggest pop superstar of the early \\&amp;#039;70s. Initially marketed as a singer/songwriter, John soon revealed he could craft Beatlesque pop and pound out rockers with equal aplomb. He could dip into soul, disco, and country, as well as classic pop balladry and even progressive rock. His versatility, combined with his effortless melodic skills, dynamic charisma, and flamboyant stage shows, made him the most popular recording artist of the \\&amp;#039;70s. Unlike many pop stars, John was able to sustain his popularity, charting a Top 40 single every single year from 1970 to 1996. During that time, he had temporary slumps in creativity and sales, as he fell out of favor with critics, had fights with his lyricist, Bernie Taupin, and battled various addictions and public scandals. But through it all, John remained a remarkably popular artist, and many of his songs -- including \\&quot;Your Song,\\&quot; \\&quot;Rocket Man,\\&quot; \\&quot;Goodbye Yellow Brick Road,\\&quot; and \\&quot;Don\\&amp;#039;t Let the Sun Go Down on Me\\&quot; -- became contemporary pop standards.\nThe son of a former Royal Air Force trumpeter, John was born Reginald Kenneth Dwight in 1947. Dwight began playing piano at the age of four, and when he was 11, he won a scholarship to the Royal Academy of Music. After studying for six years, he left school with the intention of breaking into the music business. In 1961, he joined his first band, Bluesology, and divided his time between playing with the group, giving solo concerts at a local hotel, and running errands for a London publishing house. By 1965, Bluesology was backing touring American soul and R&amp;B musicians like Major Lance, Doris Troy, and the Bluebells. In 1966, Bluesology became Long John Baldry\\&amp;#039;s supporting band and began touring cabarets throughout England. Dwight became frustrated with Baldry\\&amp;#039;s control of the band and began searching for other groups to join. He failed his lead vocalist auditions for both King Crimson and Gentle Giant before responding to an advertisement by Liberty Records. Though he failed his Liberty audition, he was given a stack of lyrics left with the label courtesy of Bernie Taupin, who had also replied to the ad. Dwight wrote music for Taupin\\&amp;#039;s lyrics and began corresponding with him through mail. By the time the two met six months later, Dwight had changed his name to Elton John, taking his first name from Bluesology saxophonist Elton Dean and his last from John Baldry.\nJohn and Taupin were hired by Dick James to become staff songwriters at his fledgling DJM in 1968. The pair collaborated at a rapid rate, with Taupin submitting batches of lyrics -- he often wrote a song an hour -- every few weeks. John would then write music without changing the words, sometimes completing the songs in under a half-hour. Over the next two years, the duo wrote songs for pop singers like Roger Cook and Lulu. In the meantime, John recorded cover versions of current hits for budget labels to be sold in supermarkets. By the summer of 1968, he had begun recording singles for release under his own name. Usually, these songs were more rock- and radio-oriented than the tunes he and Taupin were giving to other vocalists, yet neither of his early singles for Phillips, \\&quot;I\\&amp;#039;ve Been Loving You Too Long\\&quot; and \\&quot;Lady Samantha,\\&quot; sold well. In June of 1969, he released his debut album for DJM, Empty Sky, which received fair reviews, but no sales.\nFor his second album, John and Taupin hired producer Gus Dudgeon and arranger Paul Buckmaster, who contributed grandiose string charts to Elton John. Released in the summer of 1970, Elton John began to make inroads in America, where it appeared on MCA\\&amp;#039;s Uni subsidiary. In August, he gave his first American concert at the Troubadour in Los Angeles, which received enthusiastic reviews, as well as praise from Quincy Jones and Leon Russell. Throughout the fall, Elton John continued to climb the charts on the strength of the Top Ten single \\&quot;Your Song.\\&quot; John followed it quickly in February 1971 with the concept album Tumbleweed Connection, which received heavy airplay on album-oriented radio in the U.S., helping it climb into the Top Ten. The rapid release of Tumbleweed Connection established a pattern of frequent releases that John maintained throughout his career. In 1971, he released the live 11-17-70 and the Friends soundtrack, before releasing Madman Across the Water late in the year. Madman Across the Water was successful, but John achieved stardom with the follow-up, 1972\\&amp;#039;s Honky Chateau. Recorded with his touring band -- bassist Dee Murray, drummer Nigel Olsson, and guitarist Davey Johnstone -- and featuring the hit singles \\&quot;Rocket Man\\&quot; and \\&quot;Honky Cat,\\&quot; Honky Chateau became his first American number one album, spending five weeks at the top of the charts.\nBetween 1972 and 1976, John and Taupin\\&amp;#039;s hit-making machine was virtually unstoppable. \\&quot;Rocket Man\\&quot; began a four-year streak of 16 Top 20 hits in a row; out of those 16 -- including \\&quot;Crocodile Rock,\\&quot; \\&quot;Daniel,\\&quot; \\&quot;Bennie and the Jets,\\&quot; \\&quot;The Bitch Is Back,\\&quot; and \\&quot;Philadelphia Freedom\\&quot; -- only one, the FM hit \\&quot;Saturday Night\\&amp;#039;s Alright for Fighting,\\&quot; failed to reach the Top Ten. Honky Chateau began a streak of seven consecutive number one albums -- Don\\&amp;#039;t Shoot Me I\\&amp;#039;m Only the Piano Player (1973), Goodbye Yellow Brick Road (1973), Caribou (1974), Greatest Hits (1974), Captain Fantastic and the Brown Dirt Cowboy (1975), Rock of the Westies (1975) -- that all went platinum. John founded Rocket, a record label distributed by MCA, in 1973 in order to sign and produce acts like Neil Sedaka and Kiki Dee. John didn\\&amp;#039;t become a Rocket recording artist himself, choosing to stay with MCA for a record-breaking eight-million-dollar contract in 1974. Later in 1974, he co-wrote John Lennon\\&amp;#039;s number one comeback single \\&quot;Whatever Gets You Through the Night,\\&quot; and he persuaded Lennon to join him on-stage at Madison Square Garden on Thanksgiving Day 1974; it would prove to be Lennon\\&amp;#039;s last live performance. The following year, Captain Fantastic became his first album to enter the American charts at number one. After its release, he revamped his band, which now featured Johnstone, Quaye, Roger Pope, Ray Cooper, and bassist Kenny Passarelli; Rock of the Westies was the first album to feature this lineup.\nThroughout the mid-\\&amp;#039;70s, John\\&amp;#039;s concerts were enormously popular, as were his singles and albums, and he continued to record and perform at a rapid pace until 1976. That year, he revealed in an interview in Rolling Stone that he was bisexual; he would later admit that the confession was a compromise, since he was afraid to reveal that he was homosexual. Many fans reacted negatively to John\\&amp;#039;s bisexuality, and his audience began to shrink somewhat in the late \\&amp;#039;70s. The decline in his record sales was also due to his exhaustion. After 1976, John cut his performance schedule drastically, announcing that he was retiring from live performances in 1977 and started recording only one album a year. His relationship with Taupin became strained following the release of 1976\\&amp;#039;s double album Blue Moves, and the lyricist began working with other musicians. John returned in 1978 with A Single Man, which was written with Gary Osborne; the record produced no Top 20 singles. That year, he returned to live performances, first by jamming at the Live Stiffs package tour, then by launching a comeback tour in 1979 accompanied only by percussionist Ray Cooper. \\&quot;Mama Can\\&amp;#039;t Buy You Love,\\&quot; a song he recorded with Philly soul producer Thom Bell in 1977, returned him to the Top Ten in 1979, but that year\\&amp;#039;s Victim of Love was a commercial disappointment.\nJohn reunited with Taupin for 1980\\&amp;#039;s 21 at 33, which featured the Top Ten single \\&quot;Little Jeannie.\\&quot; Over the next three years, John remained a popular concert artist, but his singles failed to break the Top Ten, even if they reached the Top 40. In 1981, he signed with Geffen Records and his second album, Jump Up!, became a gold album on the strength of \\&quot;Blue Eyes\\&quot; and \\&quot;Empty Garden (Hey Hey Johnny),\\&quot; his tribute to John Lennon. But it was 1983\\&amp;#039;s Too Low for Zero that began his last great streak of hit singles, with the MTV hit \\&quot;I\\&amp;#039;m Still Standing\\&quot; and the Top Ten single \\&quot;I Guess That\\&amp;#039;s Why They Call It the Blues.\\&quot; Throughout the rest of the \\&amp;#039;80s, John\\&amp;#039;s albums would consistently go gold, and they always generated at least one Top 40 single; frequently, they featured Top Ten singles like \\&quot;Sad Songs (Say So Much)\\&quot; (1984), \\&quot;Nikita\\&quot; (1986), \\&quot;Candle in the Wind\\&quot; (1987), and \\&quot;I Don\\&amp;#039;t Want to Go on with You Like That\\&quot; (1988). While his career continued to be successful, his personal life was in turmoil. Since the mid-\\&amp;#039;70s, he had been addicted to cocaine and alcohol, and the situation only worsened during the \\&amp;#039;80s. In a surprise move, he married engineer Renate Blauel in 1984; the couple stayed married for four years, although John later admitted he realized he was homosexual before his marriage. In 1986, he underwent throat surgery while on tour, but even after he successfully recovered, he continued to abuse cocaine and alcohol.\nFollowing a record-breaking five-date stint at Madison Square Garden in 1988, John auctioned off all of his theatrical costumes, thousands of pieces of memorabilia, and his extensive record collection through Sotheby\\&amp;#039;s. The auction was a symbolic turning point. Over the next two years, John battled both his drug addiction and bulimia, undergoing hair replacement surgery at the same time. By 1991, he was sober, and the following year, he established the Elton John AIDS Foundation; he also announced that he would donate all royalties from his single sales to AIDS research.\nIn 1992, John returned to active recording with The One. Peaking at number eight on the U.S. charts and going double platinum, the album became his most successful record since Blue Moves and sparked a career renaissance for John. He and Taupin signed a record-breaking publishing deal with Warner/Chappell Music in 1992 for an estimated 39 million dollars. In 1994, John collaborated with lyricist Tim Rice on songs for Disney\\&amp;#039;s animated feature The Lion King. One of their collaborations, \\&quot;Can You Feel the Love Tonight,\\&quot; won the Academy Award for Best Original Song, as well as the Grammy for Best Male Pop Vocal Performance. John\\&amp;#039;s 1995 album Made in England continued his comeback, peaking at number three on the U.K. charts and number 13 in the U.S.; in America, the album went platinum. The 1997 follow-up, The Big Picture, delivered more of the same well-crafted pop, made the Top Ten, and produced a hit in \\&quot;Something About the Way You Look Tonight.\\&quot; However, its success was overshadowed by John\\&amp;#039;s response to the tragic death of Princess Diana -- he re-recorded \\&quot;Candle in the Wind\\&quot; (originally a eulogy for Marilyn Monroe) as a tribute to his slain friend, with Taupin adapting the lyrics for what was planned as the B-side of \\&quot;Something About the Way You Look Tonight.\\&quot;\nWith the profits earmarked for Diana\\&amp;#039;s favorite charities, and with a debut performance at Diana\\&amp;#039;s funeral, \\&quot;Candle in the Wind 1997\\&quot; became the fastest-selling hit of all time in both Britain and the U.S. upon the single\\&amp;#039;s release, easily debuting at number one on both sides of the Atlantic; with first-week sales of over three million copies in the U.S. alone and 14 weeks in the top spot, it was John\\&amp;#039;s biggest hit ever. For his next project, John reunited with Lion King collaborator Tim Rice to write songs for Disney\\&amp;#039;s Broadway musical adaptation of the story of Aida; an album of their efforts featuring a who\\&amp;#039;s who of contemporary pop musicians was released in early 1999, going gold by the end of the year. In late 2000, John landed a TV special with CBS, performing a selection of his greatest hits at Madison Square Garden; a companion album drawn from those performances, One Night Only, was issued shortly before the special aired. 2001\\&amp;#039;s Songs from the West Coast was a return to form for John, who found critical success for the first time since the \\&amp;#039;80s. However, it wasn\\&amp;#039;t until 2004\\&amp;#039;s popular Peachtree Road album that he managed to match that success commercially. In 2006, John and Taupin released The Captain &amp; the Kid, a sequel to 1975\\&amp;#039;s Captain Fantastic and the Brown Dirt Cowboy. \n\nReview\tby Stephen Thomas Erlewine\n\nGiven that his collaboration with lyricist Tim Rice on the Disney animated film The Lion King was Elton John\\&amp;#039;s most popular and acclaimed work of the \\&amp;#039;90s -- not only topping the charts, but inspiring a Broadway musical -- it made perfect sense for John to find another project for him and Rice. As it turns out, it was another animated film. This time, it was for Dreamworks, the Spielberg-Geffen-Katzenberg studio that competed with Disney\\&amp;#039;s animated division by offering intelligent, distinctive animated alternatives to Disney\\&amp;#039;s occasionally formulaic work. The film John and Rice wrote songs for was The Road to El Dorado, a contemporary Hope-and-Crosby-styled adventure featuring the voices of Kevin Kline and Kevin Branagh. Since it was a fairly straight-ahead story, it didn\\&amp;#039;t really lend itself to music the way The Lion King did. Yes, characters still sang songs within the film itself, but The Lion King\\&amp;#039;s music seemed organic, an outgrowth of setting and character. With an adventure like The Road to El Dorado, the songs don\\&amp;#039;t fit as naturally into the scheme of things. To the credit of John and Rice, they do their very best, crafting a song-score that is, in and odd way, as classicist as the film itself. However, in this case, \\&quot;classicist\\&quot; means a classic Elton John record, not an old-fashioned movie musical. Where The Lion King, with its vague African underpinning, felt as if it was designed for the film itself, the music on The Road to El Dorado never quite evokes the South America of the film. It does hit the right emotional notes for the story, however, with such songs as the fist-pumping, anthemic \\&quot;El Dorado,\\&quot; the rolling narrative \\&quot;The Trail We Blaze,\\&quot; the wonderfully wry, bossa-nova-flavored duet with Randy Newman \\&quot;It\\&amp;#039;s Tough to Be a God,\\&quot; and \\&quot;Someday Out of the Blue (Theme From El Dorado),\\&quot; which feels like the perfect song to play over closing credits. Other moments work well, such as the driving \\&quot;16th Century Man\\&quot; or the lightly trippy \\&quot;Trust Me,\\&quot; but they don\\&amp;#039;t quite feel of piece with a soundtrack, and perhaps that\\&amp;#039;s the problem with The Road to El Dorado -- it feels more like a collection of songs than a soundtrack or song score, sort of like a classic Elton John record, then. That\\&amp;#039;s hardly a bad thing, but it may disappoint listeners looking for The Lion King, Part Two. Well, that\\&amp;#039;s their loss, since even though it\\&amp;#039;s flawed -- a couple of tunes sound a little bit pat -- it\\&amp;#039;s a solid latter-day Elton John record, more enjoyable than many of his official albums of the late \\&amp;#039;80s and \\&amp;#039;90s. Musically, it\\&amp;#039;s varied, the songs are strong, and Rice\\&amp;#039;s lyrics are pretty clever. If it doesn\\&amp;#039;t have the cinematic sweep of The Lion King or thereby its wide popularity, so be it. In many ways, it\\&amp;#039;s a more satisfying work at least for hardcore fans of Elton John. \n\nEnjoy.","torrent":{"xt":"urn:btih:a102041bd37d40c609d8ca9e74696611ba3dd7ca","amp;dn":"Elton+John+-+The+Road+To+El+Dorado+-+%282000%29%5BFLAC-EAC-CUE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a102041bd37d40c609d8ca9e74696611ba3dd7ca","infoHashBuffer":{"type":"Buffer","data":[161,2,4,27,211,125,64,198,9,216,202,158,116,105,102,17,186,61,215,202]},"announce":[],"urlList":[]}}