{"title":"Wedding Album Maker Gold v3.08","uid":5704594,"size":22832765,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:a227374f01b95687fbce3a54e5994f395778045f&amp;dn=Wedding+Album+Maker+Gold+v3.08&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"muryucu","files":2,"time":1279647968,"description":" &lt;a href=&quot;http://www.wedding-album-maker.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.wedding-album-maker.com/&lt;/a&gt;\n \nWedding Album Maker is an easy-to-use software which allows you to create an amazing wedding photo album with background music, Pan&amp;Zoom and transition effects. With Wedding Album Maker, you can quickly and easily produce professional-looking wedding photo slideshow DVD disc and share your love story and excitement of your wedding day on home big screen TV with standard DVD player in the comfort of your living room.\n &quot;Wedding Album Maker Gold is an intuitive way to create custom slideshows and save them in a variety of formats. Although it's not the most sophisticated program we've ever seen, it's easy to use, and is a good choice for users that aren't too picky.&quot; \n\n&quot;The program's interface is very intuitive, allowing us to create our first album in a matter of minutes. The program walks users through the process of selecting photos, adjusting transition effects, adding music, selecting a template and menu, and selecting the proper output format. The interface isn't particularly slick-looking, but it's extremely easy to navigate. The program contained the typical features that one would expect from a slideshow maker, and we especially liked the wide variety of output formats. Users can save their slideshows to DVDs, but also create Flash movies, MPGs, Web albums, and movies ready for upload toor MySpace. The program's built-in Help file is well-written and thorough.&quot;","torrent":{"xt":"urn:btih:a227374f01b95687fbce3a54e5994f395778045f","amp;dn":"Wedding+Album+Maker+Gold+v3.08","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a227374f01b95687fbce3a54e5994f395778045f","infoHashBuffer":{"type":"Buffer","data":[162,39,55,79,1,185,86,135,251,206,58,84,229,153,79,57,87,120,4,95]},"announce":[],"urlList":[]}}