{"title":"A  Valley  Without  Wind  2","uid":8228240,"size":901035112,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a22e6538bf2c7a796b03b705af3effb8e3364594&amp;dn=A++Valley++Without++Wind++2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"esharoth","files":-1,"time":1362665472,"description":"Title: A Valley Without Wind 2\nGenre: action / strategy / platformer\nReleased: 18th February 2013\nDeveloper: Arcen Games\nPublisher: Arcen Games\nDescription:\nA modern take on the 16-bit era, A Valley Without Wind 2 blends a variety of mechanics across multiple genres, seamlessly bringing together the best qualities of old-school platform-shooters and turn-based strategy games. You choose how and where to explore via the world map, how to upgrade your character via mage classes, feats, and perks that you unlock, and how to battle the forces of evil every step of the way.\n\nYour character is a mage who has infiltrated the inner circle of the evil Demonaica, and you now share the power of immortality that he uses to terrorize the land. Using this power against him, it's time to lead an uprising and ultimately bring him and his henchmen back to mortality so that they can be dispatched.\n\nGameplay alternates between two modes that complement each other: brief, tightly-designed platorming segments where your character customization and equipment can be tuned to meet the tactical needs of the current stage, and quick strategic turns on the world map where you order your troops to fight, scavenge, build, recruit, farm, and use special powers. Demonaica and his armies pursue your forces directly on the world map, while his five henchmen have been sent to recapture you in the platforming segments.\n\nYour immortality came at great personal cost, but it makes you the one last hope of saving the world from darkness.\n\nBonus content: soundtrack.\n\nMinimum system requirements: Windows XP/Vista/7, 1.6 GHz CPU, 2 GB RAM, 1 GB HDD space, 32 MB DirectX 9 compatible video card.\n\nHow to play:\n1) Run Valley2Setup-windows.exe and install the game;\n2) Launch the game using main executable or shortcuts.\n\n! Notice\nWhen you run the game for the first time you will be asked to enter a license key. Use avww2_keygen.exe to generate a license key for the game.\n\n! Notice\nWhen updates are available for the game, you will be informed in the main menu. Click on the Found Updates button, then on Download and Install All Updates to update the game.\n\nIf you like the game, BUY it!\n\nwww.arcengames.com/w/index.php/games/valley2-features","torrent":{"xt":"urn:btih:a22e6538bf2c7a796b03b705af3effb8e3364594","amp;dn":"A++Valley++Without++Wind++2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a22e6538bf2c7a796b03b705af3effb8e3364594","infoHashBuffer":{"type":"Buffer","data":[162,46,101,56,191,44,122,121,107,3,183,5,175,62,255,184,227,54,69,148]},"announce":[],"urlList":[]}}