{"title":"Gnomoria v0.8.46","uid":8700303,"size":206368559,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a263aa9482c318db0afe8b4552e2833d584c9323&amp;dn=Gnomoria+v0.8.46&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"aedziex23","files":-1,"time":1374049624,"description":"Gnomoria is a sandbox village management game where you help lead a small group of gnomes, who have set out on their own, to thrive into a bustling kingdom! Anything you see can be broken down and rebuilt elsewhere. Craft items, build structures, set traps and dig deep underground in search of precious resources to help your gnomes survive the harsh lands. Build your kingdom and stockpile wealth to attract wandering gnomads to your cause, but be wary of also attracting enemies! \n\nGnomoria v0.8.46\n\nGeneral\n\n-When deciding what to eat/drink, gnomes account for nourishment value of food/drink along with distance.\n-Added Gameplay option to adjust how much food/drink nourishment effects a gnome's decision.  Moving the slider to 0 will cause gnomes to always pick the closest food/drink.  When multiple options are equidistant, they will choose the best.  Moving the slider to 100 will allow gnomes to travel much farther for the best food/drink. Default is 50.\n-Allow grass to grow up or down 1 level\n-Gnomes no longer try to maintain distance from squad members while training\n\nFixed\n\n-Crash when completing Fill Hole and items are inside the hole.\n-Performance issue with lots of unreachable jobs\n-Sometimes falling down a 1 tile deep hole and immediately moving back out, ie enemies falling down a hatch and immediately teleporting back up to the top\n-Liquids not updating properly when a tile is dug down that has liquid on it\n-Ramps not properly being if trees or constructions were diagonally adjacent. This left invisible ramps causing tiles to not accept constructions, designations, etc.\n-Tinker Benches not respecting assigned worker\n-Being able to replace the floor underneath a sapling\n-Food/drink HUD text not initializing red when a game is loaded with 0 food or drink\n-Displaying a negative amount of gnomads arriving.  Now it correctly displays 0\n\n\nXNA Framework.NET Framework are included in the _CommonRedist Folder. (Install these first.)\n\nYou can help the developer and buy the game on steam here: http://store.steampowered.com/app/224500/\n","torrent":{"xt":"urn:btih:a263aa9482c318db0afe8b4552e2833d584c9323","amp;dn":"Gnomoria+v0.8.46","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a263aa9482c318db0afe8b4552e2833d584c9323","infoHashBuffer":{"type":"Buffer","data":[162,99,170,148,130,195,24,219,10,254,139,69,82,226,131,61,88,76,147,35]},"announce":[],"urlList":[]}}