{"title":"Collectorz.com.Book.Collector.Pro.v8.0.4-TE","uid":7053711,"size":12964961,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a28a643c5c3b3fed3bfe3acecce462241904cb8d&amp;dn=Collectorz.com.Book.Collector.Pro.v8.0.4-TE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"scene4all","files":-1,"time":1330038883,"description":"---------------------------------------------------------------------------------\n                                                                                 \n           SSSSSSSSSSSSSSS       444444444                 AAA                   \n         SS:::::::::::::::S     4::::::::4                A:::A                  \n        S:::::SSSSSS::::::S    4:::::::::4               A:::::A                 \n        S:::::S     SSSSSSS   4::::44::::4              A:::::::A                \n        S:::::S              4::::4 4::::4             A:::::::::A               \n        S:::::S             4::::4  4::::4            A:::::A:::::A              \n         S::::SSSS         4::::4   4::::4           A:::::A A:::::A             \n          SS::::::SSSSS   4::::444444::::444        A:::::A   A:::::A            \n            SSS::::::::SS 4::::::::::::::::4       A:::::A     A:::::A           \n               SSSSSS::::S4444444444:::::444      A:::::AAAAAAAAA:::::A          \n                    S:::::S         4::::4       A:::::::::::::::::::::A         \n                    S:::::S         4::::4      A:::::AAAAAAAAAAAAA:::::A        \n        SSSSSSS     S:::::S         4::::4     A:::::A             A:::::A       \n        S::::::SSSSSS:::::S       44::::::44  A:::::A               A:::::A      \n        S:::::::::::::::SS        4::::::::4 A:::::A                 A:::::A     \n         SSSSSSSSSSSSSSS          4444444444AAAAAAA                   AAAAAAA    \n                                                                                 \n                                                                                 \n---------------------------------------------------------------------------------\n\n                   Collectorz.com.Book.Collector.Pro.v8.0.4-TE                   \n\n---------------------------------------------------------------------------------\n\nTE 2012 PRESENTS\n\nANOTHER FINE RELEASE\n\nRelease: Book Collector Pro v8.0.4 (c) 2012 Collectorz.com\n\nDate: 02/23/2012\n\nCracked By: Twisted EndZ\n\nRelease Type:\n[X] Registration/Serial Crack\n[ ] Activation Crack\n[ ] Trial Crack\n[X] Server Check Crack\n[ ] Serial\n[ ] Hidden/Added Features Enabler\n[ ] Other\n\n[ ] Loader Patcher      [ ] Patch      [X] Precracked      [ ] RegFile\n[ ] Keygen\n\nRELEASE NOTES\n\nCatalog your book collection by ISBN.\nAutomatic book details and cover images.\nJust type author &amp; title or scan ISBN barcodes.\n\nCreate a personal book database on your PC or Mac\n? Just scan ISBN barcodes, or enter author &amp; title to\nauto-download book details &amp; cover art.\n? Catalog files, view stats, print lists, manage loans, export\ndata to XML/CSV, and more...\nCheck your book database and wish list on your iPhone, iPad or\nAndroid device.\n? Export your book list from Book Collector to the CLZ Books\nmobile viewer app.\nPublish your book list online and share it with friends\n? Upload your list to Book Collector Connect and email your\npublic web-link.\n\nCatalog your books by author &amp; title or by ISBN\n? No need to enter book details manually, no need to scan cover\nimages.\n? Just enter the author &amp; title or scan the ISBN barcode.\n? Book Collector will download all book data, including author,\ntitle, publisher, publication date, cover art, etc...\n\n3 ways to add books to your book database:\n1) Type ISBN numbers or Authors &amp; Titles\n2) Scan ISBN barcodes with the CueCat scanner\n3) Scan ISBN barcodes in batch with the OPN-2001\n\nSpeed up your cataloging with one of our barcode scanners:\n? Cuecat Swiping Scanner (TE NOTE: Get yours from EBay &amp;\nModified)\n- Scan by swiping the CueCat's 'nose' across barcodes.\n- For PC &amp; Mac, USB, Plug &amp; Play, no drivers needed.\n? Opticon C37 CCD Scanner\n- Scan barcodes efficiently by pointing a wide CCD\nscanning window from a small distance.\n- For PC &amp; Mac, USB, Plug &amp; Play, no drivers needed.\n\n? Opticon OPN-2001 Laser Scanner with Memory\n- Scan barcodes by pointing a powerful laser beam.\n- Wireless batch scanning, memory for 10,000 barcodes.\n- For PC &amp; Mac, connects &amp; charges via USB.\n- Not compatible with Connect\n\nAbout the Collectorz.com central online book database:\nThe Collectorz.com online book database is the source of all your\nbook information and cover art..\nAccess to this database is free and included with all editions\n(Standard, Pro or Connect).\nThe online database will instantly provide the following\ninformation:\n? ISBN, Author and Title\n? Publisher data and Publication Date\n? Format, Genres, Subjects, Nr of Pages &amp; LoC Classification\n? Cover Images\n? Plot summaries and a lot more\nNo manual data entry. No need to scan your own cover images.\n\nCatalog your eBook and audio book files by scanning folders\n? Scan your folders for digital audios books or eBooks.\n? Add the found books to your database in batch, using either the\nfile name or folder name as the book title, with the book files\nautomatically added under Links.\n? Then use Update Books Automatically to download book\ninformation (like author, title, genre &amp; cover image) from the\nCollectorz.com online database.\n? Or, link the found books to existing entries in your database.\n? Use the Play/Open button in the Details View, or Play/Open\nbutton on the toolbar, to start the audio book or eBook in your\nfavorite software.\n\nCLZ Books mobile app : Check your list while on the road\n- Available for iPhone / iPod touch, iPad and Android for\nÃ‚Â£2.99\nUse CLZ Books to check your collection and wish list on your\nmobile device\n? Just export the data and images from the Windows or Mac edition\n(Standard or Pro)\nBrowse your books with full data and images\n? No need to be online, all data is stored on your device for\nfast browsing\nCurrently available for iPhone / iPod touch, iPad and Android\n\nBook Collector Connect : Share your book database online\nSubscription: Ã‚Â£14.95 per year (optional add-on to Book Collector)\n\nPublish your book database online on Collectorz.com servers\n? Access your book inventory from any online computer or mobile\ndevice.\nShare your book collection list with friends and family\n? Just email them the link to your public collection on the\nConnect website.\nConnect is a fully stand-alone book organizer tool\n? Connect is a cool add-on to the Book Collector downloadable\ndesktop edition for Windows or Mac, but it can also be used on\nits own, as a super-easy online book cataloging tool.\n\nBook Collector Features:\n\nBrowse your home library\n? Browse your book inventory, by Title, Author, Publisher, etc...\n? View your lists in a columnar List View or in the cool Images\nView.\n? Group your books in folders, e.g. by Genre, Author or\nPublisher, or scroll through them as one big list.\n\nAdd books to your library database in 3 easy steps!\nStep 1. Type or scan the book's ISBN\n? Book Collector will use the ISBN to search the Collectorz.com\nbook database.\nStep 2. Select your book from the Search Results\n? When searching by ISBN there often is only one result, so you\njust have to confirm it's the right one.\nStep 3. Click Add to add the book to your database\n? Book Collector will now download all book data, including\nTitle, Author, Publisher, Publication Date, Number of Pages\nand, when available, the cover image.\n? Use the easy-to-use search mode, or add books with the search\nqueue mode.\n\nOr scan the ISBN with a barcode scanner\n? Instead of typing ISBN numbers manually, you can also enter\nthem by scanning the ISBN barcode with a barcode scanner.\n? This will prevent typos and is much faster too.\nTip: try the Opticon laser scanner or the simple Cuecat scanner.\n\nOr catalog books by entering Author and Title\n? Just typing the Author and Title of a book is a simple way to\nadd books to your library database. Especially if you want to\nadd multiple books from the same author.\n\nAvailable Fields\n? Main book information\n- Author\n- Title\n- Publisher\n- Publication Date\n- ISBN\n- Format\n- Genre\n- Subject\n- LoC Classification\n- Dewey\n- etc...\n? More book details\n- Series\n- Volume\n- Edition\n- Printer\n- Paper Type\n- Dimensions\n- Orginal Title\n- Original Language\n- etc...\n? Collection Status\n- Use the Collection Status field to indicate whether an\nalbum is actually in your possession, on your Wishlist,\nOn Order, For Sale.\n- Use the In Collection Status filter menu to quickly\nshow your wishlist, your &quot;on order&quot; items, etc...\n? Personal information\n- Owner\n- Purchase data\n- Value data\n- Rating\n- Location\n- User Defined Fields\n- etc...\n? Characters &amp; Credits\n- Book characters\n- Translator\n- Editor\n- Foreword Author\n- Cover Artist\n- Illustrator, and a lot more...\n? Chapter and Story lists\n- Use the Contents tab page to list the chapters or\nstories\n- For each story, you can list Author, Title, Plot, etc..\n? Website Links, e-books, audio-books and extra images\n- Add links to websites\n- Add links to e-book files\n- Add links to audio book files\n- Add extra images, e.g. author photos, interior art,\netc..\n\nData entry and maintenance tools\n? Built-in Auto Capitalization function, e.g. typing &quot;harry\npotter&quot; will automatically change into &quot;Harry Potter&quot;. The\nAutoCap feature is fully user configurable, including an\nexceptions list.\n? Automatic Sort Title generator makes sure that titles like &quot;The\nGlass Inferno&quot; are sorted correctly.\n? Next/Previous buttons in Edit Book screen let you edit multiple\nmovies in a row, without leaving the edit screen.\n? Use the Edit Multiple feature to modify data for multiple books\nin one go.\n? Rename data fields to suit your needs, several User Defined\nfields are available for this purpose.\n\nSorting and Searching\n? Order your book lists any way you like using the Sort Order\nscreen.\n? Use the Quick Search box to search your entire database for the\noccurrence of a particular text.\n? Save your sort order definitions and activate them directly\nusing the Sort Order menu on the toolbar (PRO edition only).\n? Save your filters and activate them directly using the Filter\nmenu on the toolbar (PRO edition only).\n? Or build advanced filters with the Filter screen, using\nbrackets, AND, OR, NOT, equal, not equal, greater than, less\nthan, &quot;contains&quot; and wildcards (PRO edition only).\n\nView your book details in several cool skins\n? Choose from various included layout templates and styles.\n? Download templates and styles created by other users.\n? Create your own templates and styles using XSL and CSS code.\n? Besides various skins you can also change the whole main screen\nof Book Collector.\n\nDatabase Statistics (PRO edition only)\n? Use the Statistics screen to view all kinds of stats on your\nbook library.\n? Use the graphical view to shows bar graphs per Author,\nPublisher, Genre, Publication Year, etc...\n\nExport to CLZ Books (iPad, iPhone, Android)\n? Export your book collection to your iPad, iPhone / iPod Touch\nand Android, using the Clz Books app.\n? Avoid Duplicate Book Purchases. Show off your book collection.\nHave cool book facts at your fingertips.\n? The Collectorz.com CLZ Books app.\n\nExport to HTML (PRO edition only)\n? Export book lists to HTML format, so that you can view and\nshow your collection on your website.\n? Export book details pages using various layout templates and\nstyles, including all book details and cover images.\n? Check out a sample HTML page here.\n\nExport to the Notes section of your iPod (PRO edition only)\n? Export a list of your books to the iPod Notes system (the whole\nlist or a selection).\n? Take your iPod with you to the store and browse your collection\nright there on the spot, nicely grouped by Author. Now you can\nalways check which books you already own and thus avoid\nduplicate purchases.\n? Read more about exporting to your iPod here\n\nOther Export Options (PRO edition only)\n? Export to List Pro, for using your data on your Palm or\nPocketPC\n? Export to Text (e.g. CSV), for using your data in other\nprograms like Excel\n? Export to XML\n\nLoan Manager (PRO edition only)\n? Track which books you loaned and to whom.\n? Track Loan Date, Due Date and actual Return Date\n? Add extra notes for each loan\n? View all Loaned items, all Overdue items or entire loan history\n\nPrinting\n? Print Simple Lists of your Book Collection.\n? You decide which fields to show as columns and which field(s)\nto sort the list on (PRO edition only).\n? Print one book per page with all details, including cover\nimages (PRO edition only).\n? Print a selection of your book collection, e.g. the result of a\nsearch (PRO edition only).\n\nNetwork Support including Read-Only Mode\n? A lock file system automatically prevents concurrent editing\n? When one user is already using a database in Writable mode,\nsubsequent users will automatically open the database in\nRead-Only mode\n? In Read-Only all editing features are hidden and disabled,\nallowing viewing and searching only\n? Create Read-Only workstations by running a forced Read-Only\ninstallation (start the installer with the /readonly command\nline parameter)\n\nCompatibility\nThe Windows edition of Book Collector is compatible with Windows\n2000, XP, Vista and Windows 7. It is available in the following\nlanguages: English, Dutch, German, French, Hungarian, Greek,\nPolish, Spanish, Italian, Croatian, Portuguese, Indonesian,\nNorwegian.\n\nWhats New in Version 8.0 build 4 (February 8, 2012)\n\nChanges:\n- Add Books Automatically: improved handling of invalid ISBNs.\nBook Collector now detects and reports invalid ISBNs, e.g. when\ninadvertently scanning the UPC or EAN barcode, making a typo,\netc...\n\nFor More Info On Collectorz.com Book Collector Pro Visit: &lt;a href=&quot;\nhttp://www.collectorz.com/book/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.collectorz.com/book/&lt;/a&gt;\n\nTE Release Filename: tcbc804x.zip\n\nINSTALLATION NOTES\n\nInstall bookcollectorsetup.exe.  After installation copy\nprecracked exe from the Crack folder into Book Collector Pro's\ninstalled folder, overwriting the existing file.  You now have a\nfully registered version of Book Collector Pro!\n\n*NOTE TO ALL READ NOW ABOUT TRIAL EXPIRE!:*\n\nGoing to ONCE AGAIN state the obvious because some people can't\nseem to use common sense and nuke a working release because of\ntheir stupidity.  So here we go again and state the obvious in\neach release of any Collectorz.com applications:\n\nWe have for awhile now made searching at Collectorz.com work and\nnot show illegal key, allowing book lookup to work from that\nsource, while another group's crack didn't allow any searching\nthere at all.  Now of course if you add over the 100+ normal\nlimit for Book Collector, and request data well over that limit\nfrom that source in ONE BIG SEARCH, your going to be red flagged\nand the server WILL block your IP and ONLY your IP and say your\ntrial is up (and this is ONLY for retrieval of updates from\nthem).  This again should be quite obvious with server side\nprotection and using a cracked application, but we give you the\noption to still be able to download from them, nobody else could\nbefore (method will not be explained).\n\nWe will state it again clearly, don't search over that limit in\none large update to your database!  Example would be 50 to 75\nback to back automatic searches/updates in one use.  If you do\nhalf of the normal limit (50 searches) and more at a later time,\nyou'll be fine as we have patched the counter inside your\ncollection file.  For people that refuse to listen (like you\nnuker), you have been warned and this version of Collectorz.com\nBook Collector Pro now ONLY uses Collectorz.com as it's source.\n\nChange your IP if you somehow forget this, or wait for the ban to\nbe lifted if you don't listen (YES!! using a FREE PROXY found\neasily with google, allows you once again to search right away,\nshowing you its server side!!  Proxy IP is added within the\nprogram).  You still have ALL the other Pro features anyways.\nBesides, if your using this program to store that many books, its\nabout time you paid for it and made that purchase to support this\ngreat database manager.\n\nThats it!  Enjoy.\n\nT E   2 0 1 2\n\nascii\nby mx\n\nDon't Hate The Hacker,  Hate The Code\n\n---------------------------------------------------------------------------------","torrent":{"xt":"urn:btih:a28a643c5c3b3fed3bfe3acecce462241904cb8d","amp;dn":"Collectorz.com.Book.Collector.Pro.v8.0.4-TE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a28a643c5c3b3fed3bfe3acecce462241904cb8d","infoHashBuffer":{"type":"Buffer","data":[162,138,100,60,92,59,63,237,59,254,58,206,204,228,98,36,25,4,203,141]},"announce":[],"urlList":[]}}