{"title":"Microsoft Dynamics CRM 2011 Administration Bible{BBS}","uid":6708116,"size":18035751,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a2b82c504e449810823d6d9f61a1ac1b6f6daa40&amp;dn=Microsoft+Dynamics+CRM+2011+Administration+Bible%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1317253261,"description":"An in-depth, expert guide to Microsoft Dynamics CRM 2011 from Microsoft CRM experts! What better way to learn how to administer Dynamics CRM than from two Microsoft CRM experts? This in-depth Bible is packed with expert guidance on the latest version of Microsoft's hot CRM product. Whether you're new to Dynamics CRM or upgrading from an earlier version, you'll get thoroughly up to speed on everything from the basics to new features and more.\n\n    *\n      Brings you up to speed on Microsoft Dynamics CRM 2011, the latest version of Microsoft's fast-growing customer relationship management software\n    *\n      Shows you how to get the most out of the application, including configuration and customization, integrating with Microsoft Office, and automating business processes\n    *\n      Features step-by-step instruction and in-depth coverage of all essential topics; you'll want to keep this information-packed book at your desk as a practical reference\n\nIf you want to master Microsoft Dynamics CRM for your business contacts, this is the book you need to succeed!\nFrom the Back Cover\n&quot;Every organization that is using Microsoft Dynamics CRM 2011 needs to have a copy of this book in its library. Geoff and Matt have delivered a book that is useful for anyone from the small business CRM administrator to the enterprise CRM architect.&quot; -- Steve Blazevich, CRM Director, North America Consulting Services, Microsoft\nA solid CRM strategy is smart business--here's how you get there\nBuild customer relationships and CRM strategies that will help grow your business with Microsoft's powerful Dynamics CRM software and this practical book that covers all the bases. You'll learn the nuts and bolts of how to configure the software, automate operations, manage users, and integrate with Office--while you also get the essentials of how to capture customer data, analyze it, engage your customers, and track and report results.\n\n    * Get up to speed on Microsoft Dynamics CRM 2011\n    * Master the user interface, including all toolbars, menus, and activity types\n    * Harness the essential Sales, Marketing, and Service functions you need\n    * Learn to manage leads, accounts, and contacts\n    * Issue quotes, then integrate with ERP systems to create orders and invoices\n    * Customize with visual workflow designer, interactive query builder, or other tools\n    * Create useful reports with Business Intelligence Studio or Visual StudioÃ‚Â®\n\n&quot;Matthew Wittemann and Geoff Ables bring a great resource to the CRM administrator. Their Bible goes into the needed details that give the CRM administrator everything he or she needs to successfully implement and manage a Dynamics CRM 2011 organization. The authors explain both the front and back ends of the CRM story to enable administrators to know and meet their users' needs. A much needed desktop reference!&quot;--Julie Yack, Microsoft CRM MVP and Founder, xRMVirtual\nVisit dynamicscrmbible.com to access code samples, planning tools, sample reports, templates and utilities.\nTrack crucial customer relationships with CRM\nManage your Dynamics CRM 2011 installation\nScale a solution to meet your business needs\nSee all Editorial Reviews\nProduct Details\n\n    * Paperback: 816 pages\n    * Publisher: Wiley; 1 edition (March 1, 2011)\n    * Language: English\n    * ISBN-10: 0470568143\n    * ISBN-13: 978-0470568149","torrent":{"xt":"urn:btih:a2b82c504e449810823d6d9f61a1ac1b6f6daa40","amp;dn":"Microsoft+Dynamics+CRM+2011+Administration+Bible%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2b82c504e449810823d6d9f61a1ac1b6f6daa40","infoHashBuffer":{"type":"Buffer","data":[162,184,44,80,78,68,152,16,130,61,109,159,97,161,172,27,111,109,170,64]},"announce":[],"urlList":[]}}