{"title":"William Wordsworth - 4 - William Squire &amp; Peter Orr","uid":13706900,"size":287803562,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a30ddbbbcbe0c71cfe24510fddea386ac459085b&amp;dn=William+Wordsworth+-+4+-+William+Squire+%26amp%3B+Peter+Orr&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"wordcity","files":175,"time":1456835750,"description":"\n\r\nFair seed-time had my soul, and I grew up\r\nFoster'd alike by beauty and by fear;\r\nMuch favour'd in my birthplace, and no less\r\nIn that beloved Vale to which, erelong,\r\nI was transplanted. Well I call to mind\r\n('Twas at an early age, ere I had seen\r\nNine summers) when upon the mountain slope\r\nThe frost and breath of frosty wind had snapp'd\r\nThe last autumnal crocus, 'twas my joy\r\nTo wander half the night among the Cliffs\r\nAnd the smooth Hollows, where the woodcocks ran\r\nAlong the open turf. In thought and wish\r\nThat time, my shoulder all with springes hung,\r\nI was a fell destroyer. On the heights\r\nScudding away from snare to snare, I plied\r\nMy anxious visitation, hurrying on,\r\nStill hurrying, hurrying onward; moon and stars\r\nWere shining o'er my head; I was alone,\r\nAnd seem'd to be a trouble to the peace\r\nThat was among them. Sometimes it befel\r\nIn these night-wanderings, that a strong desire\r\nO'erpower'd my better reason, and the bird\r\nWhich was the captive of another's toils\r\nBecame my prey; and, when the deed was done\r\nI heard among the solitary hills\r\nLow breathings coming after me, and sounds\r\nOf undistinguishable motion, steps\r\nAlmost as silent as the turf they trod.\r\nNor less in springtime when on southern banks\r\nThe shining sun had from his knot of leaves\r\nDecoy'd the primrose flower, and when the Vales\r\nAnd woods were warm, was I a plunderer then\r\nIn the high places, on the lonesome peaks\r\nWhere'er, among the mountains and the winds,\r\nThe Mother Bird had built her lodge. Though mean\r\nMy object, and inglorious, yet the end\r\nWas not ignoble. Oh! when I have hung\r\nAbove the raven's nest, by knots of grass\r\nAnd half-inch fissures in the slippery rock\r\nBut ill sustain'd, and almost, as it seem'd,\r\nSuspended by the blast which blew amain,\r\nShouldering the naked crag; Oh! at that time,\r\nWhile on the perilous ridge I hung alone,\r\nWith what strange utterance did the loud dry wind\r\nBlow through my ears! the sky seem'd not a sky\r\nOf earth, and with what motion mov'd the clouds!\r\n\r\n\r\n\r\nThe Argo recording from 1965 of selections from The Prelude, with readings by William Squire and Peter Orr, two mainstays of the Marlowe Dramatic Society at Oxford. Kindly seed","torrent":{"xt":"urn:btih:a30ddbbbcbe0c71cfe24510fddea386ac459085b","amp;dn":"William+Wordsworth+-+4+-+William+Squire+%26amp%3B+Peter+Orr","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a30ddbbbcbe0c71cfe24510fddea386ac459085b","infoHashBuffer":{"type":"Buffer","data":[163,13,219,187,203,224,199,28,254,36,81,15,221,234,56,106,196,89,8,91]},"announce":[],"urlList":[]}}