{"title":"Skype V5.9.0.123","uid":7845525,"size":21123072,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a4c455876299f56a7fc9b77c8d30ca1f3bbb2512&amp;dn=Skype+V5.9.0.123&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Jared631","files":-1,"time":1353462001,"description":"Another torrent created, and uploaded, by Jared631!\nI try my best too briny you HIGH quality applications, that have a purpose.\nAs always, these contain no viruses.\n\n&quot;Fuck the Government!&quot;\n\n\n===============================================\n=                Description                  =\n===============================================\n\nSkype is a VoIP application, available in both free and paid versions for Mac OS X and Windows. VoIP, which stands for &quot;voice over Internet protocol,&quot; is a type of technology that refers to any communication taking place over a network, such as the Internet. VoIP can include instant messages, video conferencing and even fax messages sent online instead of through a telephone line. You can use Skype to communicate with friends and family or hold business conferences.\n\n\nSkype Name\n===============================================\n\nRegardless of whether you are using the free or paid version of Skype, you must register for a Skype name. Your Skype name is your identity on Skype and is how people will contact you through the application. To create your Skype name, click the link that appears when you open the application on your computer. Skype gives you the option to fill out your full name, location and other information in your profile so people can find you on Skype.\n\nInstant Messaging\n===============================================\n\nOne of the most basic features of Skype is instant messaging and chat rooms. You can initiate free instant messages to have conversations with multiple contacts online, or invite contacts to join a chat room. Skype allows you to send and receive files to contacts directly through the instant messaging window. Skype even provides a selection of emoticons to express your feelings in your instant message. Emoticons are located in the bottom-right corner of the application window.\n\nAudio and Video Conferencing\n===============================================\n\nSkype offers free audio calls between Skype users and reduced rates on calls from your computer to regular telephone numbers anywhere in the world. To call regular telephone numbers, you must purchase Skype credit, which is available through the application. Skype also provides free one-on-one video conferencing between Skype users. A broadband Internet connection is recommended when using the audio conferencing feature and required to use the video conferencing feature.\n\nSkype Premium and Business\n===============================================\n\nAlthough Skype is available for free download, paid versions of Skype offer extra features. Skype Premium includes group video conferences with up to six contacts and live chat customer support, and is available for Mac and Windows. Skype Premium is available for a monthly subscription of $8.99 or a day pass for $4.99. Skype Business offer a variety of solutions for small businesses, medium business and large enterprises. As of February 2011, Skype Business is only available for Windows.\n\n\nTechnical\n===============================================\nTitle: Skype 5.9.0.123 \nFilename: SkypeSetup_5.9.0.123.msi \nFile size: 20.62MB (20,628 kilobytes) \nRequirements: Windows 2000 / XP / 2003 / Vista / Windows7 / XP64 / Vista64 / Windows7 64 \nLanguages: Multiple languages\n\nTested On\n===============================================\nWindows 7 64-Bit and Windows XP X64, by me.\n\n\n Please make sure too seed, while you can!\n \n","torrent":{"xt":"urn:btih:a4c455876299f56a7fc9b77c8d30ca1f3bbb2512","amp;dn":"Skype+V5.9.0.123","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4c455876299f56a7fc9b77c8d30ca1f3bbb2512","infoHashBuffer":{"type":"Buffer","data":[164,196,85,135,98,153,245,106,127,201,183,124,141,48,202,31,59,187,37,18]},"announce":[],"urlList":[]}}