{"title":"Anita Baker - Giving You the Best That I Got 1988","uid":6512528,"size":238757602,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a6f7a0ebcd9b53b946a66c49f8cef4e269bd8b7d&amp;dn=Anita+Baker+-+Giving+You+the+Best+That+I+Got+1988&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"barber9","files":-1,"time":1309693035,"description":"Anita Baker (born January 26, 1958 in Toledo, Ohio and raised in Detroit, Michigan) is an American R&amp;B and soul jazz singer-songwriter. Baker currently lives in Grosse Pointe, Michigan. To date, Baker has won eight Grammy Awards, and has four platinum albums and two gold albums to her credit.\n\nBaker's third album, Giving You the Best That I Got, was released in October 1988. She worked with Michael J. Powell (from the Detroit soul band Chapter 8), and the album became a critical and commercial success, reaching number one on the Billboard 200 chart and selling five million copies worldwide (including three million in the U.S. alone). It featured such hits as Just Because and the title track, which became Baker's biggest pop hit, reaching number three on the Billboard Hot 100 while topping both the R&amp;B and adult contemporary charts. The album also won three more Grammy awards. (wikipedia)\n\n- - -\n\nAnita Baker - Giving You The Best That I Got 1988\n(Elektra/Asylum Records)\n\nMichael J. Powell - producer\nAnita Baker - lead vocals, executive producer, vocal arrangements\nGerald Albright, Reverend Dave Boruff - sax\nReverend Dave Boruff, Robbie Buchanan, Sonny Burke, George Duke, Vernon D. Fails, Sir    Gant, Bobby Lyle, Patrick Moten, Bruce Nazarian, Peter Schwartz, David Spradley, Gary Taylor, Neal Walker - keyboards, piano, synthesizer\nNathan East - bass\nChuck Findley - trumpet\nDonnie Lyle, Paul Jackson Jr., Kevin Moore, Michael J. Powell - guitars\nOmar Hakim, Joseph Vitarelli, Paulinho Da Costa - drums, percussion\nThe Perri Sisters - Carol Perri, Lori Perri, Darlene Perri, Sharon Perri - background vocals\n\n\n1. Priceless\n2. Lead Me Into Love\n3. Giving You the Best That I Got\n4. Good Love\n5. Rules\n6. Good Enough\n7. Just Because\n8. You Belong To Me\n","torrent":{"xt":"urn:btih:a6f7a0ebcd9b53b946a66c49f8cef4e269bd8b7d","amp;dn":"Anita+Baker+-+Giving+You+the+Best+That+I+Got+1988","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6f7a0ebcd9b53b946a66c49f8cef4e269bd8b7d","infoHashBuffer":{"type":"Buffer","data":[166,247,160,235,205,155,83,185,70,166,108,73,248,206,244,226,105,189,139,125]},"announce":[],"urlList":[]}}