{"title":"Say Goodnight To Insomnia - Gregg D. Jacobs.epub","uid":9362573,"size":412044,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a7f3036f7e3b199ca7fd8631c377775915516d05&amp;dn=Say+Goodnight+To+Insomnia+-+Gregg+D.+Jacobs.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1387349086,"description":"Imagine an insomnia treatment that improves sleep in 100 percent of insomniacs, helps 75 percent of insomniacs become normal sleepers, and allows 90 percent of insomniacs to reduce or eliminate their use of sleeping pills. This treatment is safe, natural, and has no side effects except improved mood, higher energy, increased mind/body control, and better health. No, this is not a new miracle drug. It is Dr. Gregg Jacobs's drug-free program described in Say Good Night to Insomnia.\n\nAt Harvard Medical School's Beth Israel Deaconess Medical Center, Dr. Jacobs has tested and developed a six-week, drug-free program that conquers insomnia in a large majority of patients. The first clinician to offer proof that insomnia can be overcome without drugs, Dr. Jacobs's program provides techniques for: Eliminating sleeping pills Establishing sleep-promoting habits and lifestyle practices Changing negative, stressful thoughts about sleep Implementing relaxation and stress-reduction techniques Enhancing peace of mind and reducing negative emotions","torrent":{"xt":"urn:btih:a7f3036f7e3b199ca7fd8631c377775915516d05","amp;dn":"Say+Goodnight+To+Insomnia+-+Gregg+D.+Jacobs.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7f3036f7e3b199ca7fd8631c377775915516d05","infoHashBuffer":{"type":"Buffer","data":[167,243,3,111,126,59,25,156,167,253,134,49,195,119,119,89,21,81,109,5]},"announce":[],"urlList":[]}}