{"title":"ALL THAT REMAINS STUDIO DISCOGRAPHY [FUDGESOCIETY]","uid":5471637,"size":116040424,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a803bfc59a96b030c571c22af0207f72542f3218&amp;dn=ALL+THAT+REMAINS+STUDIO+DISCOGRAPHY+%5BFUDGESOCIETY%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"FudgeSociety","files":-1,"time":1269918621,"description":"ALL THAT REMAINS DISCOGRAPHY\n:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::\nINCLUDES::::\n\nBehind Silence And Solitude\n-Behind Silence And Solitude\n-From These Wounds\n-Follow\n-Clarity\n-Erase\n-Shading\n-Home To Me\n-One Belief\n:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::\n:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::\nThe Fall Of Ideals\n-This Calling\n-Not Alone\n-It Dwells In Me\n-Not Alone\n-Whispers (I Hear Yours)\n-The Weak Willed\n-Six\n-Become The Catalyst\n-The Air That I Breathe\n-Empty Inside\n-Indictment\n:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::\n:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::\nThis Darkened Heart\n-And Death In My Arms\n-The Deepest Grey\n-Vicious Betrayal\n-I Die In Degrees\n-Focus Shall Not Fail\n-Regret Not\n-Passion\n-For Salvation\n-Tattered On My Sleeve\n-This Darkened Heart\n\nAll That Remains is an American metalcore[1] band from Springfield, Massachusetts which formed in 1998.[2] They have released four studio albums, a live CD/DVD, and have sold over 486,000 albums in the United States\n\nPhil Labonte had been an original founding member as the singer of Shadows Fall and appeared on the cult classic album Somber Eyes to the Sky.[3] After being asked to leave, Phil looked to start a new band and thus formed All That Remains.[3] The band released their debut album, Behind Silence and Solitude on March 26, 2002 through Prosthetic Records.[4] The style of the album differs from the current album, and more prominently contains elements of melodic death metal. It was also the band's only release featuring guitarist Chris Bartlett and bassist Dan Egan.\n\nTheir second album, This Darkened Heart was released on March 23, 2004 through Prosthetic Records. Produced by Killswitch Engage guitarist Adam Dutkiewicz, the album featured better production compared to its predecessor, as well as the use of clean vocals. The three singles that were released from the album are &quot;This Darkened Heart&quot;, &quot;Tattered on My Sleeve&quot; and &quot;The Deepest Gray&quot;.\n\nTheir third album The Fall of Ideals was released on July 11, 2006 through Prosthetic Records. Once again, the album was produced by Adam Dutkiewicz. The album is also considered to be the band's breakthrough release, as it entered the Billboard 200 charts at number 75, selling almost 13,000 copies in its first week.[5] &quot;This Calling&quot; was released as the album's first single. Two music videos were created, with one incorporating footage from Saw III (as it was the lead song from the movie's soundtrack). A music video was made for the album's second single &quot;The Air That I Breathe&quot;. The band was also a part of Ozzfest 2006. The song &quot;Six&quot; is featured in Guitar Hero II. On June 20, 2007, it was announced that The Fall of Ideals had surpassed 100,000 sales in the United States.[6] A music video for the album's third single &quot;Not Alone&quot; was filmed on July 4 and was released on September 10, 2007. In 2007, they played at Wacken Open Air in Wacken, Germany to a great success.[7] On November 30, 2007, All That Remains released a live CD/DVD album titled All That Remains Live.[8]\n\n::REFERENCE WIKIPEDIA::\t\n\n:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::\nFUDGESOCIETY NOTE\n:::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::\nI'm personally not a fan of Live albums, and greatest hits. Because it's honestly redundant. Why have more than what you need unless you're a die hard fan. And if you're a die hard fan of a band, you wouldn't be torrenting their music. You would be supporting and buying, which I still support for every band album I upload. I promote torrenting, seeing if the band is good, then going out and buying the album. In no way do I promote the soul use of my torrents without intent to buy the album. Don't ruin the internet for us, these torrents are just a way to see how a band sounds, and find any missing tracks that you might not have.\n\nThank you and please seed. The support of my torrents, will greatly increase the amount of uploading I do. More seeds, more torrents, more smileys! :D","torrent":{"xt":"urn:btih:a803bfc59a96b030c571c22af0207f72542f3218","amp;dn":"ALL+THAT+REMAINS+STUDIO+DISCOGRAPHY+%5BFUDGESOCIETY%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a803bfc59a96b030c571c22af0207f72542f3218","infoHashBuffer":{"type":"Buffer","data":[168,3,191,197,154,150,176,48,197,113,194,42,240,32,127,114,84,47,50,24]},"announce":[],"urlList":[]}}