{"title":"Herman Brood - Uncut (2006)DVD DOCU (dutch spoken)NLT-Release","uid":5996692,"size":4448282367,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a82a1ffffe7d550b4e3d9a7335ffc0be3ee1a850&amp;dn=Herman+Brood+-+Uncut+%282006%29DVD+DOCU+%28dutch+spoken%29NLT-Release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"linday1","files":-1,"time":1291044489,"description":"Beschrijving\nBegin jaren '90 wisten we het zeker: er moest een film over Herman Brood komen. De man die met zijn albums Street en Shpritsz onze jeugd had gekleurd, was een levende legende geworden.\nIn het spoor van Het Fenomeen gingen we op pad. Veel muziek. Atelierbezoek. Lange nachtdiensten. Met editor Menno Boerema sneden we uit ruim honderd uur materiaal Rock 'n Roll Junkie, een film van 'slechts' anderhalf uur. De stapels restmateriaal lagen jarenlang op stoffige zolders te wachten op een bestemming, een mooie aanleiding. Die is er nu! In november 2006 zou Herman Brood 60 jaar geworden zijn.\n\nDe DVD UNCUT bestaat uit nog eens anderhalf uur materiaal. Rauw, associatief, impressionistisch. Geen opsmuk, geen poging tot storytelling, want de Brood story is genoegzaam bekend.\n\nUNCUT schetst de sfeer waarin Brood en de makers met elkaar optrokken. Melig, opwindend, korzelig, katerig, maar altijd speciaal.\nUNCUT bewijst eens te meer dat Herman Brood een fenomeen was.\nEen legende die helaas niet meer leeft.\nTwaalf auteurs bekeken de unieke DVD. In het boek UNCUT hun reacties, belevenissen en herinneringen.\nMartin Bril, Bart Chabot, Jan Eilander, Paul Evers, Dany Lademacher, Ton van der Lee, Arjan Peters, Menno Pot, Jan Rot, John Schoorl, Hans Waterman en Joost Zwagerman. \n\nHerman Brood op 11 juni 2001 op 54-jarige leeftijd door zelfmoord is overleden.\n\nVolgens HMG text is de zanger en schilder van het dak van het Amsterdamse Hilton Hotel gesprongen. Op zijn lichaam is een brief gevonden, waarin hij meldt 'er geen zin meer in' te hebben. &quot;Maak er een mooi feest van, misschien zie ik jullie nog eens.&quot; aldus de brief.\n\n\nIMDB: &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1001357/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1001357/&lt;/a&gt;\n\nThis documentary was made with the huge amount of material that was left over after the montage of 'Rock 'n Roll Junkie (1994)'. It is uncut and unpolished: Herman Brood at his most honest, walking through his hometown, working in his atelier, in the studio and during interviews\n\nHerman Brood killed himself he jumped of the HiltonHotel in Amsterdam. They found a letter on his body what say. He,s just didn,t care anymore. Make a great party on my funeral and i see you again.\n\nYoutubeTrailer: &lt;a href=&quot;\nhttp://www.youtube.com/watch?v=7mEjmWnihrc&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.youtube.com/watch?v=7mEjmWnihrc&lt;/a&gt;\n\n\nUniek hashcode voor deze torrent:\nA82A1FFFFE7D550B4E3D9A7335FFC0BE3EE1A850\n\nVoor de nieuwste films en muziek ga je naar NLT.Ons-Forum het forum voor de Nederlands Ondertitelde Torrents:\n &lt;a href=&quot;\nhttp://www.nlt.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nlt.ons-forum.nl&lt;/a&gt;\n\nBy Linday\n\nIk upload voor jullie en mijn plezier dus ik zou het leuk vinden als je eens een berichtje achterliet.\n\n","torrent":{"xt":"urn:btih:a82a1ffffe7d550b4e3d9a7335ffc0be3ee1a850","amp;dn":"Herman+Brood+-+Uncut+%282006%29DVD+DOCU+%28dutch+spoken%29NLT-Release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a82a1ffffe7d550b4e3d9a7335ffc0be3ee1a850","infoHashBuffer":{"type":"Buffer","data":[168,42,31,255,254,125,85,11,78,61,154,115,53,255,192,190,62,225,168,80]},"announce":[],"urlList":[]}}