{"title":"Robinson Crusoe of Clipper Island (1936) Xvid - Theatrical Seria","uid":9240722,"size":1846294528,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a8a2f3c715e3eef57d5afc68f0f41f87e8057a90&amp;dn=Robinson+Crusoe+of+Clipper+Island+%281936%29+Xvid+-+Theatrical+Seria&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SaM","files":-1,"time":1385268644,"description":"Robinson Crusoe of Clipper Island (1936) Xvid - Theatrical Serial - 14 Chapters [DDR]\n\nRobinson Crusoe of Clipper Island (1936) is a Republic Movie serial starring Ray Mala. \nIt was the fourth of the sixty-six serials produced by Republic and the last (of four) to be released in 1936. \nRobinson Crusoe of Clipper Island is notable for being the first Republic serial to contain another common aspect of serials - a Re-Cap Chapter, similar to a clipshow in modern television where the events of the previous chapters are repeated via clips (in order to save money). \nThis, contrary to popular belief was not the invention of the concept, which had been routinely used in serial production before the release of this serial. \nThe serial was edited into the film Robinson Crusoe of Mystery Island, which was released in 1966.\n\n    CAST:-\n    Ray Mala as Mala, operative of the United States Intelligence Department undercover as a Pacific Dirigible Airlines radio operator. Mala was a rare non-Caucasian hero in serials.\n    Rex the Wonder Horse\n    Buck the Dog\n    Mamo Clark as Princess Melani, Princess and ruler of the Komatoans\n    Herbert Rawlinson as Grant Jackson\n    William Newell as Hank McGlaurie, Agent Mala's partner\n    John Ward as Anthony Tupper, English Novelist accompanying Agent Mala\n    John Dilson as E. G. Ellsworth, joint owner of Pacific Dirigible Airlines with Canfield\n    Selmer Jackson as Canfield, joint owner of Pacific Dirigible Airlines with E. G. Ellsworth\n\n    Directed by Ray Taylor, Mack V. Wright\n    Produced by Nat Levine, Sol C. Siegel\n    Written by Morgan Cox, Maurice Geraghty, Barry Shipman\n   \n    CHAPTERS:- \n    01. The Mysterious Island \n    02. Flaming Danger\n    03. Fathoms Below \n    04. Into the Enemy's Camp \n    05. Danger in the Air \n    06. The God of the Volcano \n    07. Trail's End \n    08. The Jaws of the Beast \n    09. The Cave of the Winds \n    10. Wings of Fury \n    11. Agents of Disaster - Re-Cap Chapter\n    12. The Sea Trap \n    13. Mutiny \n    14.Thunder Mountain \n\n    CLIFFHANGERS:- Many of the solutions to these cliffhangers are &quot;cheats&quot; - they change or obviously do not match the events shown in the preceding cliffhanger.\n    01. The burning mainmast of the Tuloa falls on Mala.\n    02. Mala is captured by natives and forced to fall into a volcano.\n    03. While diving, and with the ship above being shelled by a submarine, Mala \n             begins to suffocate.\n    04. Mala and Lamar are caught in the explosion of an overheated boiler.\n    05. The plane carrying Mala crashes into the Pacific Ocean.\n    06. Mala and Melani are caught in a landslide caused by an earthquake.\n    07. While escaping from aggressive natives, Mala and Melani slip off a cliff.\n    08. With his vine cut, Mala falls into Alligator infested water.\n    09. While scaling a cliff, Mala is shot at and falls.\n    10. Struggling with the pilot of a biplane causes it to crash into the Pacific \n    11. Mala's car is forced off the road and over an embankment.\n    12. Mala and Melani, escaping in a motorboat, are shot at by a cannon.\n    13. Mala is caught by gas aboard an Airship, which begins to crash.\n  \nRobinson Crusoe of Clipper Island was budgeted at $106,779 although the final negative cost was $111,848 (a $5,069, or 4.7%, overspend). \nIt was filmed between 31 August and 25 September 1936 under the working title Robinson Crusoe. \nThe serial's production number was 419. This serial has very little to do with Robinson Crusoe.\n\nA 14-episode serial in which Mala, a Polynesian in the employ of U.S. Intelligence investigates sabotage on Clipper Island. A gang of spies causes the eruption of a volcano, for which our hero is blamed. He convinces the local Princess Melani of his innocence and helps her ward off a takeover by rival high priest Porotu. \n\nTECHNICAL SPECIFICATIONS\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 855 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nRunTime 3:50:00\nSubtitles: None\nRipped by: Trinidad [DDR]\nDuration: 3:50:00","torrent":{"xt":"urn:btih:a8a2f3c715e3eef57d5afc68f0f41f87e8057a90","amp;dn":"Robinson+Crusoe+of+Clipper+Island+%281936%29+Xvid+-+Theatrical+Seria","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8a2f3c715e3eef57d5afc68f0f41f87e8057a90","infoHashBuffer":{"type":"Buffer","data":[168,162,243,199,21,227,238,245,125,90,252,104,240,244,31,135,232,5,122,144]},"announce":[],"urlList":[]}}