{"title":"Airfix Dogfighter v1.20 [Multi4] Full Rip","uid":3973772,"size":84766620,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a8aee90b762b53a2dc7ca366771977a778026fcb&amp;dn=Airfix+Dogfighter+v1.20+%5BMulti4%5D+Full+Rip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ADHDerby","files":2,"time":1200149774,"description":"Airfix Dogfighter is a 3rd person action game, where you fly model-kit airplanes from WWII. You will start from your base and be assigned missions around the house, where you will have to pick up several different objects to enhance your airplanes power of destruction. Some objects will enhance your technology level, which in its turn gives you better firepower, while some objects are bombs and special weapons.\n\nThere are three different camera angles to choose from, which will help you in gameplay. If you have been assigned the task to bomb a certain target, you might want to use the BombCam, which gives you a perfect view of your target as well as the destruction that follows. You can play multiplayer games via LAN or the Internet with up to eight players in dogfight games.\n\nAirfix Dogfighter is a fun, simple and action based flight simulator with model aeroplanes. The scenery is a large house where all of the family has gone away, all but you. You take the roll of prank loving, imaginative, &quot;Home Alone&quot; kind of kid, roaming around with your self-made aeroplane, pretending to be a fighter pilot of the World War II. As the reality changes into &quot;true&quot; scenarios the house and it's interior comes alive, giving opportunity for inspiring battlegrounds and action packed mission such as dogfights, bomb raids and furious multiplayer games. \n\nPublisher: Paradox Entertainment\n\nReleased: Oct 2000\n\nLanguages: EN/FR/GE/IT\n\nRipped: CD-Audio\n\nInstall: Unpack (compressed with 7-Zip - www.7-zip.org - free) to any location and run Dogfighter.exe to start the game\n\n\nADHDerby","torrent":{"xt":"urn:btih:a8aee90b762b53a2dc7ca366771977a778026fcb","amp;dn":"Airfix+Dogfighter+v1.20+%5BMulti4%5D+Full+Rip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8aee90b762b53a2dc7ca366771977a778026fcb","infoHashBuffer":{"type":"Buffer","data":[168,174,233,11,118,43,83,162,220,124,163,102,119,25,119,167,120,2,111,203]},"announce":[],"urlList":[]}}