{"title":"SoundWire v1.8.7 apk by CSK070","uid":9145741,"size":1252347,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:a935ab1059a029d5f0cb89f7ff287104a7c6dfde&amp;dn=SoundWire+v1.8.7+apk+by+CSK070&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"csk070","files":1,"time":1383590121,"description":"INFO:-\n\nGET MY ALL TORRENT FIRST:-\n                 \n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.georgie.SoundWire&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.georgie.SoundWire&lt;/a&gt;\n\nDESCRIPTION:-\nSoundWire lets you send any music or audio (&quot;what you hear now&quot;) from your Windows or Linux PC to your Android mobile devices. Use it as:\n- A wireless extension of your PC-based music system\n- A remote speaker or wireless headphones\n- A way to listen to music and movies from your computer anywhere in your house or out on your deck.\nThe full version of SoundWire enables unlimited Opus audio compression, can handle up to 10 connections at the same time, and has no ads or interruptions. It also has a special Pro Mode to set and display buffer latency precisely in milliseconds. You can use any music player on your PC or laptop like Grooveshark, Spotify, YouTube, or iTunes and feed the live sound directly to your Android device. SoundWire lets you listen to the free versions of Grooveshark and Spotify on your phone.\nSoundWire has low latency (audio delay), which means it can even be used to listen to the soundtrack of a movie or YouTube video while you watch (**Note you must adjust the buffer size in app settings for low latency). There are other uses too... SoundWire can work as a baby monitor or listening device with a computer such as a netbook that has a built-in microphone. Hook up turntables to your computer's line input and stream a live DJ set to another part of the house over WiFi, or anywhere else over 3G/4G.\nFeatures\n- Live audio capture and streaming to multiple clients\n- Excellent sound quality (44.1 / 48 kHz stereo 16-bit, PCM or Opus compression)\n- True low latency (unlike AirPlay, Airfoil)\n- Easy to use\n- Compression option greatly reduces network usage\n- Stream music from PC to PC running x86 virtualized app (Linux/Windows)\n- Save everything you hear to a file (MP3 or WAV)\nBefore using SoundWire on your Android device you must install and run the SoundWire Server application on the Windows/Linux PC or laptop which is your source of music, web audio streaming, or other sounds. Download the server at http://georgielabs.net\nFor more information see the getting started guide at http://georgielabs.net/SoundWireHelp.html\nIf you have any problems please see the troubleshooting tips at the above link. For example if you get choppy audio try restarting your wireless router, then try the other troubleshooting suggestions in the guide. If you get a message saying the app is not licensed and this message is incorrect then please check your internet connection and try again.\nYou may want to use a remote control app together with SoundWire. Some good choices include: Grooveshark Remote, Spotimote (Spotify remote), Remote for iTunes, Android VNC, Unified Remote.\nPlease rate the app and comment on Google Play to let us know what you think of SoundWire. If you have a question or bug report send email to &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;85f6eaf0ebe1f2ecf7e0c5e2e0eaf7e2ece0e9e4e7f6abebe0f1ab&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt; If reporting a problem please give your phone's Android version and make/model. Check the server download page http://georgielabs.net occasionally for updates.\nPermissions\n- Network communication: Communicates with the server program on your PC.\n- Phone calls: Mutes audio when you receive or make a call. Without this permission music would continue to play, interfering with your call.\n- Prevent phone from sleeping: Keeps app running while connected (playing music) or attempting to connect. May be disabled in settings.\n\nRequires Android\n2.1 and up\n\nINSTALLATION INSTRUCTION:-\nDOWNLOAD THE APP\nINSTALL &amp; DONE.\nTorrent is working checked on MMX CANVAS-2 &amp; LG OPTIMUS NET\n\n\nPlease Seed After Download...!!\n\n\nPlease comment ! Thanks !","torrent":{"xt":"urn:btih:a935ab1059a029d5f0cb89f7ff287104a7c6dfde","amp;dn":"SoundWire+v1.8.7+apk+by+CSK070","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a935ab1059a029d5f0cb89f7ff287104a7c6dfde","infoHashBuffer":{"type":"Buffer","data":[169,53,171,16,89,160,41,213,240,203,137,247,255,40,113,4,167,198,223,222]},"announce":[],"urlList":[]}}