{"title":"Windows 7 Live CD en EspaÃƒÂ±ol (Teclado-Americano) con WinPE","uid":5441423,"size":672413696,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:aabde965482d056ee2cfefe826db2ca10a10e13b&amp;dn=Windows+7+Live+CD+en+Espa%C3%83%C2%B1ol+%28Teclado-Americano%29+con+WinPE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rocketero","files":-1,"time":1268894360,"description":"En este torrent el teclado es Americano. O si no tienen inconveniente usando un teclado americano pueden proceder.\n\nSi desean el Teclado en EspaÃƒÂ±ol favor usar el siguiente torrent:\n  &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/5443836&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/5443836&lt;/a&gt;\n\n\nSon casi identicos excepto por teclado.\n\nACTUALIZACION:\nHe encontrado una utilidad que es PORTABLE osea se puede correr desde cualquier lugar sin necesidad de instalarlo, y es una aplicacion que cambia el idioma del teclado y la vez los simbolos, que para este torrent es lo adecuado.\nEn el siguiente vinculo, vayan a la parte inferior donde dice: SAVE FILE TO YOUR PC: CLICK HERE.\n\nhttp : // jump . fm / BKSVX\n\nquitar los 7 espacios para formar el vinculo\n\nUna vez la descarguen la pueden colocar en cualquier parte del disco, y una vez inicien Win7RescatePE solo es buscar donde la colocaron y correr la aplicacion que se llama: KEYBOARDLAYOUTCHANGER.EXE\n\n============================================================\n\nFavor de compartir (Seed) este torrent despues de bajarlo. He compartido mas de 80GB y a veces no hay mas que 3 personas compartiendo. Ayuden a propagar este torrent si les ha sido de alguna utilidad. Gracias.\n\nWindows 7 Live CD el Systema Operativo es el EspaÃƒÂ±ol y es Basado en el ambiente WinPE gratuito de Microsoft. (Win7Rescate_EspaÃƒÂ±ol.ISO)\n\nLas applicaciones que se instalaron la mayoria son en Ingles pero tambien hay algunas en EspaÃƒÂ±ol y son gratuitas.\n\n\n\nCaracteristicas:\n\nEste es un CD de ReInicio (Despues de haber quemado el ISO y configurar la maquina para que inicie desde el CD/DVD)\n\nLa Resolucion es de 1024x768 (Se puede cambiar despues de Iniciar con MultiRes.exe)\n\nEs basado en WinPE (Windows PreInstallation Environment - Ambiente Preinstalacion de Windows) que es Gratuito.\n\nEntre las aplicaciones instaladas estan: De Graficos, Quemadores CD/DVD, Buscadores, Exploradores de Internet (si les ha funcionado la red), Explorador de Archivos, Administrador de Discos, Administrador de Dispositivos, Escaneadores de Virus, Acceso Remote de Equipos, etc.\n\nPara cambiar la resolucion del monitor usen la aplicacion MULTIRES que al darle doble-click aparentemente no hace nada, pero se instala en los icons de rapido accesso (en la parte inferior-derecha se entra con la flecha hacia arriba).\n\nOtro metodo paracambiar la resolucion atraves de MSDOS pueden usar el siguiente formato:\nabrir una ventana de MSDOS dando click en INICIO --&gt; Ejecutar --&gt; CMD\nEscribir el siguiente comando (quitar las comillas):\n\n&quot;D:\\Programs\\MultiRes\\MultiRes.exe /1:1280,1024,32&quot;\n\nDonde: D: el la letra del CD, 1: es el monitor#1 (mayoria de los casos), 1280 es la resolucion horizontal, 1024 la vertical y 32 es el numero de bits (16 o 32 generalmente). Pueden usar otras resoluciones las cuales son aceptadas por sus monitores.\n\nLo mas critico de ese LiveCD es talves la parte de acceso a la RED. El CD contiene controladores para la mayoria o las mas comunes tarjetas de red, y si no le funciona la RED despues de iniciarlo a lo mejor uds puden agregar los controladores uds mismos editando el archivo ISO con UltraISO, PowerISO, MagicISO o algun otro programa. los pude agregar en la carpeta DRIVERS ya que el CD aun tiene 7,5 MB de espacio.\n\nOtro punto importante es cuando se este iniciando y aparece la aplicacion PENetwork y al terminar la ventana se queda en frente, en ese momento hay que darle click al boton OK para que se termine de ejecutar el inicio completamente y asi aparezcan los icons de aplicaciones en el escritorio.\n\nCualquier comentario de si les funciono por favor indiquenlo  aqui para ir sabiendo que tipo de maquinas soporta/no-soporta.\n\nAntes de Quemar el ISO en un CD puede ensayarlo en Vmware, VirtualBox o Qemu.\n\nEl Systema Operativo es funcional pero no esperen tener accesso a todas las funciones ya que en 650 MB solo se puede obtener las funciones basicas como acceso al Administrador de Equips, Administrador de Dispositivos, Administrador de Discos y acceso a Servicios.\n\nSi tienen un Disco USB (1GB) a lo mejor puedan descomprimir el archivo ISO al USB formateado como NTFS usando por ejemplo UltrISO o PowerISO y asi de esa forma poder Iniciar Windows7 Rescate PE desde un disco USB. Personalmente he instalado el Windows 7 completo (No este de rescate) a USB y ha funcinado.\n\nrocketero","torrent":{"xt":"urn:btih:aabde965482d056ee2cfefe826db2ca10a10e13b","amp;dn":"Windows+7+Live+CD+en+Espa%C3%83%C2%B1ol+%28Teclado-Americano%29+con+WinPE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aabde965482d056ee2cfefe826db2ca10a10e13b","infoHashBuffer":{"type":"Buffer","data":[170,189,233,101,72,45,5,110,226,207,239,232,38,219,44,161,10,16,225,59]},"announce":[],"urlList":[]}}