{"title":"Modest Mouse - Strangers to Ourselves [24bit FLAC] HD Tracks","uid":11945878,"size":1240556435,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ab6ee22f73e46c97e2185ff7a99ee1c03108b693&amp;dn=Modest+Mouse+-+Strangers+to+Ourselves+%5B24bit+FLAC%5D+HD+Tracks&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":16,"time":1432077410,"description":"\n  Modest Mouse - Strangers to Ourselves [24bit FLAC] HD Tracks\n \n  Genre: Rock\n  Source: HD Tracks\n  Codec: FLAC\n  Bit rate:  2,700 kbps\n  Bit depth: 24\n  Sample rate: 88.1 kHz\n\n  01 Strangers to Ourselves\n  02 Lampshades on Fire\n  03 Shit in Your Cut\n  04 Pistol (A. Cunanan, Miami, FL. 1996)\n  05 Ansel\n  06 The Ground Walks, With Time in a Box\n  07 Coyotes\n  08 Pups to Dust\n  09 Sugar Boats\n  10 Wicked Campaign\n  11 Be Brave\n  12 God Is an Indian and You're an Asshole\n  13 The Tortoise and the Tourist\n  14 The Best Room\n  15 Of Course We Know\n\n  Review by Stephen Thomas Erlewine \n\n  Perhaps the success of &quot;Float On&quot; discombobulated Isaac Brock even more than we suspected. Surely, there were signs of aimlessness on We Were Dead Before the Ship Even Sank, the 2007 sequel to the surprise 2004 smash Good News for People Who Love Bad News, a record where hired gun Johnny Marr was brought aboard to give the band a jolt. This booster shot wore off quickly and Brock receded from the spotlight, sitting out the better part of a decade before re-emerging with Strangers to Ourselves in the spring of 2015. In the interim, he shed longterm collaborator Eric Judy -- he left sometime around 2012, replaced by Russell Higbee -- added guitarist Jim Fairchild and auxiliary player Lisa Molinaro, attempted to record an album with Big Boi, toyed with bringing Krist Novoselic aboard, then finally decided to get back to where he once belonged. Brock's return to roots is naturally a roundabout of detours, a record that bounces between stylized eccentricity and streamlined strangeness, stopping occasionally to soak in a scenic, dreamy view. Strangers to Ourselves starts at this hazy point, swooning with a narcotic sway that recalls peak Mercury Rev, but it's not long before Modest Mouse begins bouncing at a syncopation that recalls &quot;Float On,&quot; just one of many deliberate references to the ghosts of alt-rock past haunting Strangers to Ourselves. &quot;Pistol&quot; skeeves out like a disco-fied outtake from Ween's Pure Guava, the carnivalesque &quot;Sugar Boats&quot; lurches forward on a circus piano reminiscent of Blur, &quot;The Best Room&quot; circles around a guitar riff that echoes Space Ghost Coast to Coast, each a signal that Brock is comfortable keeping the dream of the '90s. The trick is, he now has the skill of a consummate craftsman, so the raggedness here comes across as deliberate, probably because the moments that are less consciously quirky -- i.e., the bulk of the album -- are so skillfully constructed. So, Strangers to Ourselves is an album where the trees matter more than the forest: song for song, it demonstrates the exacting nature of Brock but put it all together, it sprawls","torrent":{"xt":"urn:btih:ab6ee22f73e46c97e2185ff7a99ee1c03108b693","amp;dn":"Modest+Mouse+-+Strangers+to+Ourselves+%5B24bit+FLAC%5D+HD+Tracks","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab6ee22f73e46c97e2185ff7a99ee1c03108b693","infoHashBuffer":{"type":"Buffer","data":[171,110,226,47,115,228,108,151,226,24,95,247,169,158,225,192,49,8,182,147]},"announce":[],"urlList":[]}}