{"title":"Alex Jones Show - 2012 Jan 29 SU [sebaygo1]","uid":6996366,"size":42614792,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:ac096643e6a2a810b88c5bd62a20fe5f3401e07d&amp;dn=Alex+Jones+Show+-+2012+Jan+29+SU+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sebaygo1","files":6,"time":1327897534,"description":".\n\t\t\t\t\t\t\t\nThe Alex Jones Show\nSunday, 29 January 2012\n\n\n[sebaygo1]\n\n\nThe 2 hour Sunday show is typically a review of the past week's news and a look forward to the coming week's events.\n\nThe Infowars web site describes today's broadcast as follows.\n\nToday on this live Sunday, January 29 edition of the Alex Jones Show, Alex takes on the full spectrum of attacks facing society. From new wars, a domestic clampdown, the on-going economic crisis and the bombardment of food, water and environment with dangerous chemical compounds, humanity is under attack. Alex also talks about a proposed New Jersey ban on ammunition, a de facto circumvention of the Bill of Rights' guarantee to the right to bear arms. The Transportation Security Administration's (TSA) culture of lying is also in focus, with the recent release of Infowars' viral video TSA: The Greatest Liars on Earth. In other news, police fire tear gas and rubber bullets on Occupy Oakland protesters while the former Federal Reserve boss Herman Cain seeks to deliver his Tea Party supporters to the Newt Gingrich presidential campaign. The ACTA bill, like the SOPA and PIPA acts, threaten the future of Internet freedom.\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n..........\n\nfolder.jpg courtesy of commenter &quot;Nighted&quot; at the sebaygo1 blog\n..........\n","torrent":{"xt":"urn:btih:ac096643e6a2a810b88c5bd62a20fe5f3401e07d","amp;dn":"Alex+Jones+Show+-+2012+Jan+29+SU+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac096643e6a2a810b88c5bd62a20fe5f3401e07d","infoHashBuffer":{"type":"Buffer","data":[172,9,102,67,230,162,168,16,184,140,91,214,42,32,254,95,52,1,224,125]},"announce":[],"urlList":[]}}