{"title":"Extreme Thumbnail Generator v1.19.4.0 GOTD","uid":15419789,"size":5398284,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:acce7c9cd7ab8b49784c94ac25f2294ce51652da&amp;dn=Extreme+Thumbnail+Generator+v1.19.4.0+GOTD&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LxByte","files":1,"time":1469623689,"description":"Extreme Thumbnail Generator v1.19.4.0 GOTD\r\n\r\nDo you have a lot of photos you want to share with your friends and family? Are you a professional photographer and want to sell your photos from your website? Maybe you need a photo gallery for your online store? Then we have a perfect tool for you!\r\n\r\nExtreme Thumbnail Generator is a powerful, yet easy to use HTML photo gallery software. It will let you make beautiful web photo album with just a few mouse clicks! Even if you know nothing about the HTML and image processing - the result will be outstanding!\r\n\r\nOn the other hand, you have the full control over the look and feel of your pages - all gallery templates are plain HTML files, so you can easily customize them using the built-in template editor or your favorite HTML editor. When your gallery is ready you can immediately upload it to your website using the built-in FTP publisher module.\r\n\r\nFeatures\r\nVery easy to use - it will take you less than 5 minutes to create your first HTML photo gallery. And you do not have to learn neither HTML or CSS!\r\n\r\nPowerful - all popular image formats are supported (jpg, png, gif, bmp and others). You can use EXIF tags in the page or image titles or print them on your images, create beautiful galleries with modern Lightbox effect or slide show.\r\n\r\nFlexible - all galleries are fully customizable and you can easily save the customized gallery template for later use. Gallery templates are plain HTML files.\r\n\r\nImmediately available - download and install now and publish your first gallery right away! The trial version does not add any unwanted text to the generated images or HTML pages.\r\n\r\nOfficial Website: http://www.exisoftware.com/thumbnail_generator/index.html","torrent":{"xt":"urn:btih:acce7c9cd7ab8b49784c94ac25f2294ce51652da","amp;dn":"Extreme+Thumbnail+Generator+v1.19.4.0+GOTD","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"acce7c9cd7ab8b49784c94ac25f2294ce51652da","infoHashBuffer":{"type":"Buffer","data":[172,206,124,156,215,171,139,73,120,76,148,172,37,242,41,76,229,22,82,218]},"announce":[],"urlList":[]}}