{"title":"Lee Perry And Friends - Disco Devil - The Jamaican Discomixes","uid":9039247,"size":727926515,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ae39beccc47f4cbcca7e80ddb5c00693b36a07ec&amp;dn=Lee+Perry+And+Friends+-+Disco+Devil+-+The+Jamaican+Discomixes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TUFF_GONG","files":-1,"time":1381537426,"description":" &lt;a href=&quot;http://veryrare.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://veryrare.org&lt;/a&gt;\n\nFrom the superb Other Music website:\n\n&quot;Trojan had the amazing idea of compiling a two-disc set of Perry's disco mixes from the late seventies, most originally released in 1977. Oh man, I love this material, probably my favorite year in Perry's discography; by '77, the Black Ark was fully functional (and still a year or so from being burned to the ground), and Perry had perfected his dripping and moist sound technique. And while acetates and dub plates had been used by Jamaican sound systems since the 1950s, in the mid-'70s the extended-play 12&quot; format was becoming a prime tool for producers and sound systems to test out and break new tracks, and Perry took to this format with much love. For years, most Jamaican singles would come in different versions: a vocal, instrumental, dub, and possibly a re-voicing or &quot;DJ&quot; version (which was essentially the Jamaican term for a toaster i.e. rapper). Typically different versions could be on the A and B side of a 7&quot;, though these were always limited by the short time frame. Perry began splicing these versions together, creating an extended &quot;disco mix,&quot; doubling and sometimes tripling the playing time of a favorite rhythm. Along with the longer run time, by pressing these tracks to 12&quot; the sound quality was also richer, due to the ability to cut the grooves wider, allowing for deeper bass and more dynamic range. Perry loved that aspect and took advantage of it, creating waves of sonic tides, filled with tasty effects and his unusual signature soundscapes. And Perry was also always looking to the dance floor with his rhythms, and in these extended versions, his sound bounces, shimmers, and shakes like never before.\n\nThese cuts also showcase the roots of Perry's influence on contemporary dance music, especially on British dub-influenced electronica, as well as NYC DJs/engineers/producers like Walter Gibbons. This is Jamaican disco at its finest and most otherworldly. Like much of the recently resurfaced material from Perry, most of these versions never made it outside of Jamaica the first time around, and the original 12&quot;s are collector's choice picks. Included among the more obscure artists are great version songs from his stable of late-'70s stars, like the Congos, Max Romeo, Junior Murvin, the Heptones, Junior Delgado, and George Faith. Most of the tracks last in the seven-to-nine-minute range with a big climax being Perry's own thirteen-minute jam &quot;Free Up the Prisoners.&quot; I cannot recommended this one enough, and I'm sure we will run out of them, so don't wait. If you haven't bought a reggae record this year, this would be the only one you need. The document of a man at his creative peak. In my top five comps of the year! &quot;\n--Daniel Givens\n\n\nDISC #1:\n\n1. Norman - Max Romeo &amp; The Upsetters\n2. Bad Weed - Junior Murvin\n3. I Forgot To Be Your Lover (aka To Be A Lover) - George Faith\n4. Know Love - Twin Roots\n5. Rainy Night In Portland - Watty Burnett\n6. Disco Devil - Lee Perry &amp; The Full Experience\n7. City Too Hot - Lee Perry\n8. Words - Sangie Davis &amp; Lee Perry\n9. Roots Train - Junior Murvin &amp; Dillinger\n\nDISC #2:\n\n1. Open The Gate - Watty Burnett\n2. Neckodememus - The Congos\n3. Rasta Train - Raphael Green &amp; Doctor Alimantado\n4. Ketch Vampire - Devon Irons &amp; Doctor Alimantado\n5. History (Of Civilisation) - Carlton Jackson\n6. Sons Of Slaves - Junior Delgado\n7. Party Time - The Heptones\n8. Free Up The Prisoners - Lee 'Scratch' Perry\n9. Garden Of Life - Leroy Sibbles\n\ndavbowie1345, what.cd, 2013-01-12\n","torrent":{"xt":"urn:btih:ae39beccc47f4cbcca7e80ddb5c00693b36a07ec","amp;dn":"Lee+Perry+And+Friends+-+Disco+Devil+-+The+Jamaican+Discomixes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae39beccc47f4cbcca7e80ddb5c00693b36a07ec","infoHashBuffer":{"type":"Buffer","data":[174,57,190,204,196,127,76,188,202,126,128,221,181,192,6,147,179,106,7,236]},"announce":[],"urlList":[]}}