{"title":"Rhett Miller - The Dreamer [2012][EAC,log,cue. FLAC]","uid":8928145,"size":286026704,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ae54bd9918f9f004aa42dc095aaaaea55b456049&amp;dn=Rhett+Miller+-+The+Dreamer+%5B2012%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":17,"time":1379405783,"description":"Artist:Rhett Miller\nRelease:The Dreamer\nReleased: 2012\nLabel: Maximum Sunshine\nCatalog#: MSR-00002-2\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle: americana\n\n\nLost Without You\nLong Long Long\nOut of Love\nSleepwalkin'\nThis Summer Lie\nI'll Try To\nMarina\nSwimmin' in Sunshine\nAs Close as I Came to Being Right\nLove Grows\nPicture This\nComplicated Man\nSweet Dreams\n\nYou don't have to be an especially astute observer of Rhett Miller's career to notice the obvious dichotomy of his work -- as the lead singer with the Old 97's, he sings spunky, uptempo alt-country tunes with a pleasing Texas twang in his voice, while the Rhett Miller who makes solo albums makes smart pop music with an arty edge and sings with what appears to be some sort of British accent. So the big surprise in The Dreamer is this is the first Rhett Miller solo album where he's willing to let his country influences hold sway; this is a very different sort of roots-oriented music than the Old 97's, built on acoustic instruments and subdued tempos that suggest folk-rock more than the get-up-and-go mood of his band, but the guy singing is clearly the Rhett Miller on Too Far to Care rather than The Believer, as if his twin personalities have finally found common ground. Miller hasn't tossed away his slicker pop sensibilities; he's just allowed them to shake hands with his naturally twangy self, and songs like &quot;Picture This,&quot; &quot;This Summer Lie,&quot; and &quot;Out of Love&quot; are of a piece with Miller's solo work, only with arrangements that sound considerably more organic and less fussy (and with occasional interjections of steel guitar). And though &quot;Lost Without You,&quot; &quot;Sleepwalkin',&quot; and &quot;Swimmin' in Sunshine&quot; might have felt a little too low-key in the context of an Old 97's album, they sound fine here, confirming that Rhett Miller is a first-class songwriter when his muse is with him regardless of generic restraints. And Miller's duet with Rosanne Cash on &quot;As Close as I Came to Being Right&quot; is a gem, one of the best realized moments of his solo career; it's the best thing on The Dreamer, but there's plenty of other music here that should earn the approval of fans of both Rhett Millers.","torrent":{"xt":"urn:btih:ae54bd9918f9f004aa42dc095aaaaea55b456049","amp;dn":"Rhett+Miller+-+The+Dreamer+%5B2012%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae54bd9918f9f004aa42dc095aaaaea55b456049","infoHashBuffer":{"type":"Buffer","data":[174,84,189,153,24,249,240,4,170,66,220,9,90,170,174,165,91,69,96,73]},"announce":[],"urlList":[]}}