{"title":"Harlan Coben - Borta for alltid - 2003- DAISY","uid":6866067,"size":280309492,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ae6e2cb87abc8ef866f75fd0d9fb4072d9bd3a84&amp;dn=Harlan+Coben+-+Borta+for+alltid+-+2003-+DAISY&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1323107319,"description":"For Will Klein existerar endast en hjalte: hans aldre bror Ken. De vaxer upp i en valmaende forort till New Jersey. En varm sommarkvall hittas en ung kvinna - en flicka som Will en gang varit foralskad i - valdtagen och brutalt mordad i sin familjs kallare. Alla bevis pekar pa att Ken ar den skyldige och nar polisen ar redo att gripa honom forsvinner han sparlost. Kens tillintetgjorda och splittrade familj ar overtygad om att han ar borta for alltid.\n\nElva ar senare ar Will fortfarande saker pa att Ken ar oskyldig till mordet. Han har en kansla av att brodern forsoker kontakta honom och finner bevis att Ken fortfarande ar i livet. Sa intraffar ytterligare en katastrof. Wills flickvan forsvinner och han erfar att hon inte ar den person han hade trott henne vara. Nu tatnar mystiken och Will inser att han ar en fruktansvard hemlighet pa sparen - och nagon ar beredd att doda for att halla den begraven.\n\nBorta for alltid ar en maktig spanningsroman och en berattelse om karleken mellan broder, alskande och familjemedlemmar. Det ar en thriller som inte bara far pulsen att oka utan aven beror vara hjartan.\n\n\nUpplasare: Bo Jonsson","torrent":{"xt":"urn:btih:ae6e2cb87abc8ef866f75fd0d9fb4072d9bd3a84","amp;dn":"Harlan+Coben+-+Borta+for+alltid+-+2003-+DAISY","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae6e2cb87abc8ef866f75fd0d9fb4072d9bd3a84","infoHashBuffer":{"type":"Buffer","data":[174,110,44,184,122,188,142,248,102,247,95,208,217,251,64,114,217,189,58,132]},"announce":[],"urlList":[]}}