{"title":"My Dad Is Dead - For Richer, For Poorer [1995]","uid":9601932,"size":333077886,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:aefa472e6e7ed1cc2e8e39b077dd6fae86faf897&amp;dn=My+Dad+Is+Dead+-+For+Richer%2C+For+Poorer+%5B1995%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GenXRock","files":-1,"time":1392133552,"description":"Review by Karen E. Graves  [-]\nThe ninth release in as many years from Cleveland's My Dad Is Dead feels more like a collective, cohesive effort than some of the group's earlier works, many of which were essentially Mark Edwards solo efforts. Edwards is still clearly in charge of the operation, but the players have a certain chemistry that hasn't always been present in the band's previous incarnations. Joining Ewards this time around are Scott Pickering (formerly of Prisonshake) and Matt Swanson. Staccato rhythms and Edwards's detached vocals show MDID's predilection for outfits like the Talking Heads and Joy Division, as well as the group's Akron neighbors Devo. Instrumentally intricate and off-kilter acoustic numbers call to mind the finer moments of XTC. Although glimmers of MDID's influences show through, those artists are merely reference points. MDID never risks being weighed down by its influences or sounding derivative. Album standouts like &quot;Heirloom&quot; and &quot;Coat of Armor&quot; are notable as much for their arrangements that are dark and danceable almost in spite of themselves, as for Edwards's lyrics which are written and performed in a starkly moving manner that makes them seem a probable influence on outfits like the Silver Jews, JonathanFire*Eater and Interpol. The songs are propelled by crisp guitars that have an almost nervous jangle, a perfect accompaniment to Edwards's superb, desolate, claustrophobic lyrics (a fitting reflection of the dismal post-industrial landscape of Cleveland). In &quot;Heirloom&quot; Edwards's poetic sensibility is at its finest as he reveals &quot;I tore myself apart, and picked up the pieces, and from them fashioned a heart,&quot; while the subtle optimism of &quot;I Had a Dream&quot; has never seemed quite as relevant as it does today (&quot;I had a dream./There were no secrets anymore./No reasons to wage war./No reasons for fighting at all./ And I was not afraid./And I was not ashamed&quot;). Fans of outfits like Great Plains, Prisonshake, 4 Coyotes and the Smiths would be well-served to give this vastly under-appreciated outfit a shake. (4.5/5)","torrent":{"xt":"urn:btih:aefa472e6e7ed1cc2e8e39b077dd6fae86faf897","amp;dn":"My+Dad+Is+Dead+-+For+Richer%2C+For+Poorer+%5B1995%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aefa472e6e7ed1cc2e8e39b077dd6fae86faf897","infoHashBuffer":{"type":"Buffer","data":[174,250,71,46,110,126,209,204,46,142,57,176,119,221,111,174,134,250,248,151]},"announce":[],"urlList":[]}}