{"title":"101 Healthy Vegan Burgers-Daniel Nadav","uid":11519635,"size":3589969,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:af4a9eb4be74d48288a24cee9a168492d940e0a4&amp;dn=101+Healthy+Vegan+Burgers-Daniel+Nadav&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eternalpb","files":-1,"time":1416479095,"description":"ASIN: B00E2WEZ1C | 2013 | \n209 pages | \nEPUB/MOBI/\nTRUE PDF(text searchable) | 3MB\n\nThe first complete bible of healthy vegan burger recipes!\n\n101 original, tasty and juicy healthy vegan recipes from all over the world.\n\nThis unique book presents the perfect combination of the most popular food in the United States and the healthiest diet and way of living in the world!\n\nAbout the Author\nMy name is Daniel and I'm 33 years old. I've always considered myself a moral person and I lived for many years with an internal dissonance - The desire for animal products, collided with the heavy ethical baggage eating them brought. But at the age of 28 I decided to change. It was after I spent 6 days in a meditation course (Vipassana) which is held in complete silence that I declared: - &quot;That's it, I'm a vegan!&quot; When I came back from Vipassana I was troubled. I had no idea what to eat! Because I was professionally trained to cook (I worked for many years in different restaurants in my country), but my knowledge about vegan cooking was very poor. So I decided to contact members of our worldwide community through forums. I asked for recipes and tips and the response was amazing! I decided to leverage my passion for food and find the ultimate solutions to our community by writing a vegan cookbook. My vision was to write a series of cookbooks which contain vegan recipes and distribute them to as many people as possible. Each book focuses on one type of food and shows that there are dozens of ways to prepare food that contain only natural products. These books incorporate original recipes and are especially devoted to our wonderful community to enjoy and distribute them. Here I also urge you - if you have a winning recipe - you are welcome to send it to me along with your picture and the picture of the recipe, and I promise to publish it in my next books. Even if you do not have a recipe, you are invited to share with me your ideas and thoughts. For a much more harmonious, peaceful, balanced and sane life Daniel","torrent":{"xt":"urn:btih:af4a9eb4be74d48288a24cee9a168492d940e0a4","amp;dn":"101+Healthy+Vegan+Burgers-Daniel+Nadav","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af4a9eb4be74d48288a24cee9a168492d940e0a4","infoHashBuffer":{"type":"Buffer","data":[175,74,158,180,190,116,212,130,136,162,76,238,154,22,132,146,217,64,224,164]},"announce":[],"urlList":[]}}