{"title":"FatdogArm_Beta1_11-March-2014","uid":9745044,"size":462652662,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:af582f7ec44711b07886ef39f2890979a0cdfba1&amp;dn=FatdogArm_Beta1_11-March-2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"aarf12","files":11,"time":1394573288,"description":"FatdogArm Beta1 - 11 March 2014\n\n\nfrom/more at http://murga-linux.com/puppy/viewtopic.php?t=92548\n\n\nI'm happy to announce the release of FatdogArm Beta1. \n\n FatdogArm Beta1 is a complete-rebuild of FatdogArm, using LFS 7.4 as the base (glibc 2.18 and gcc 4.8.1). Platforms officially supported are: \n - A10/Mele A1000 \n - A20/Cubieboard2 \n - Odroid-U2/U3 \n - OLPC XO-1.75 and OLPC XO-4. \n\n FatdogArm itself is a port of Fatdog64 for ARM platform, supporting many of the rich features of Fatdog64; using Slackware-style package management (gslapt, slapt-get, pkgtool). \n\n There are two major goals for Beta1 (both achieved): \n 1. Re-target the hardware platform: Beta1 now targets ARMv7-A with VFPv3-d16 (no NEON). This is the same target as Debian armhf and enables FatdogArm to run on lesser-endowed hardware (e.g. OLPC XO-1.75 or Tegra2-based systems). \n\n 2. Fully reproducible build system --- all &quot;build recipes&quot; are now coded and recorded and delivered as part of binary packages. \n\n As a bonus, Beta1 supports 3D GPU acceleration for OpenGL ES for all officially platforms. \n\n Those objectives achieved, throughout the beta cycle (which will consist of a few more betas) I will be aiming for stability and bringing more features from Fatdog64; aiming feature parity by the time we get to RC (whenever that will be). \n\n Apart from the above changes, Beta1 is similar to Alpha4 including its software selection (there are only few minor updates for stability reasons). Since it is a complete rebuild, there may be things working in Alpha4 but not working in Beta1 (=regressions) - I'd like to hear about this so I can fix it. \n\n Like Alpha4, Beta1 is also released as a &quot;meta-distribution&quot; (ie the ability to build your own base SFS *from scratch* - this is in addition to the usual remaster stuff); it is similar to Woof except that it can only build from FatdogArm's own packages. \n\n Note: Beta1 now splits between &quot;basesfs&quot; and &quot;devx&quot; just like regular Puppies / Fatdogs. The split isn't as complete as Puppies - they are split at package level (in Puppy, the split goes a lot deeper - e.g. there is no header files in basesfs). \n\n This release would have not been possible without help from mavrothal and 01micko who helped with testings and pointing out my idiocy during development. Thanks guys  \n\n Contributed package recipes welcome. \n\n Download locations: \n - Full release notes \n - Installation instructions \n - ibiblio.org (primary site) \n - nluug.nl (European mirror) \n - uoc.gr (European mirror) \n - aarnet.edu (Australian mirror). \n\n Many thanks for ibiblio and the mirrors for providing this public service. \n\n Previous release (Alpha4) announcement was here.","torrent":{"xt":"urn:btih:af582f7ec44711b07886ef39f2890979a0cdfba1","amp;dn":"FatdogArm_Beta1_11-March-2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af582f7ec44711b07886ef39f2890979a0cdfba1","infoHashBuffer":{"type":"Buffer","data":[175,88,47,126,196,71,17,176,120,134,239,57,242,137,9,121,160,205,251,161]},"announce":[],"urlList":[]}}