{"title":"Big Rude Jake &amp; His Gentlemen Players - 1993 - Butane Fumes ","uid":8634261,"size":348238946,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:af5f34b011eb926ab8ab11a3313adca864a5dddc&amp;dn=Big+Rude+Jake+%26amp%3B+His+Gentlemen+Players+-+1993+-+Butane+Fumes+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"eika256","files":-1,"time":1372708018,"description":"Big Rude Jake &amp; His Gentlemen Players - 1993 - Butane Fumes &amp; Bad Cologne\n\nSwing-revivalist impresario Big Rude Jake is a big man, but far from rude. On Butane Fumes and Bad Cologne, he and his Gentleman Players serve up a smoky and sassy set of neo-swing tunes they proudly claim were recorded &quot;live off the floor, just like the old cats did.&quot; The band's considerable chops and Jake's charisma show in the seamless live sound, easily transporting listeners to a dark and swanky after-hours club in some big, rude city.\nDrawing on several traditions, including jump blues, Dixieland, and Tin Pan Alley, the music dips and dives through 12 lively tracks. Always energetic, and sometimes downright infectious, the musicianship should satisfy any fan of traditional music. Featuring an overarching, lazy feel with tiptoeing basslines and sliding acoustic guitar, the tunes echo Leon Redbone and lazy Southern afternoons. But the band can definitely swing, as demonstrated on the lively &quot;Blue Jake Jump.&quot; As the hammy frontman, Big Rude Jake creates larger-than-life tales of woe, seamy streets, and loud characters. Sometimes flexing his brassy baritone, sometimes speaking with a spoken-word drone, he usually operates in contrast to the loose vibes of the music, though he can ease back into that lazy groove, as evidenced by &quot;Summer Haze&quot; and &quot;Three Wishes.&quot; Giving a nod to old-school blues characters, he writes more in the vein of Tom Waits or Nick Cave, creating world-weary, witty characters who can't resist commenting on the irony of their situations. Like the best of the neo-swing outfits, Big Rude Jake takes the fine musical traditions of America's best art form and expands the genre with contemporary lyrics and colorful stories. (AllMusic)\n\nTrack list:\n01 - 7th Avenue\n02 - Front St. Belvedere\n03 - Hard Deep Junction Blues\n04 - Summer Haze\n05 - Chilli Bean's Final Carouse\n06 - Magpie\n07 - Three Wishes\n08 - Blue Jake Jump\n09 - Mad Palamino\n10 - Schiela's Going Downtown\n11 - When My Number Comes In\n12 - Filthy Bastard Cabaret\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:af5f34b011eb926ab8ab11a3313adca864a5dddc","amp;dn":"Big+Rude+Jake+%26amp%3B+His+Gentlemen+Players+-+1993+-+Butane+Fumes+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af5f34b011eb926ab8ab11a3313adca864a5dddc","infoHashBuffer":{"type":"Buffer","data":[175,95,52,176,17,235,146,106,184,171,17,163,49,58,220,168,100,165,221,220]},"announce":[],"urlList":[]}}