{"title":"Fminer Pro 9.03 (Windows)","uid":9415567,"size":18157139,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b0c7de243e3bd38ed21a599a554c6b114e1516a1&amp;dn=Fminer+Pro+9.03+%28Windows%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lough","files":-1,"time":1388433001,"description":"FMiner is a software for web scraping, web data extraction, screen scraping, web harvesting,   web crawling and web macro support windows and Mac OS X. \n\nIt's an easy to use web data extraction tool that combines best-of-class features with an intuitive visual project design tool to make your next data mining project a breeze.\n\nWhether faced with routine web scrapping tasks or highly complex data extraction projects requiring form inputs, proxy server lists, ajax handling and multi-layered multi-table crawls, FMiner is the web scrapping tool for you.\n\nWith FMiner, you can quickly master data mining techniques to harvest data from a variety of websites ranging from online product catalogs and real estate classifieds sites to popular search engines and yellow page directories.\n\nSimply select your output file format and record your steps on FMiner as you walk through your data extraction steps on your target web site. \n\nFMiner's powerful visual design tool captures every step and models a process map that iterates through the target site pages to capture the information you've identified. \n\nUsing preset selections for data type and output file, the data elements you've selected are saved in your choice of excel, csv or sql format and parsed to your specifications. \n\nAnd equally important, if your project requires regular updates, FMiner's integrated scheduling module allows you to define periodic extractions schedules at which point the project will auto-run new or incremental data extracts.\n\nFeatures of FMiner\n\n    Visual design tool\n    Design a data extraction project with the easy to use visual editor in under ten minutes.\n\n    No coding required\n    Use the simple point and click interface to record a scrape project much as you would click through the target site.\n\n    Advanced features\n    Extract data from hard to crawl Web 2.0 dynamic websites that employ AJAX and Javascript.\n\n    Multiple Crawl Path Navigation Options\n    Drill through site pages using a combination of link structures, automated form input value entries, drop-down selections or url pattern matching.\n\n    Keyword Input Lists\n    Upload input values to be used with the target website's web form to automatically query thousands of keywords and submit a form for each keyword.\n\n    Nested Data Elements\n    Breeze through multilevel nested extractions. Crawl link structures to capture nested product catalogue, search results or directory content.\n\n    Multi-Threaded Crawl\n    Expedite data extraction with FMiner's multi-browser crawling capability.\n\n    Export Formats\n    Export harvested records in any number of formats including Excel, CSV, XML, and popular databases (Oracle, MS SQL, MySQL).\n\n    CAPCHA Tests\n    Get around target website CAPCHA protection using manual entry or third-party automated decaptcha services.\n\nInstall: Run installer. Replace gdata.pyd with included copy in the program directory.","torrent":{"xt":"urn:btih:b0c7de243e3bd38ed21a599a554c6b114e1516a1","amp;dn":"Fminer+Pro+9.03+%28Windows%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0c7de243e3bd38ed21a599a554c6b114e1516a1","infoHashBuffer":{"type":"Buffer","data":[176,199,222,36,62,59,211,142,210,26,89,154,85,76,107,17,78,21,22,161]},"announce":[],"urlList":[]}}