{"title":"Autisme een leven lang - Deel.1 tm 3  TBS","uid":6631057,"size":3636531744,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:b10983a3c809e132a1095ef31d596cede404d14d&amp;dn=Autisme+een+leven+lang+-+Deel.1+tm+3++TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Saggin","files":-1,"time":1314371298,"description":"[b]Autisme een leven lang - Deel.1 t/m 3 Retail[/b]\n\n\nDeel.1 - Kinderen met autisme - Een Verrassend Begin\nIn deze voorlichtingsfilm vertellen de ouders van Thimo en Ewout op een openhartige manier \nover het autisme van hun zoons. Thimo is een jongetje van bijna vier jaar met de diagnose \nklassiek autisme. Ewout heeft de diagnose Asperger gekregen en is negen jaar oud. We \nvolgen beide jongens en hun ouders in hun dagelijks leven. Wat betekent het voor ouders om \neen kind met autisme te hebben? De ouders vertellen hierover op een eerlijke, herkenbare \nen soms ook humoristische manier. Over hun leven met ups en downs, over het genieten van \nde unieke karakters van hun zoons ÃƒÂ©n over de moeilijkheden die ze ondervinden in het \nomgaan met hun autisme. EÃƒÂ©n van de thema's in deze film is de diagnose. Komt er met de \ndiagnose een einde aan de onzekerheid en twijfel? Sta je hiermee aan het begin van een \nmoeilijke weg of helpt het je juist om er beter mee om te kunnen gaan? En, wat doet de \ndiagnose met je?\n\nDeel.2 - Pubers met autisme - Een Zinnenprikkelend Leven\nIn de film wordt het leven van Darryl en Marieke op indringende wijze gevolgd, waarbij \nvele onderwerpen de revue passeren. De film is in premiÃƒÂ¨re gegaan tijdens het \nAutismecongres op 25 november 2006 en was een groot succes. De mensen in de zaal waren erg \nenthousiast en de hoofdrolspelers kregen een staande ovatie, voor een geweldige \nopenhartige rol in de film. De film geeft een goed beeld van de problemen, waarmee een \npuber met autisme en hun familie te maken krijgen. De film kan daardoor heel goed worden \ngebruikt voor mensen die meer willen weten over dit onderwerp, scholen, buren, familie, \nbij opleidingen etc.\n\nDeel.3 Aan passie geen gebrek\nAan passie geen gebrek geeft een kijkje in het leven van twee jongvolwassenen met autisme. \nWat vinden Robert en Inge op hun weg tijdens hun studie en daarna? Beide portretten geven \nop een openhartige, eerlijke en soms aangrijpende wijze inzicht in autisme bij \njongvolwassenen. Deze film is het derde deel uit de serie: Autisme Een Leven lang! Met \ndeze serie voorlichtingsfilms beoogt de NVA, Nederlandse Vereniging Autisme, goede \nbasisvoorlichting over autisme te geven. In de serie worden de gevolgen van het autisme in \nde verschillende levensfasen in beeld gebracht.\n\n\n\nDeel.1 - Children with Autism - A Surprising Start\nThis educational film to tell the parents and Ewout Thimo in an open way about their son's \nautism. Thimo was a boy of nearly four years diagnosed with classic autism. Ewout has been \ndiagnosed with Asperger's and nine years old. We follow the two boys and their parents in \ntheir daily lives. What does it mean for parents to have a child with autism? The parents \ndiscuss their findings in an honest, recognizable, and sometimes humorous way. About their \nlife with ups and downs, about enjoying the unique characters of their sons and the \ndifficulties they face in coping with their autism. One of the themes in this film is the \ndiagnosis. Will there be diagnosed with an end to the uncertainty and doubt? Are you this \nat the beginning of an arduous journey or help you to correct them better to cope? And, \nwhat is your diagnosis?\n\nDeel.2 - Adolescents with autism - a titillating Life\nIn the film the life of Darryl and Mary is aggressively monitored, with many topics \npresented. The film was premiered at the Autism Conference on November 25, 2006 and was a \ngreat success. The people in the audience were very enthusiastic and the actors received a \nstanding ovation for a great outspoken role in the film. The film gives a good picture of \nthe problems with which an adolescent with autism and their families face. The film can \ntherefore be used very well for people who want to know more about this subject, schools, \nneighbors, family, education and so on\n\nAt no lack of passion Deel.3\nNo lack of passion provides a glimpse into the lives of two young adults with autism. What \ndo Robert and Inge on their way during their studies and beyond? Both portraits give a \nfrank, honest and sometimes poignant insight into how young adults with autism. This film \nis the third volume in the series: Autism Lifelong! With this series of educational films \naimed at NVA, Dutch Society of Autism, good basic information about autism to give. In the \nseries, the effects of autism in different stages of life portrayed.\n\nSpotinformatie\n\nBron: Retail\nMenu: Ja\nAudio Taal: Nederlands\nSubs: NL ( alleen deel.3)\nBeeld: PAL\nBeeld verhouding: 16:9\nGeluid: DD 2.0\nVideo: ReEncoded\n\n\n\n\n[img]http://img708.imageshack.us/img708/589/blacksam3.jpg[/img]\n\n","torrent":{"xt":"urn:btih:b10983a3c809e132a1095ef31d596cede404d14d","amp;dn":"Autisme+een+leven+lang+-+Deel.1+tm+3++TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b10983a3c809e132a1095ef31d596cede404d14d","infoHashBuffer":{"type":"Buffer","data":[177,9,131,163,200,9,225,50,161,9,94,243,29,89,108,237,228,4,209,77]},"announce":[],"urlList":[]}}