{"title":"WhereIsIt v3.97.612 Portable","uid":4970389,"size":11544048,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b1fe4eaae425531eb0e1c433f40fb6cb3dfe990b&amp;dn=WhereIsIt+v3.97.612+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NoExcuses","files":6,"time":1245742848,"description":"WhereIsIt v3.97.612 made Portable.\n\nNo need to install it!\nOr, if you want to, Setup and License are included.\n\nWhereIsIt is an application written for Windows operating systems, and designed to help you maintain and organize a catalog of your computer media collection, including CD-ROMs and DVDs, audio CDs, diskettes, removable drives, hard drives, network drives, remote file servers, or any other present or future storage media device Windows can access as a drive.\nThe primary goal for WhereIsIt is to provide access to the contents of cataloged disks, even when they are not available on the system, or even they are not your own. You can browse their contents, search for files or folders you need, use imported descriptions and thumbnails, organize data using categories and flags etc. \n\nWhereIsIt can be used to handle any kind of data, including downloaded programs, magazine CD-ROMs, music collections like MP3s or audio CDs, graphics collections, document backups, etc. WhereIsIt can handle lots of them, too, a couple hundreds or thousands disks in a catalog is nothing unusual, yet catalogs remain reasonably small, single-filed and easy to transfer or send to other users. You can also create more than one catalog, and at any time open and work with as many catalogs at once as needed.\n\nWhereIsIt is easy to use for both beginners and advanced users. It features a familiar and well thought-out, Explorer-like user interface, combined with strong searching and reporting capabilities, multi-language support, automated description and thumbnails importing through extendable plugins from more than 130 different sources, and much more.\n\n\nMore infos at\n &lt;a href=&quot;\nhttp://www.whereisit-soft.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.whereisit-soft.com/&lt;/a&gt;\n\n\n\nThe Portable SFX EXE file is built up using WinRAR. You can use it to extract the files and check them one by one if you want to be sure of what is running on your machine.\n\n\nThis has also been built up on an XP x86 machine, I don't know if this program can run on a x64 or Vista machine. I't's up to you to check it if you are using them.\n\n\n\nSUGGESTIONS ON USING P2P DOWNLOADS\n==================================\n\n1) It's always better to run all downloaded programs using Sandboxie or a similar virtual machine until you are sure they are clean.\n\n\n2) When in doubt, scan them with an Internet Scan service as the ones provided by Jotti and VirusTotal\n &lt;a href=&quot;\nhttp://virusscan.jotti.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://virusscan.jotti.org/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.virustotal.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.virustotal.com/&lt;/a&gt;\n\nThis will ***NOT*** give you any warranty that a file passing their analysis is clean, nor that if they see them as a troian it's so or not just another false positive, but helps you to decide and at least ask for help or infos.\n\n\n3) Remember, trust nobody, and when in doubt, go to point 1) \n\n\n4) If you find any upload containing trojans or whatsoever malicious or unclean, instead of start cursing in the comments of the upload, take the time to go to the Suprbay Forum at:\n &lt;a href=&quot;\nhttp://suprbay.org/forumdisplay.php?f=34&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://suprbay.org/forumdisplay.php?f=34&lt;/a&gt;\n\nand report links and comments there, and someone will take care of all the nasties.\n\n\nThat's the only way to keep TPB and its uploads fresh and clean.\n\n\nThat's for what is regarding security. If after testing it you see that you like it and it's useful for you, show your support by buying it!\n\n\n\nEnjoy and remember to seed... :o)\n","torrent":{"xt":"urn:btih:b1fe4eaae425531eb0e1c433f40fb6cb3dfe990b","amp;dn":"WhereIsIt+v3.97.612+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1fe4eaae425531eb0e1c433f40fb6cb3dfe990b","infoHashBuffer":{"type":"Buffer","data":[177,254,78,170,228,37,83,30,176,225,196,51,244,15,182,203,61,254,153,11]},"announce":[],"urlList":[]}}