{"title":"Jai Uttal - Music For Yoga And Other Joys [FLAC CUE EAC] [Mahara","uid":4954517,"size":441784126,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b2329c51bc4219b2d7e2a312aef1fda919830e55&amp;dn=Jai+Uttal+-+Music+For+Yoga+And+Other+Joys+%5BFLAC+CUE+EAC%5D+%5BMahara&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Maharaja-Krishna","files":-1,"time":1245043929,"description":"Jai Uttal - Music for Yoga and Other Joys [FLAC CUE EAC]\n\nArtists: Jai Uttal and Ben Leinbach\nTitle: Music for Yoga and Other Joys\nOriginal Release Date: 2004\nGenre: New Age\nFile Type: FLAC (Lossless)\nCUE-Sheet: Included\nEAC-Log: Included\n\nDescription:\nSensual music featuring dotar, electric guitar, and slide tamboura, all complemented by Uttal full, golden-toned voice. Grammy nominated world music pioneer Jai Uttal, and multi-talented producer/instrumentalist Ben Leinbach offer a moving mix of melody, rhythm, texture, and chant on Music for Yoga and Other Joys. Known for their eclectic blend of Eastern and Western sounds, Jai and Ben have produced their first CD specifically designed to accompany your yoga practice as it joyfully permeates every aspect of life. Featuring dotar, electric guitar, slide tamboura, banjo, bansuri, and Jai's passionate singing, Music for Yoga and Other Joys will take you on a gentle journey into the mysterious ocean of Spirit.\n\nTrack List:\n1. Govinda (26:47)\n2. Mahadeva (10:16)\n3. Nataraja (15:05)\n4. Gopala (10:38)\n5. Surya (12:15)\n\nPersonal comments:\nI have been searching for a long long time some descent quality (lossless) songs from Jai Uttal but I never found any so far. I know it might be strange for many others but I simply cannot listen to any mp3 file... I even tried to pay for flac files but eventually I could not download them... For this reason I decided to share what I had to pay for and I hope it will be for the pleasure and the discovery of many others. I believe that if you like this torrent like I do then you soon might get the urge of getting some more... According to your feedback which I would welcome as well as depending on my first experience with sharing a torrent, I might seed some more new torrents of that kind in the near future. Finally if you really like these songs don't hesitate to buy the CD-A's and thus allow the artists to get what they really deserve for their good work! :-) Om Shanti.","torrent":{"xt":"urn:btih:b2329c51bc4219b2d7e2a312aef1fda919830e55","amp;dn":"Jai+Uttal+-+Music+For+Yoga+And+Other+Joys+%5BFLAC+CUE+EAC%5D+%5BMahara","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2329c51bc4219b2d7e2a312aef1fda919830e55","infoHashBuffer":{"type":"Buffer","data":[178,50,156,81,188,66,25,178,215,226,163,18,174,241,253,169,25,131,14,85]},"announce":[],"urlList":[]}}