{"title":"The Remains of the Day (panscan) English or Italian (subs too)","uid":5148051,"size":926524876,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b23fb56af787273a67e6b16f416c441e59d92a61&amp;dn=The+Remains+of+the+Day+%28panscan%29+English+or+Italian+%28subs+too%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mrizzo2","files":-1,"time":1257385099,"description":"Dual Audio track - View in normal English or select Italian audio track\nfor those that want this perspective instead as it is valuable to those\nof Itlain descent or affinity. All of Europe is certainly concerned with\nthe meaningful explianation of the story that is being told in this great\nmovie from Britain. You may switch on Italian subtitles if you wish too,\nthey are both embedded for this purpose and included in a separate SRT file\nalso. Grazie\n\nThis is a special &quot;pan and scan&quot; format, much more pleasing to view than the\nstandard narrow format that the movie was made in. It feels like you are\nadmiring a nicer work of art as it were, when you use our format here instead.\n\nThe Remains of the day speaks to a problem in contemporary society that is true\nof England, the land where articulation standards seem the most perfect and are\ncertainly supreme in my own view in fact, compared to any other so far\ndeveloped alternatives (if to see such options would have any desirability in\nany event, it escapes me for the present moment as to what that might be). The\nproblem in the picture nonetheless is a serious one, its that of human relating\nin an adequate manner so as to preserve valid emotions and in fact a wellness\nin the form of being that yield the real best quality of life.\n\nMy own political crusade in the area has been an outreach to see that the\nvalues prevalent in related societies in the region especially those of\nGermany, France, Italy and Spain, all in particular might yield a better\nformula for a better outcome in future endeavors to bring such people into\nsocieties where English is adopted for all its supreme benefits without losing\nsight of what remains fundamentally non-dispensable in making the transition\nmeaningful, worthwhile, desirable and in the end certainly fruitful.\n\nThere can never be an equivalent to the contribution that the British have made\nto the world in the area of decorum and the trappings of civilized discourse.\nWe are to never lose these benefits or anarchy is the certain result. that\nsaid, we must retain our full functioning as we come to learn what benefits\nthere are to be gained, in a manner as to stay within our own sense of what is\nagain, most meaningful personally, each to his own, that come from such related\ncultures (closely) as I make reference to here, and for whom the producers have\nprovided audio support on the PAL version of the DVD disc.\n\nFor most observers, Emma Thompson and Anthony Hopkins remain &quot;the best of\nBritish&quot; in what they are as individuals and in this respect I am glad to see\nthat it is they that tell the story here.\n\n\nMichael Rizzo (Chessman)\nPlease see my movie reviews at moviesbyrizzo.info","torrent":{"xt":"urn:btih:b23fb56af787273a67e6b16f416c441e59d92a61","amp;dn":"The+Remains+of+the+Day+%28panscan%29+English+or+Italian+%28subs+too%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b23fb56af787273a67e6b16f416c441e59d92a61","infoHashBuffer":{"type":"Buffer","data":[178,63,181,106,247,135,39,58,103,230,177,111,65,108,68,30,89,217,42,97]},"announce":[],"urlList":[]}}