{"title":"Writing manuals","uid":13266319,"size":652679449,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b2af4457359092d907c22fff737c3d21dbdccbfc&amp;dn=Writing+manuals&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"whitecat2010","files":124,"time":1453341543,"description":"Writing manuals collection - 42 books on the art of writing\r\n===========================================================\r\n\r\nThis is my collection of 42 books about the art of writing, either fiction or non-fiction, for all prospective writers.\r\n\r\nThey are in various formats, mostly pdf and epub. I have consistently and properly renamed them, and every title includes an info file.\r\n\r\nThese are not my own scans or OCRs: I've collected them from the web, over the years.\r\n\r\nIn the case of Lee Gutkind's &quot;The Art of Creative Nonfiction&quot; the version I found looked as a .pdf and an .epub, but in reality it was a just OCRd plain text.  It was full of typos, there were page numbers and chapter titles inserted in the middle of the text (sometimes in the middle of a word!), ditto for the footnotes, which were just put somewhere on the page, without knowing to what they referred to, no chapter and sub-chapter headers, no title page, no proper Table of Contents... in short, a jumbled mess. It took me about 6 hours to fix it in Word, ensuring each chapter starts in its own odd page, creating a title page, using 3 level of headings to generate a table of contents (thanks, Word!), and then convert it into a proper .pdf, with suitably resized cover and even bookmarks for chapters and subchapters (again thanks, Word!). Unfortunately, here and there, some sentences are missing, which I couldn't of course restore... but it's not much. \r\n\r\nEnjoy, and good luck in your writing endeavours","torrent":{"xt":"urn:btih:b2af4457359092d907c22fff737c3d21dbdccbfc","amp;dn":"Writing+manuals","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2af4457359092d907c22fff737c3d21dbdccbfc","infoHashBuffer":{"type":"Buffer","data":[178,175,68,87,53,144,146,217,7,194,47,255,115,124,61,33,219,220,203,252]},"announce":[],"urlList":[]}}