{"title":"Por el camino de la decepcion - Victor Ostrovsky y Claire Hoy","uid":4280465,"size":1020416,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b387c6535d397aec7382840f89ec6a615d01b95a&amp;dn=Por+el+camino+de+la+decepcion+-+Victor+Ostrovsky+y+Claire+Hoy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"CuriousGeorge","files":1,"time":1215391351,"description":"(By Way of Deception in Spanish)\n\nGLOSARIO DE TÃƒ?RMINOS\n--------------------------------------------------------\nNo me ha resultado fÃƒÂ¡cil revelar los hechos que conozco desde mi ventajosa perspectiva tras los cuatro aÃƒÂ±os pasados en el Mossad.\nProcedente de un apasionado entorno sionista, me habÃƒÂ­an inculcado que el Estado de Israel era incapaz de actuar injustamente, que ÃƒÂ©ramos como David en su interminable lucha contra un Goliat cada vez mÃƒÂ¡s gigantesco y que ÃƒÂºnicamente podÃƒÂ­amos confiar en nosotros mismos para protegernos, sentimiento consolidado por los supervivientes del holocausto con los que convivÃƒÂ­amos.\nEn nosotros, la nueva generaciÃƒÂ³n de israelÃƒÂ­es, la naciÃƒÂ³n que habÃƒÂ­a renacido en su propia tierra tras mÃƒÂ¡s de dos mil aÃƒÂ±os de exilio, se confiaba totalmente el destino de la naciÃƒÂ³n.\nLos comandantes de nuestros ejÃƒÂ©rcitos eran considerados campeones, no generales; nuestros gobernantes eran capitanes que guiaban el timÃƒÂ³n de un gran navio.\nMe sentÃƒÂ­ lleno de jÃƒÂºbilo cuando fui escogido y se me concediÃƒÂ³ el privilegio de incorporarme al que me parecÃƒÂ­a el equipo mÃƒÂ¡s escogido del Mossad.\nMas los retorcidos ideales y el egocÃƒÂ©ntrico pragmatismo que encontrÃƒÂ© dentro de la organizaciÃƒÂ³n, junto con la codicia, avidez y absoluta falta de respeto del equipo hacia la vida humana, me impulsaron a narrar esta historia.\nPorque amo a Israel como un paÃƒÂ­s libre y justo arriesgo mi vida haciÃƒÂ©ndolo asÃƒÂ­, enfrentÃƒÂ¡ndome a aquellos que se arrogaron el derecho de convertir el sueÃƒÂ±o sionista en la actual pesadilla que vivimos.\nEl Mossad, organizaciÃƒÂ³n de los servicios secretos a la que se habÃƒÂ­a confiado la responsabilidad de allanar el camino de los dirigentes polÃƒÂ­ticos de la naciÃƒÂ³n, ha traicionado esa confianza. Conspirando en beneficio propio y en pro de razones mezquinas ha conducido a la naciÃƒÂ³n al enfrentamiento en una lucha sin cuartel.\nNo puedo seguir guardando silencio ni exponer la verosimilitud de este libro simulando la realidad bajo falsos distintivos y oscuras identidades (aunque he utilizado las iniciales de algunos miembros del personal activo para proteger sus vidas).\nIacta alea est: la suerte estÃƒÂ¡ echada.\nVÃƒÂ­ctor Ostrovsky\nJulio de 1990 \n","torrent":{"xt":"urn:btih:b387c6535d397aec7382840f89ec6a615d01b95a","amp;dn":"Por+el+camino+de+la+decepcion+-+Victor+Ostrovsky+y+Claire+Hoy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b387c6535d397aec7382840f89ec6a615d01b95a","infoHashBuffer":{"type":"Buffer","data":[179,135,198,83,93,57,122,236,115,130,132,15,137,236,106,97,93,1,185,90]},"announce":[],"urlList":[]}}