{"title":"Candlestick Charts: An Introduction to Using Candlestick Charts","uid":9312147,"size":6608571,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b431571f85c4c1d7f033c974ca8382cd999d7129&amp;dn=Candlestick+Charts%3A+An+Introduction+to+Using+Candlestick+Charts&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"moneymakestheworldgoround","files":-1,"time":1386375525,"description":"ABOUT THIS BOOK\nThe aim of this book is to introduce candlestick analysis to anyone from an absolute beginner to an experienced market professional. The text is written to be simple enough for someone new to the topic, but should not exclude those with more experience. The author's aim is to change the simple viewing of a candlestick chart into a search for the answer to the perennial question: &quot;Who's controlling the market; the Bulls or the Bears?&quot; Candlesticks are a fantastic way of getting a clear idea of market direction, and any changes that may be taking place in price trends. In this exciting new book, Clive Lambert walks you through what candlesticks are, the major patterns and importantly, the psychology behind them, using straightforward language that will appeal to all levels of ability. Having outlined the key patterns and described the real-life application of the techniques, he then ends the book with his 10 golden rules for trading with candlesticks. This book is a no-nonsense guide to the methodology and practical usage of this ancient Japanese charting technique and essential reading for any trader, broker or market operative, regardless of their level of experience or the markets they are involved in.","torrent":{"xt":"urn:btih:b431571f85c4c1d7f033c974ca8382cd999d7129","amp;dn":"Candlestick+Charts%3A+An+Introduction+to+Using+Candlestick+Charts","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b431571f85c4c1d7f033c974ca8382cd999d7129","infoHashBuffer":{"type":"Buffer","data":[180,49,87,31,133,196,193,215,240,51,201,116,202,131,130,205,153,157,113,41]},"announce":[],"urlList":[]}}