{"title":"bruteforce md5 hash","uid":4696464,"size":2568069,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b53a350aa75b2eb56440ab6629491ac37f7ac770&amp;dn=bruteforce+md5+hash&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"my_name_is_bob","files":-1,"time":1233532977,"description":"This is a comandline md5 hash bruteforce script for linux, with active perl installed on your windows machine it works perfectly. Perl installer included but not nessicarry. If you can code a bit perl, you can modify it to crack sha etc too...\nWindows users: a jumbled attempt at instructions are included.\nLinux users: easy enough.\n\nexplain md5 hash:\nIn cryptography, MD5 (Message-Digest algorithm 5) is a widely used cryptographic hash function with a 128-bit hash value. As an Internet standard (RFC 1321), MD5 has been employed in a wide variety of security applications, and is also commonly used to check the integrity of files. However, it has been shown that MD5 is not collision resistant hence MD5 is not suitable for applications that rely on this property. An MD5 hash is typically expressed as a 32 digit hexadecimal number.\nMD5 was designed by Ron Rivest in 1991 to replace an earlier hash function, MD4. In 1996, a flaw was found with the design of MD5. While it was not a clearly fatal weakness, cryptographers began recommending the use of other algorithms, such as SHA-1 (which has since been found vulnerable itself). In 2004, more serious flaws were discovered making further use of the algorithm for security purposes questionable. In 2007 a group of researchers including Arjen Lenstra described how to create a pair of files that share the same MD5 checksum. In an attack on MD5 published in December 2008, a group of researchers used this technique to fake SSL. \nSimplified: when you type a password into the websites you visit or sometimes even applications, it doesn't save your password. A hash of the password is created and when you type the same password again a matching hash allows you in.\n\n\nexplain bruteforce:\nbruteforce is a means of getting passwords that involves guessing every letter, number, and symbol imaginable until you get it. ","torrent":{"xt":"urn:btih:b53a350aa75b2eb56440ab6629491ac37f7ac770","amp;dn":"bruteforce+md5+hash","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b53a350aa75b2eb56440ab6629491ac37f7ac770","infoHashBuffer":{"type":"Buffer","data":[181,58,53,10,167,91,46,181,100,64,171,102,41,73,26,195,127,122,199,112]},"announce":[],"urlList":[]}}