{"title":"The Firebird Band - The Setting Sun and its Satellites [FLAC]","uid":8225429,"size":336643979,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b767bb6a47d0e3e726c93f52ae7a079b7692bbda&amp;dn=The+Firebird+Band+-+The+Setting+Sun+and+its+Satellites+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"politux","files":-1,"time":1362588343,"description":"Some CDs give the listener instant gratification, and some have to be accepted on their own terms; The Setting Sun &amp; Its Satellites definitely falls into the latter category. The Firebird Band, an alternative rock quartet led by former Braid singer/guitarist Chris Broach, doesn't go out of its way to be accessible. Its songs tend to be angular and abstract, and if you're looking for immediacy or the quick musical fix, you won't find it here. What you will find is integrity and creativity. The Setting Sun &amp; Its Satellites isn't easy to absorb on the first listen, but the more times you play this CD, the more you realize how good it is -- not earth-shattering, but good. Although not every song on the album is a masterpiece, the best tracks (&quot;Forever,&quot; &quot;City&quot; and &quot;Kiss Yourself,&quot; among others) let you know how much potential The Firebird Band has. That is, if you give the songs a chance to win you over. Again, this isn't the most accessible or immediate CD in the world. Broach is obviously determined to do things his way, and his way doesn't involve a lot of compromising.","torrent":{"xt":"urn:btih:b767bb6a47d0e3e726c93f52ae7a079b7692bbda","amp;dn":"The+Firebird+Band+-+The+Setting+Sun+and+its+Satellites+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b767bb6a47d0e3e726c93f52ae7a079b7692bbda","infoHashBuffer":{"type":"Buffer","data":[183,103,187,106,71,208,227,231,38,201,63,82,174,122,7,155,118,146,187,218]},"announce":[],"urlList":[]}}