{"title":"Brainwave Mind Voyages FLAC Series 1-8,10,12-14,25,28","uid":5148053,"size":4943504573,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b79c4b29ce753cce0f61f67479c507a1aa236d3d&amp;dn=Brainwave+Mind+Voyages+FLAC+Series+1-8%2C10%2C12-14%2C25%2C28&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"pirate_bit","files":-1,"time":1257385304,"description":"BRAINWAVE MIND VOYAGES\nPsychoacoustic vibrational sound therapy\nBrainwave entrainment\n\nExperience your true potential\n\nState-of-the-art psychoacoustics\n\nNote:\nThis is audio for meditation and psychic development and is not 'music', per se.\nThe FLAC files consist of ambient sounds plus 'humming' at various frequencies.\n\nBrainwave Mind Voyages FLAC Series 1-8,10,12-14,25,28\n\n1. Trance Induction, The Lucid Dreaming Version\n2. Astral Trance, The Out of Body Experience\n3. The Alpha Brainwaves\n4. The Theta Brainwaves\n5. The Delta Brainwaves\n6. The Tones\n7. Astral Vibrations\n8. Remote Viewing\n\n10. The Lucid Dream Cycle\n\n12. Guided Dream Incubation\n13. Journey of the Whales\n14. Rainstorm\n\n25. Sacred Geometry\n\n28. The Awakened Mind Brain Pattern\n\n=================================\n\n\n\nTRAINING WHEELS FOR YOUR CONSCIOUSNESS!\n\nFor centuries, it has taken years of physical, mental and spiritual training to achieve peak states of consciousness.\n\nNow, using new audio technologies you can tune your brainwaves to specifically designed brainwave states simply by listening to one of our brainwave entrainment CDs!\n\nPEAK EXPERIENCES AT THE TOUCH OF A BUTTON!\n\nWould the Buddha wear a Walkman? He may not have needed brainwave entrainment technology, but everyone else should certainly take advantage of these amazing cutting-edge technologies.\n\nWill brainwave entrainment work for You? The entrainment process has been scientifically proven to naturally synchronize your brainwaves to the embedded carrier frequencies.\n\nAs long as you can hear, it will work for you too!\n\nHARNESS YOUR NATURAL BRAINWAVE STATES!\n\nClick to visit the BMV MEMBERSHIP SITE where you can get instant access to hundreds of audio downloads. These mind-altering MP3 files are guaranteed to expand your consciousness and make the most of your inner journeys.\n\nCheck out our new BMV DOWNLOAD AREA for Hypnosis Downloads, Subliminal Downloads and other powerful Brainwave Downloads that you can download to your computer, right now!\n\nFor more information on this exciting new audio brainwave technology, click here to explore our Brainwave Technologies page.\n\nFor more information about Brainwave Mind Voyages, click here to learn about our company and our mission.\n\n\nTens of thousands of BMV users have experienced powerful results, and you will too!\n\n\nWe proudly offer a full line of state-of-the-art products for expanding your consciousness, heightening your awareness and creating positive results in all aspects of your life.\n\nOur Brainwave CDs, Hypnosis CDs and BMV Quantum Subliminal CDs set the standard for the industry of subliminal CDs using advanced brainwave technology.\n\nFeel free to explore our website and learn more about this exciting revolution in audio neuro-technologies or check out our mind-expanding product line by clicking here to explore our BMV Product Page.\n\nSee what our customers have to say about our products by clicking here to read our BMV Feedback page.\n\n\nHARNESS THE POWER FOR QUANTUM SELF! &lt;a href=&quot;\nhttp://www.brainwave-entrainment.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.brainwave-entrainment.com/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:b79c4b29ce753cce0f61f67479c507a1aa236d3d","amp;dn":"Brainwave+Mind+Voyages+FLAC+Series+1-8%2C10%2C12-14%2C25%2C28","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b79c4b29ce753cce0f61f67479c507a1aa236d3d","infoHashBuffer":{"type":"Buffer","data":[183,156,75,41,206,117,60,206,15,97,246,116,121,197,7,161,170,35,109,61]},"announce":[],"urlList":[]}}