{"title":"IDM UltraSentry Professional v13.00.0.09 with license [iahq76]","uid":7820693,"size":24457856,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b8789a4135f57c696cab68f63889adff567ca111&amp;dn=IDM+UltraSentry+Professional+v13.00.0.09+with+license+%5Biahq76%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TorDigger","files":3,"time":1352814129,"description":"IDM UltraSentry\n\nSecurely protect and encrypt files and folders. Securely delete sensitive data.\nAnnouncing the new, re-imagined UltraSentry 13.\n\nDigital safety and identity theft are serious risks for anyone using a computer to store data. UltraSentry secures that data by locking and encrypting your most sensitive files and folders for maximum protection, and then securely deleting any old or unwanted data so that it is physically and forensically unrecoverable.\n\nFor years, UltraSentry has been the ultimate file/folder military-grade secure deletion tool. UltraSentry 13 is a re-imagined personal security application designed to provide a complete solution for your data security. UltraSentry 13 includes the same powerful secure deletion functionality as previous versions while adding new features and functionality to secure your most sensitive digital information!\n\nNew in UltraSentry 13: Lock and secure your files with the digital Locker:\n\nSecure any file or folder by simply moving it to UltraSentry's digital locker. UltraSentry makes it easy to protect your data. Drag and drop any file/folder to your digital locker, and let UltraSentry protect it for you. After you close your digital locker, your data is password-protected and encrypted.\n\nThe digital locker works by using a password you specify to encrypt files/folders in a secure location. No one can access the data without your password. Adding files and folders to the digital locker is as easy as dragging and dropping them from UltraSentry's explorer window, or dragging and dropping them from Windows explorer into the digital locker from the Explorer context menu or with the all-new Drop Center.\n\nBetter in UltraSentry 13: Securely delete files and folders with the file shredder:\n\nDelete files and folders to the point where they are unrecoverable. As you probably already know, simply deleting a file from your hard drive doesn't actually remove the file's data from your hard drive. UltraSentry's military-grade digital file shredder removes the deleted file's data by wiping the disk and over-writing the original data a number of times to make it unrecoverable, even by the leading digital forensic tools. The new file shredder in UltraSentry 13 makes secure deletion of files painless and hassle-free. You can also shred files directly from the Windows explorer context menu or with the all-new Drop Center.\n\nWhat else is new in UltraSentry 13?\n\nDigital locker\nSecurely encrypt and lock any file or folder\nConfigure digital locker location\nAccess digital locker through Drop Center or Windows explorer integration\nFile shredder\nSecurely delete files and folders so that they are forensically unrecoverable\nConfigure deletion method and level\nShred files via Drop Center or Windows explorer integration\nDrop Center: access UltraSentry from a convenient auto-hiding fly-out menu on your desktop\nLock (encrypt) files on an individual basis with unique passwords for portability or sharing with others\nClean browser histories, cookies, and temporary internet files instantly\nSimplified interface and profile builder\n\nSupported OS:\n\nWindows 7/vista/xp\n\nHomepage: http://www.ultraedit.com/products/ultrasentry.html\n\nInstallation Instructions:\n\n1. Install program.\n2. Run application, click on close.\n3. If you have installed program for personal account copy content from license folder and paste into e.g c:&gt;users&gt;here select own account name&gt;AppData&gt;Roaming&gt;IDMComp&gt;UltraSentry&gt;License...paste it here.\n4. If you have installed program for All users copy content from license folder and paste into e.g c:&gt;ProgramData&gt;IDMComp&gt;UltraSentry&gt;License...paste it here.\n5. Restart application, Done, Enjoy.\n","torrent":{"xt":"urn:btih:b8789a4135f57c696cab68f63889adff567ca111","amp;dn":"IDM+UltraSentry+Professional+v13.00.0.09+with+license+%5Biahq76%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8789a4135f57c696cab68f63889adff567ca111","infoHashBuffer":{"type":"Buffer","data":[184,120,154,65,53,245,124,105,108,171,104,246,56,137,173,255,86,124,161,17]},"announce":[],"urlList":[]}}