{"title":"Ashes of the Singularity (GOG)","uid":14125460,"size":4570746424,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b8c4d81d94bc1c1163940bd43e0211356cd6d2a1&amp;dn=Ashes+of+the+Singularity+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mercs215","files":4,"time":1459493165,"description":"Install instructions:\r\n- Run &quot;setup_ashes_of_the_singularity_2.4.0.10.exe&quot;\r\n- Play\r\nCredits: this release was made possible by Swapware Games Network!\r\nIf you like this game, support the developers and BUY IT!\r\nPLEASE REMEMBER TO SEED, MANY OTHERS WANT THIS! :)\r\n\r\nTitle: ASHES OF THE SINGULARITY\r\nGenre: Strategy - Real-time - Sci-fi\r\nWorks on: Windows (7, 8, 10)\r\nLanguages: Audio and text: Deutsch, English\r\nFeatures: single-player - multi-player - achievements\r\nReleased: March 31, 2016\r\nSize: 4.5 GB\r\nCompany: Oxide Games / Stardock Entertainment\r\nStore page: https://www.gog.com/game/ashes_of_the_singularity\r\n\r\nAbout:\r\nTake command of an entire world’s resources to build up massive armies, research new technologies, and annihilate all those who stand in your way! This new, massive-scale real-time strategy game will have you managing vast armies and fighting a war on multiple fronts against your enemies.\r\nWage a War Across an Entire World\r\nWith the unparalleled power of the world's first native 64-bit real-time strategy game engine, Ashes of the Singularity allows for maps of unprecedented size and detail. Over the course of your war, you will construct thousands of units with details that are normally reserved for games with only a few active units. Huge, kilometer-long Dreadnoughts can have a half dozen turrets, each with their own firing solutions. Smaller units will intelligently target enemies based on true line of sight physics since every unit's vision is based on line of sight instead of a radial fog of war.\r\nCommand Unique Units, Factions, Orbitals, and Abilities\r\nPlay as one of two factions, the Post Human Coalition and the sentient AI beings, the Substrate. Each side has their own unique array of orbital abilities, units, and research options, allowing you a variety of choices while you build your armies.\r\nExperience a Multi-Core, Non-Cheating AI Engine\r\nWhile Ashes has a strong multiplayer feature set, it includes what is arguably the most sophisticated AI engine ever devised for a real-time strategy game. Ashes of the Singularity requires a minimum of 4-cores on your CPU. In exchange, you get an AI that can create complex strategies and plays by the same rules as you do, providing a level of challenge never before seen in a single-player RTS.\r\nBattle with Friends in Multiplayer Matches\r\nCompete in ranked games against strangers or set up custom, un-ranked competitive or cooperative games with friends. Use our worldwide system to find where you stand in comparison to others and match up to players of like skill based on your numerical rankings.\r\nClaim Victory with Strategy, not Speed\r\nGames are won or lost based on your strategy, not how fast you can click. Deciding what technologies to research, where to send armies, how to manage your economy, and what units to construct are critical. As the conqueror of an entire world, you will be battling on multiple fronts with multiple armies. Scouting your opponent's strategy, determining their priorities, tracking where they are, and capturing strategically vital resources will lead to victory.\r\nEncounter Mysterious New Threats in Ascendancy Wars\r\nIn the year 2178, humanity has begun to evolve into god-like Post-Humans and are now expanding out into the galaxy. Learn more about how the Post-Human Coalition formed and what mysterious threats they encounter as they explore new worlds in this exciting campaign mode. Try the &quot;scenarios&quot; mode and take on unique challenges like &quot;King of the Hill,&quot; a scenario that pits you against an endless onslaught of enemies to see just how long you can survive.\r\n\r\nMinimum system requirements - Windows: 7 / 8.1 / 10 - 64bit only \r\nProcessor: Quad-core Intel / AMD Processor \r\nMemory: 6 GB RAM\r\nGraphics: 2 GB GDDR5 NVidia GeForce 660 / AMD R7 360 or equivalent \r\nSound: DirectX Compatible Sound Card\r\nDirectX®: 11\r\nHard disk space: 13 GB\r\nMouse, Keyboard \r\nOther: 1600x900 Display Resolution Minimum\r\n\r\nRecommended system requirements - Windows: 10 - 64bit only \r\nProcessor: Intel Core i5 or Equivalent\r\nMemory: 16 GB \r\nVideo: 4 GB DirectX 12 (Nvidia GTX 970 or AMD R9 390 Equivalent) Video Card Sound: DirectX Compatible Sound Card\r\nDirectX®: 12\r\nHard disk space: 13 GB\r\nMouse, Keyboard \r\nOther: 1920x1080 Display Resolution or Higher","torrent":{"xt":"urn:btih:b8c4d81d94bc1c1163940bd43e0211356cd6d2a1","amp;dn":"Ashes+of+the+Singularity+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8c4d81d94bc1c1163940bd43e0211356cd6d2a1","infoHashBuffer":{"type":"Buffer","data":[184,196,216,29,148,188,28,17,99,148,11,212,62,2,17,53,108,214,210,161]},"announce":[],"urlList":[]}}