{"title":"Marketing Maximilian - The Visual Ideology of a Holy Roman Emper","uid":10091411,"size":6701226,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b98eb062ca4eac45af5379b251ccfa91b936be65&amp;dn=Marketing+Maximilian+-+The+Visual+Ideology+of+a+Holy+Roman+Emper&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":-1,"time":1399162275,"description":"Larry Silver &quot;Marketing Maximilian: The Visual Ideology of a Holy Roman Emperor&quot;\nISBN: 0691130191 | 352 pages | PDF | 6,2 MB\n\n\nLong before the photo op, political rulers were manipulating visual imagery to cultivate their authority and spread their ideology. Born just decades after Gutenberg, the Holy Roman Emperor Maximilian I (1459-1519) was, Larry Silver argues, the first ruler to exploit the propaganda power of printed images and text. Marketing Maximilian explores how Maximilian used illustrations and other visual arts to shape his image, achieve what Max Weber calls &quot;the routinization of charisma,&quot; strengthen the power of the Hapsburg dynasty, and help establish the Austro-Hungarian Empire. A fascinating study of the self-fashioning of an early modern ruler who was as much image-maker as emperor, Marketing Maximilian shows why Maximilian remains one of the most remarkable, innovative, and self-aggrandizing royal art patrons in European history.\n\nSilver describes how Maximilian--lacking a real capital or court center, the ability to tax, and an easily manageable territory--undertook a vast and expensive visual-media campaign to forward his extravagant claims to imperial rank, noble blood, perfect virtues, and military success. To press these claims, Maximilian patronized and often personally supervised and collaborated with the best printers, craftsmen, and artists of his time (among them no less than Albrecht DÃƒÂ¼rer) to plan and produce illustrated books, medals, heralds, armor, and an ambitious tomb monument.","torrent":{"xt":"urn:btih:b98eb062ca4eac45af5379b251ccfa91b936be65","amp;dn":"Marketing+Maximilian+-+The+Visual+Ideology+of+a+Holy+Roman+Emper","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b98eb062ca4eac45af5379b251ccfa91b936be65","infoHashBuffer":{"type":"Buffer","data":[185,142,176,98,202,78,172,69,175,83,121,178,81,204,250,145,185,54,190,101]},"announce":[],"urlList":[]}}