{"title":"EVOLUTIONOLOGY - The Power Of Knowing How People Work","uid":13405074,"size":1604772,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ba8a8f128d07dfb55966425b26d7297fb90588da&amp;dn=EVOLUTIONOLOGY+-+The+Power+Of+Knowing+How+People+Work&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TopShelfBook","files":3,"time":1454426649,"description":"EVOLUTIONOLOGY: The Power Of Knowing How People Work: Your Life, Instinct, &amp; Emotional Intelligence (A Practical Guide) (2016)\r\n\r\n\r\n\r\n\r\nWho’s really in charge? Your intellect or your survival instinct? \r\nAre you smart, sophisticated and evolved, or are you an insecure, emotional group-thinker like the rest of us? \r\n\r\nEvolutionology represents a new approach to understanding the evolution of the human mind and our psychology. It describes how our survival instinct actually works, how it makes us think and behave, as well as how to regain control and heighten our emotional intelligence. \r\n\r\nWe humans like to believe that we are already evolved, civilized creatures because we are intelligent, but we are clearly not living intelligently. Our lives and world are filled with stress, anxiety and dysfunction. The reason is that our choices are not made by our intelligence, but rather by our survival instinct. Our fears and emotions are behind our decisions, and every action we take is designed to make us feel safer. We do what is comforting, not what is right. We seek corroboration, not truth. We react instead of choosing, thinking emotionally and declaring it intelligent. Seeing this is a necessary first step in order to evolve consciously. Until we do, our inner animal will continue holding the reins and controlling our thoughts and actions, while we will congratulate ourselves on our superiority, correctness, and wisdom. \r\n\r\nEvolutionology describes self-evident truths that can empower us to better understand people. When we understand how the mind works, we gain deeper insight into the human condition, and with it, the power to effectively and consciously change our lives. \r\n\r\nFEATURING: The Evolutionology Quiz. \r\nIn order to bring this to a very practical level, this book features a simple, online multiple choice quiz that will allow you to measure your degree of evolution. But, beware. The results may surprise you. \r\n\r\nBecome an Evolutionary. \r\nJoin The Evolution Revolution","torrent":{"xt":"urn:btih:ba8a8f128d07dfb55966425b26d7297fb90588da","amp;dn":"EVOLUTIONOLOGY+-+The+Power+Of+Knowing+How+People+Work","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba8a8f128d07dfb55966425b26d7297fb90588da","infoHashBuffer":{"type":"Buffer","data":[186,138,143,18,141,7,223,181,89,102,66,91,38,215,41,127,185,5,136,218]},"announce":[],"urlList":[]}}