{"title":"Ghost Rider","uid":4846224,"size":727182846,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bbd520d9b6e4c338173fee4ca2a3664f21f254b7&amp;dn=Ghost+Rider&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"wishmaster1267","files":1,"time":1239697980,"description":"Ghost Rider 2007\n\nFile Format: avi\n\nUnpack Size: 700.8.mb\n\nWindows user winrar will unpack tarball!\n\nWhen the motorcyclist Johnny Blaze finds that his father Barton Blaze has a terminal cancer, he accepts a pact with the Mephistopheles, giving his soul for the health of his beloved father. But the devil deceives him, and Barton dies in a motorcycle accident during an exhibition. Johnny leaves the carnival, his town, his friends and his girlfriend Roxanne. Years later Johnny Blaze becomes a famous motorcyclist, who risks his life in his shows, and he meets Roxanne again, now a TV reporter. However, Mephistopheles proposes Johnny to release his contract if he become the &quot;Ghost Rider&quot; and defeat his evil son Blackheart, who wants to possess one thousand evil\nsouls and transform hell on earth.\n\nThis is the story of Johnny Blaze who was only a teenaged stunt biker when he sold his soul to the devil known as Mephistopheles. Year later, Johhny is a world-renowned daredevil by day, but at night, he becomes the devil's legendary bounty hunter called the Ghost Rider. He is charged with finding evil souls on earth and bringing them back to hell. But when a twist of fate brings Johnny's long-lost love Roxanne back into his life, Johnny realizes he just might have a second chance at happiness if he can beat the devil Blackheart and win back his soul. To do so he'll have to defeat his nemesis and wayward son, Blackheart, whose plot to take over his father's realm will bring hell on earth unless Ghost Rider can stop him before it's too late.\n\nIn order to save his dying father, young stunt cyclist Johnny Blaze sells his soul to Mephistopheles and sadly parts from the pure-hearted Roxanne Simpson, the love of his life. Years later, Johnny's path crosses again with Roxanne, now a reporter, and also with Mephistopheles, who offers to release Johnny's soul if Johnny becomes the fabled, fiery Ghost Rider, a supernatural agent of vengeance and justice. Mephistopheles charges Johnny with defeating the despicable Blackheart, Mephistopheles's nemesis and son, who plans to displace his father and create a new hell even more terrible than the old one.\n\n\n\n\nPlease SEED!\n\nsorry for not seeding my hard drive burn out Now I am back up and seeding!","torrent":{"xt":"urn:btih:bbd520d9b6e4c338173fee4ca2a3664f21f254b7","amp;dn":"Ghost+Rider","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbd520d9b6e4c338173fee4ca2a3664f21f254b7","infoHashBuffer":{"type":"Buffer","data":[187,213,32,217,182,228,195,56,23,63,238,76,162,163,102,79,33,242,84,183]},"announce":[],"urlList":[]}}