{"title":"Basic Black-Scholes: Option Pricing and Trading","uid":9300880,"size":41424721,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bbff8c3fc9efbd953c481b14e73c70a7de98366f&amp;dn=Basic+Black-Scholes%3A+Option+Pricing+and+Trading&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"moneymakestheworldgoround","files":-1,"time":1386238960,"description":"THE AUTHOR: Dr. Crack studied PhD-level option pricing at MIT and Harvard Business School, taught undergraduate and MBA option pricing at Indiana University (winning many teaching awards), was an independent consultant to the New York Stock Exchange, worked as an asset management practitioner in London, and has traded options for over ten years. This unique mixture of learning, teaching, consulting, practice, and trading is reflected in every page. SUMMARY OVERVIEW: This revised second edition of Basic Black-Scholes gives extremely clear explanations of Black-Scholes option pricing theory, and discusses direct applications of the theory to option trading. The presentation does not go far beyond basic Black-Scholes for three reasons: First, a novice need not go far beyond Black-Scholes to make money in the options markets; Second, all high-level option pricing theory is simply an extension of Black-Scholes; and Third, there already exist many books that look far beyond Black-Scholes without first laying the firm foundation given here. The trading advice does not go far beyond elementary call and put positions because more complex trades are simply combinations of these. WHAT MAKES THIS BOOK SPECIAL OR UNIQUE?: -It contains the basic intuition you need to trade options for the first time, or interview for an options job. -Honest advice about trading: there is no simple way to beat the markets, but if you have skill this advice can help make you money, and if you have no skill but still choose to trade, this advice can reduce your losses. -Full immersion treatment of transactions costs (T-costs). -Lessons from trading stated in simple terms. -Stylized facts about the markets (e.g., how to profit from reversals, when are T-costs highest/lowest during the trading day, implications of the market for corporate control, etc.). -How to apply (European-style) Black-Scholes pricing to the trading of (American-style) options. -Leverage through margin trading compared to leverage through options. -Black-Scholes option pricing code for the HP17B, HP19B, and HP12C. -Two downloadable spreadsheets. The first allows the user to forecast T-costs for option positions using simple models. The second allows the user to explore option sensitivities including the Greeks. -Practitioner Bloomberg Terminal screenshots to aid learning. -Simple discussion of continuously-compounded returns. -Introduction to &quot;paratrading&quot; (trading stocks side-by-side with options to generate additional profit). -Unique &quot;regrets&quot; treatment of early exercise decisions and trade-offs for American-style calls and puts. -Unique discussion of put-call parity and option pricing. -How to calculate Black-Scholes in your head in 10 seconds (also in Heard on The Street: Quantitative Questions from Wall Street Job Interviews). -Special attention to arithmetic Brownian motion with general pricing formulae and comparisons to Bachelier (1900) and Black-Scholes. -Careful attention to the impact of dividends in analytical American option pricing. -Dimensional analysis and the adequation formula (relating FX call and FX put prices through transformed Black-Scholes formulae). -Intuitive review of risk-neutral pricing/probabilities and how and why these are related to physical pricing/probabilities. -Careful distinction between the early Merton (non-risk-neutral) hedging-type argument and later Cox-Ross/Harrison-Kreps risk-neutral pricing -Simple discussion of Monte-Carlo methods in science and option pricing. -Simple interpretations of the Black-Scholes formula and PDE and implications for trading. -Careful discussion of conditional probabilities as they relate to Black-Scholes. -Intuitive treatment of high-level topics e.g., bond-numeraire interpretation of Black-Scholes (where N(d2) is P*(ITM)) versus the stock-numeraire interpretation (where N(d1) is P**(ITM)).","torrent":{"xt":"urn:btih:bbff8c3fc9efbd953c481b14e73c70a7de98366f","amp;dn":"Basic+Black-Scholes%3A+Option+Pricing+and+Trading","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbff8c3fc9efbd953c481b14e73c70a7de98366f","infoHashBuffer":{"type":"Buffer","data":[187,255,140,63,201,239,189,149,60,72,27,20,231,60,112,167,222,152,54,111]},"announce":[],"urlList":[]}}