{"title":"The Sword - Gods Of The Earth (Flac Level8)","uid":4565397,"size":348782839,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:bc1cb8477ae8b428c9712f5766341687a6cfba3f&amp;dn=The+Sword+-+Gods+Of+The+Earth+%28Flac+Level8%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"grayghost55","files":17,"time":1228851508,"description":"The Sword - Gods of the Earth\n\n\nAudio CD (April 1, 2008)\nOriginal Release Date: March 24, 2008\nNumber of Discs: 1\nLabel: Kemado\n\n\n\n\n\n\nBY AUSTIN POWELL\n\n\n\nThe Sword\nGods of the Earth (Kemado)\n\n&quot;Hear the horns, pounding hooves,&quot; prophesies JD Cronise in &quot;Lords,&quot; as galloping guitars conjure &quot;visions of cities aflame.&quot; &quot;Die by the sword or in chains.&quot; The omen could pass as a mission statement for Austin&amp;#039;s premier alchemists, who live by the code and take no prisoners on sophomore LP Gods of the Earth. Like the Four Horsemen of the Apocalypse, the Sword seeks and destroys, carving chronicles of serpents and sorcery without retracing the Nordic frost of 2005 debut Age of Winters. From the opening preface, &quot;The Sundering,&quot; it&amp;#039;s apparent that Gods transcends the Sabbath worship of its contemporaries, a clearer sense of control and pacing underscoring the biblical tales of wrath and retribution. The intricate, intertwined guitars of Cronise and Kyle Shutt lead the ventures for &quot;The Frost-Giant&amp;#039;s Daughter&quot; and &quot;Maiden, Mother &amp; Crone,&quot; while &quot;How Heavy This Axe&quot; and &quot;To Take the Black,&quot; not to mention its acoustic reprise (included as a hidden bonus), veer into a void of classic metallurgy. Devastatingly brutal yet altogether timeless, the doom-laden onslaught of &quot;Fire Lances of the Ancient Hyperzephyrians&quot; and &quot;Under the Boughs&quot; pillage the remains before closing with an epic, two-part suite, the turbulent tidal rush of &quot;The Black River&quot; and &quot;The White Sea,&quot; a seven-minute instrumental odyssey that unearths a leviathan. Choose your fate.\n\n****\n\n\n\n\n\n\n---------------------------------------------------------------------\nThe Sword - Gods Of The Earth\n---------------------------------------------------------------------\n\nArtist...............: The Sword\nAlbum................: Gods Of The earth\nGenre................: Stoner Rock?Heavy Metal\nSource...............: CD\nYear.................: 2008\nRipper...............: EAC (Secure mode) / LAME 3.92 &amp; Asus CD-S520\nCodec................: Free Lossless Audio Codec (FLAC)\nVersion..............: reference libFLAC 1.2.1 20070917\nQuality..............: Lossless, (avg. compression: 68 %)\nChannels.............: Stereo / 44100 HZ / 16 Bit\nTags.................: -\nInformation..........:\n\nRipped by............: Grayghost on 12/8/2008\nPosted by............: Grayghost on 12/8/2008\nNews Server..........: news.astraweb.com\nNews Group(s)........: alt.binaries.sounds.mp3.metal.full.albums\n\nIncluded.............: NFO, M3U, LOG, CUE\nCovers...............: Front Back\n\n---------------------------------------------------------------------\nTracklisting\n---------------------------------------------------------------------\n\n1. (00:02:05) - The Sundering\n2. (00:05:02) - The Frost-Giant&amp;#039;s Duaghter\n3. (00:03:06) - How Heavy This Axe\n4. (00:04:58) - Lords\n5. (00:03:28) - Fire Lances The Ancient Hyperzephyrians\n6. (00:04:41) - To Take The Black\n7. (00:03:59) - Maiden, Mother &amp; Crone\n8. (00:04:57) - Under The Boughs\n9. (00:05:53) - The Black River\n10. (00:07:23) - The White Sea\n11. (00:02:23) - Untitled (Hidden Track)\n\nPlaying Time.........: 00:47:55\nTotal Size...........: 329.53 MB\n\nNFO generated on.....: 12/8/2008 8:39:54 PM\n\n\n:: Generated by Music NFO Builder v1.20 - www.nfobuilder.com ::\n\n\n\n\n\n\nAs if their name and albums weren&amp;#039;t enough to tip you off, the Sword like to do two things: make references to myths and fantasy, and blast your ears off with eruptions of fiery metal.\n\nAnd in their second album &quot;Gods of the Earth,&quot; this Austin band proceeds to do both -- but with greater intensity than in their debut. Not only do they have Black-Sabbath-style muscle and power that sweeps you off like a tidal wave, but also a wild flexibility that only promises to become more hypnotic in the future.\n\nThe first song eases you into the music with a nimble, quiet guitar melody... right before that swell of thunderous bass explodes onto the scene, and it turns into a full-fledged metal anthem. But from the way they play it, you can tell that this is just the buildup.\n\nIt&amp;#039;s followed by the epic buildup and rapid ascent of &quot;How Heavy This Axe,&quot; a blazing war anthem (&quot;So many men have fallen/So many more must die/Cut down like wheat beneath the scythe!&quot;), and &quot;Lords&amp;#039;&quot; tight knifelike riffs twined with heavy grimy clouds of bass. And, of course, lyrics that sound like they were written for some enormous high-fantasy novel (&quot;The dukes of the marches have ordered their archers/To shoot all outlanders on sight&quot;).\n\nSo you have a pretty good idea of what the remaining songs are going to be, and the Sword rushes on through them like a brush fire. A rollicking hard-rocker that simultaneously sounds like a stampede and a car revving, a meditative folk-metal anthem, blazing yowlfests, tribal metal, eruptions of accelerating bass and wild upward-spiraling riffs.\n\nBy the time you get to &quot;The White Sea,&quot; you&amp;#039;ll probably feel kind of dizzy. Fortunately the album finally slows to a stately dark cloud of grimy bass, with one outburst of wailing riffs near the end.\n\nWhen you get down to it, all the songs on here sound like the soundtrack to some heavy-metal fantasy movie, with a heavy dose of Norse mythology -- lots of bloody battles, mythical goddesses, destroyed ruins, wizards, damsels, legends, creepy forests, and fantastical/mythic stuff like that. And they&amp;#039;ll happily blow your ears off too.\n\n&quot;Gods of the Earth&quot; is just as wild, heavy and rock-hard as the Sword&amp;#039;s debut album, but they rev up the tempo with this one -- just listen to the speed of &quot;Under the Boughs.&quot; We get raw, rough, intertwined basslines race along at sixty MPH, pausing occasionally for the sharp-edged electric riffs, elaborate acoustic bits, and some solid drumming. But the powerful bass playing is what really pushes this epic, fast-moving music along.\n\nJD Cronise&amp;#039;s voice gets a bit buried in the mix, but he yowls nicely when you can hear him. The lyrics are probably the weakest point. They&amp;#039;re colourful and evocative (&quot;They come with teeth and tusks and talons/They come with horns and hooves and claws/A wailing cry is heard deep within the forest...&quot;) but their lyrics get very stilted at times (&quot;Our legends tell of weapons/Wielded by kings of old/Crafted by evil wizards/Unholy to behold&quot;).\n\nIn fact, they&amp;#039;re at their strongest when they don&amp;#039;t try too hard, such as in the relatively simple &quot;Maiden, Mother and Crone&quot;: &quot;Walk not down that road/I can not tell you where it goes/Ask me no more questions/Some things you weren&amp;#039;t meant to know.&quot;\n\n&quot;Gods of the Earth&quot; suffers from some awkward lyrics, but their muscular, blazing, D&amp;D-geeky brand of metal is almost powerful enough to drown that out. Definitely worth hearing.\n\nTracker - The Pirate Bay","torrent":{"xt":"urn:btih:bc1cb8477ae8b428c9712f5766341687a6cfba3f","amp;dn":"The+Sword+-+Gods+Of+The+Earth+%28Flac+Level8%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc1cb8477ae8b428c9712f5766341687a6cfba3f","infoHashBuffer":{"type":"Buffer","data":[188,28,184,71,122,232,180,40,201,113,47,87,102,52,22,135,166,207,186,63]},"announce":[],"urlList":[]}}