{"title":"Max.Payne.3.Update.v1.0.0.81-RELOADED","uid":7877270,"size":53565506,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:bc257a9c39f0d52ee8f45b1638e66373f6d82366&amp;dn=Max.Payne.3.Update.v1.0.0.81-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"scene4all","files":-1,"time":1354378563,"description":"nERv\n\nMax Payne 3 Update v1.0.0.81 (c) Rockstar Games\n\n12/2012 :..... RELEASE.DATE .. PROTECTION .......: Gameshield\n- :.......... DISC(S) .. GAME.TYPE ........: Shooter\n\n* The Kill screen now shows what weapon and burst the enemy used to kill you\n* Fixed an issue where players would occasionally get stuck in cover\n* Fixed an issue where players would occasionally appear invisible\n* Fixed an issue where game modes could appear to be over 100% full\n* Fixed an issue where occasionally a Loadout slot could overwrite another\nLoadout slot at the start of a round of Gang Wars\n* Fixed an issue where a party would have trouble loading into a new game\nafter a party member had left\n\nThe award-winning Max Payne franchise put players in the role of Max Payne, a\nhard-boiled New York City detective with a penchant for violence, out to\navenge the death of his family. The latest installment delivers more of the\nclassic elements and hyper-intense action that fans have come to love, while\nmoving the story of Max in a new direction.\n\nSince leaving the NYPD and New York itself behind, Max has drifted from bad\nto worse. Double-crossed and a long way from home, Max is now trapped in a\ncity full of violence and bloodshed, using his weapons and instincts in a\ndesperate search for the truth and a way out.\n\n1. Install the updates.\n2. If you havn't already, copy over the &quot;profiles&quot; dir, found in the Crack\ndir to your DocumentsRockstar GamesSocial Club dir.\n(%USERPROFILE% DocumentsRockstar Games Social Club).\n3. Copy over the cracked content, ie. the rest of the files, from the Crack\ndir to your installation dir.\n4. Play the game offline. Make sure that all the games exe files are blocked\nfrom going online by using your system or third party firewall to prevent\noutgoing connections on every game exe file. Do this before starting the\ngame. Going online and using your own profile might be possible, but it\nis at your own risk.\n5. Support the software developers. If you like this game, BUY IT!","torrent":{"xt":"urn:btih:bc257a9c39f0d52ee8f45b1638e66373f6d82366","amp;dn":"Max.Payne.3.Update.v1.0.0.81-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc257a9c39f0d52ee8f45b1638e66373f6d82366","infoHashBuffer":{"type":"Buffer","data":[188,37,122,156,57,240,213,46,232,244,91,22,56,230,99,115,246,216,35,102]},"announce":[],"urlList":[]}}