{"title":"Authentic Man Program - Power of presence -","uid":4008334,"size":2603509106,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:bd415511538210a559b94f49faec0ab8ef640bad&amp;dn=Authentic+Man+Program+-+Power+of+presence+-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pelon_pirate","files":9,"time":1201952800,"description":"Authentic Man Program - Power of Presence\n\n\nLearn The Art of Tapping Into Your Own 100% Authentic Self And Create Wild, Sexy, Deep And Profound Connections With Your Ideal Women.\n\nThe Purpose of AMP:\n\n#1 Countless men are realizing that no matter how amazing their lives are, they still want to take their relating with women to a new level \n\n#2 Countless men are immediately having much more mutually-rewarding &amp; exciting interactions with women by making a fundamental shift internally\n \n\nThis experiential, interactive 3-DVD set covers THE FIRST and most important piece of solid Inner Game: Presence.\n\n\nIt\\&amp;#039;s PACKED with the no-B.S., concrete, real-world training material from our sellout AMP weekend intensives. The insights and breakthroughs you\\&amp;#039;ll receive from this can directly impact your interactions with women, IMMEDIATELY.\n\n\n* Learn how YOU can turn women into a giddy, giggling mess that has you enjoying each other more &amp; more. &lt;see it demonstrated&gt; \n\n* Learn the practice that will have women stop their conversations and turn to welcome you as you approach, without you saying a word. \n\n* Learn why men who do specific physical practices are better able to approach radiant, gorgeous women. (We\\&amp;#039;ll show you these practices, so you can do the same) \n\n* Ever had a difficult time getting a second date with a woman you really liked? Chances are you didn\\&amp;#039;t take THIS aspect of her experience into account. Discover what has women eager to see you again. \n\n* How to \\&quot;gift\\&quot; a woman with such a depth of Presence, even for a moment, that will have the most \\&quot;short attention span party girls\\&quot; remembering you for the rest of the night.  \n\n* A way to authentically handle \\&quot;screwing up\\&quot; that actually has her feel MORE trust, connection and attraction for you. &lt;see it demonstrated&gt; \n Learn the subtle shift of attention that allows you to experience yourself through her eyes. (This is absolutely key for having natural, flowing interactions with women) \n\n* Identify emotional blocks that are screwing over your interactions with women, and learn how to resolve them without years of therapy. (You\\&amp;#039;ll quickly learn how being \\&amp;#039;authentic\\&amp;#039; is as \\&quot;alpha\\&quot; as it gets). \n\n* If you\\&amp;#039;ve ever been LJBF\\&amp;#039;d (Let\\&amp;#039;s Just Be Friends), chances are you\\&amp;#039;ve been holding back. Learn a way to access your masculine power that will keep you out of the \\&quot;just friends\\&quot; category. \n\n* How to sharpen your Presence in a way that has women veering out of their way to bump into our AMP grads to get their attention. (No funny hats or flashy belt buckles required!) \n\n* Learn how to focus your Presence into a compelling inner force that has women feeling exhilarated and alive, just by being around you.   When sharpened, your dates will feel like you\\&amp;#039;re already making love...\n\n* Learn how to be with women during sex that will have them want to give you EVERYTHING. (Sex will never be the same again)  \n\n* Learn how when you \\&quot;polarize\\&quot; your masculine energy women are naturally drawn to you. See how a participant demo follows our coaching and leaves a woman so \\&amp;#039;drawn in\\&amp;#039; that she\\&amp;#039;s actually at a loss for words... and loving it. \n\n* Learn to enjoy being Present, for its own sake, having nothing to do with women and watch the benefits ripple out into all the areas and relationships of your life. \n\n &lt;a href=&quot;\nhttp://authenticmanprogram.com/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://authenticmanprogram.com/index.php&lt;/a&gt;","torrent":{"xt":"urn:btih:bd415511538210a559b94f49faec0ab8ef640bad","amp;dn":"Authentic+Man+Program+-+Power+of+presence+-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd415511538210a559b94f49faec0ab8ef640bad","infoHashBuffer":{"type":"Buffer","data":[189,65,85,17,83,130,16,165,89,185,79,73,250,236,10,184,239,100,11,173]},"announce":[],"urlList":[]}}