{"title":"Stranger From Shaolin 1977.avi","uid":5638287,"size":729010176,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:be00457b8d909137900156bd519dfdd2be2bd9c2&amp;dn=Stranger+From+Shaolin+1977.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"icek00l","files":1,"time":1276978174,"description":"Stranger from shaolin is a Classic old'-school look at the legendary development of Wing-Chun kuen! If you study Wing-chun or any style of Chinese kung-fu, it is worth the price! \nThis movie shows some rare wing-chun techniques as well, such as 'mook-hyuen' (wooden-ring) skills. \n\n\nPlot: When her entire family is killed by the occupying Manchus, Yim escapes to Shaolin temple disguised as a man. There she begins to teach herself kung fu, secretly watching the abbot, incorporating her own techniques into a new fighting style... \n\nOverview: When her entire family is killed by the occupying Manchus, Yim Wing Chun (Wong Hang Sau) narrowly escapes to Shaolin temple. Disguised as a man, she persuades the abbot to let her stay and is given the job of fetching water from the well for the students. This 'job' is actually the start of her training, which builds up her strength and, as she frequently has to climb to the bottom of the well, teaches her to work in confined spaces. Wing Chun begins to teach herself kung fu, from secretly watching the abbot, incorporating her own techniques into a new style ideal for close quarter fighting. The other monks soon realize that she is not quite the man she says she is but by that time strong bonds are formed and they are supportive of her mission for revenge against the Manchus, especially as they learn that the Manchus intend to attack Shaolin. \n\nCast:\tCecilia Wong Hang-Sau  ||  Thompson Kao Kang  ||  Chang Yi-Tao  ||  Tony Liu Jun-Guk  ||  Wong Kwok-Leung  ||  Dang Tak-Cheung  ||  Bruce Cheung Mong  ||  Chan Lau  ||  Lee Ye-Min  ||  Kuen Yat-Chu  ||  Baak Wong-Gei","torrent":{"xt":"urn:btih:be00457b8d909137900156bd519dfdd2be2bd9c2","amp;dn":"Stranger+From+Shaolin+1977.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be00457b8d909137900156bd519dfdd2be2bd9c2","infoHashBuffer":{"type":"Buffer","data":[190,0,69,123,141,144,145,55,144,1,86,189,81,157,253,210,190,43,217,194]},"announce":[],"urlList":[]}}