{"title":"Standup Comedy - Dom Irrera Greatest Hits Volume One SpaceEdge","uid":4319889,"size":76153958,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:becaafcbdc15ed3c65a0426eecdd9c007dfbf33e&amp;dn=Standup+Comedy+-+Dom+Irrera+Greatest+Hits+Volume+One+SpaceEdge&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rambam1776","files":22,"time":1217371682,"description":"I finally got an invitation to join Demonoid, where my Google searches for torrents I cannot find here keep showing great stuff. I spent all last week grabbing comedy albums which I am now going to upload here. Other than going to the trouble of fixing tags and getting artwork and details, these torrents are as the original posters seeded them. I am not endorsing or recommending all of these. In fact, I think some of them suck. However, there is a major lack of well seeded comedy torrents here, and I hope to encourage more people to post new ones. Also, who says *MY* taste matches somebody elses? The reviews are from ALLMUSIC or from AMAZON. As usual, much thanks to the OPs who put these out and about.\n\nRambam1776\n\n\n\nDOM IRRERA ? GREATEST HITS\n\nDomenick Jack Irrera (born 1948), originally from Philadelphia, is a stand-up comedian. Much of his material is in the form of stories about his life, especially his childhood years and growing up in an Italian-American family, which contributes to the &quot;natural&quot; feel of his performances.\nIrrera has appeared on The Oprah Winfrey Show, The View, The Tonight Show with Jay Leno, and The Late Show with David Letterman, and has made numerous cameo appearances on TV shows.\n[edit] Trivia\n \tIrrera is a regular performer at the Cat Laughs comedy festival in Kilkenny, he is making his 13th appearance in a row at the 2008 festival. \n \tIrrera auditioned to be a castmember for Saturday Night Live&amp;#039;s 1980-1981 season. \n \tIrrera made a brief appearance as the limo driver in the film The Big Lebowski. \n \tIrrera appeared on an episode of the NBC sitcom Seinfeld as Ronnie Kaye, the Prop Comic. His character had a prop water gun that George Costanza mistook for a real gun, ruining Jerry Seinfeld&amp;#039;s show. \n \tIrrera&amp;#039;s ex wife, Lisa Mende, also appeared on Seinfeld. She played Carol, the mother of an &quot;ugly baby.&quot; The two still often work on the same bill in comedy clubs. \n \tIrrera made a cameo as a stand-up comedian in a bar in the 1998 mobster-spoof film The Godson (film) which starred Kevin McDonald, Rodney Dangerfield, and Dom DeLuise. \n \tIrrera made 11 appearances as himself on the animated series Dr. Katz, Professional Therapist, and is the only comic to appear in all six seasons. \nWas voted one of the hundred funniest comics of all time by Comedy Central. Two time Emmy winner for his HBO Special&quot;One Night Stand&quot; and Showtime &quot;Full Frontal Comedy&quot;\n \tIrrera appeared as a character called &quot;scooter&quot; on &quot;Everybody Loves Raymond&quot; \n \tIrrera appeared as a character called &quot;Spiro&quot; on &quot;The King of Queens&quot; \n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Dom_Irrera&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Dom_Irrera&lt;/a&gt;","torrent":{"xt":"urn:btih:becaafcbdc15ed3c65a0426eecdd9c007dfbf33e","amp;dn":"Standup+Comedy+-+Dom+Irrera+Greatest+Hits+Volume+One+SpaceEdge","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"becaafcbdc15ed3c65a0426eecdd9c007dfbf33e","infoHashBuffer":{"type":"Buffer","data":[190,202,175,203,220,21,237,60,101,160,66,110,236,221,156,0,125,251,243,62]},"announce":[],"urlList":[]}}