{"title":"How Finance Is Shaping the Economies of China, Japan, and Korea ","uid":9369745,"size":21072907,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bf5644d4c11f816f23e9f87beb0eb7cbac9681c0&amp;dn=How+Finance+Is+Shaping+the+Economies+of+China%2C+Japan%2C+and+Korea+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":5,"time":1387504136,"description":"This volume connects the evolving modern financial systems of China, Japan, and Korea to the development and growth of their economies through the first decade of the twenty-first century. It also identifies the commonalities among all three systems while accounting for their social, political, and institutional differences. \nEssays consider the reforms of the Chinese economy since 1978, the underwhelming performance of the Japanese economy since about 1990, and the growth of the Korean economy over the past three decades. These economies engaged in rapid catch-up growth processes and share similar economic structures. Yet while domestic forces have driven each country's financial trajectory, international short-term financial flows have presented opportunities and challenges for them all. The nature and role of the financial system in generating real economic growth, though nuanced and complex, is integral to these countries. The result is a fascinating spectrum of experiences with powerful takeaways.","torrent":{"xt":"urn:btih:bf5644d4c11f816f23e9f87beb0eb7cbac9681c0","amp;dn":"How+Finance+Is+Shaping+the+Economies+of+China%2C+Japan%2C+and+Korea+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf5644d4c11f816f23e9f87beb0eb7cbac9681c0","infoHashBuffer":{"type":"Buffer","data":[191,86,68,212,193,31,129,111,35,233,248,123,235,14,183,203,172,150,129,192]},"announce":[],"urlList":[]}}