{"title":"The Name of the Wind - Patrick Rothfuss.mobi","uid":7368590,"size":1061202,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bf92c86364901ed18e8107405f6aae33a8fc219a&amp;dn=The+Name+of+the+Wind+-+Patrick+Rothfuss.mobi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"488331284","files":-1,"time":1340175520,"description":"Meet Dieter Resnick. Dieter is the sole child of an abusive single father, a perennial schoolyard brawler, and Ted Binion High's number one academic prospect. Dieter is terrified of staying poor. He has few friends and is absolutely obsessed with earning a college scholarship. He's also a latent mage--one of the few humans left that can bend the manaflows to their will.\n\nToo bad no one told him. Now a boy is dead.\n\nMeet Rei Acerba Bathory. Rei is a second year student at Elliot College, the premiere magical training academy in North America. She's also on an all-liquid diet. Rei acquired her odd speech and mannerisms living among her centuries-old kin--strange vampiric creatures that have carved out the Midwest as their playground. She can kill a man without blinking, but has a serious weakness for puppies. Thanks to a childhood spent living cloistered from the public, Rei knows little of modern society. She'd do well to make some friends, but her fellow trainees despise her. Rei is the first of her kind to be admitted, and many hope to make her the last.\n\nDieter was raised in the grimy outskirts of Las Vegas. Rei was homeschooled in a Chicago mansion. Both are on their way to Elliot College. Both believe the other is a creature of idle fantasy. In ten hours, they're going to be at the center of a war fought by shadow actors. In eleven hours, they're going to become a weft-pair, bound together by the most sacred spell in the magic canon. And in twelve hours? Well, in twelve hours, they've got to get to class...\n\nZero Sight is a full-length contemporary fantasy novel, 107,000 words or about 350 pages. The entire novel is provided DRM-free based on reader requests. Because of foul mouths and graphic situations, Zero Sight is only recommended for readers 16 years and older.","torrent":{"xt":"urn:btih:bf92c86364901ed18e8107405f6aae33a8fc219a","amp;dn":"The+Name+of+the+Wind+-+Patrick+Rothfuss.mobi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf92c86364901ed18e8107405f6aae33a8fc219a","infoHashBuffer":{"type":"Buffer","data":[191,146,200,99,100,144,30,209,142,129,7,64,95,106,174,51,168,252,33,154]},"announce":[],"urlList":[]}}