{"title":"Superman 3 Hour Salkind International Cut","uid":4532118,"size":1459672768,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bfb2f930c32b3722c132c91ccbefc919a1767078&amp;dn=Superman+3+Hour+Salkind+International+Cut&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"enigs","files":2,"time":1227595458,"description":"I recently finished downloading the 2 DVD original set and decided to make these smaller versions for those who can't manage to download 7 gigs from 2 seeds.\n\nDescription:\n\n&quot;Superman The Movie was released on 15th December 1978 in America.\n\nRichard Donner's initial cut ran just over three hours (this is confirmed by a 1981-82 issue of Starlog Magazine), and it was possibly the version John Williams recorded his legendary score to.\n\nWhen the TV rights to &quot;Superman&quot; reverted from Warner Bros. to Alexander Salkind in 1981, the door was open for the Salkind company to create a version for television unlike what the public saw in theatres. Salkind prepared a 3 hour, 8 minute version (which we'll call the &quot;Salkind International Extended Cut&quot;) for worldwide television release, with 45 minutes of unseen footage and additional music by John Williams, all of which was deleted from the 1978 theatrical version. Stations and networks around the world could then re-edit this version at their discretion.\n\nThe first network TV broadcast in the U.S. was in February 1982 on ABC (which had a contract with Salkind for the television rights to his films). ABC's 3 hour-2 minute cut of Superman originally was broadcast over two nights. On the first night it premiered, the film stopped when Lois Lane was falling from the helicopter (the picture froze creating a cliffhanger ending part one)...the next evening, there was a re-cap and the film continued to the end. This expanded version was repeated in November of the same year, this time shown in one night. The next two ABC showings after that was the theatrical version. Since the Salkinds would get money for every minute of footage shown on TV, they crammed in as much footage as possible for the TV Networks. Richard Donner was not consulted on any of the extended versions. This was before &quot;Allen Smithee&quot; became a household name, so perhaps if the helpless director had the chance in those days, he would have his name removed from the credits.\n\n\nWhen the rights reverted back to Warner Bros. in 1985, CBS aired the film one last time on network television in its theatrical version. Then in 1988, when &quot;Superman&quot; went into syndication (following a play-out run on pay cable), TV stations were offered the extended cut or the theatrical cut in 1988. The stations that showed the extended cut edited the second half to squeeze in commercials and 'What happened yesterday flashbacks'. In 1994 (following a pay cable reissue and obligatory run on USA Network), WB offered the &quot;Salkind International Extended Cut&quot; which was shown in Los Angeles on KCOP in its 3 hour-8 minute version (U.S. fans commonly call it the &quot;KCOP Version&quot;, because it aired domestically first on KCOP). It was screened on certain stations around America too...for example, on Saturday, July 27, 1994, an ABC affiliate called WJLA Channel 7 in Washington aired the &quot;KCOP/Salkind International Extended&quot; version of Superman with three further scenes that will be explained as we go along. It aired part one from 9:30 PM to 11:30 PM and then broke for 30 minutes of news and then aired part two from 12:00 AM to 2:00 AM. This version was also shown in other parts of the world, but still remains unseen by a large number of fans.\n\nThe extended version of Superman has never been broadcast in England. The first showing of the theatrical version on UK TV appeared on 4th Jan 1983 on ITV. In the mid-eighties 1985 RTE (Ireland) television aired the extended versions of Superman 1 and 2 in one night. It ran from roughly 3 o'clock 'til 9 o'clock including the odd commercial and a break for the 6.00 news. The quality of the extended version is inferior to the home video release because it was mastered in 16mm (using the &quot;film chain system&quot;) and a mono sound mix done as TV was not yet broadcasting in stereo. This has been the only available format for the extended version but home video releases have been mastered from the 35mm elements and in stereo.","torrent":{"xt":"urn:btih:bfb2f930c32b3722c132c91ccbefc919a1767078","amp;dn":"Superman+3+Hour+Salkind+International+Cut","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bfb2f930c32b3722c132c91ccbefc919a1767078","infoHashBuffer":{"type":"Buffer","data":[191,178,249,48,195,43,55,34,193,50,201,28,203,239,201,25,161,118,112,120]},"announce":[],"urlList":[]}}