{"title":"Crossfire (Eclipse Comics)","uid":8927890,"size":447230854,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:c0b87c0b029e5157579aba1f4b944f3775add142&amp;dn=Crossfire+%28Eclipse+Comics%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Ichthypod_Crane","files":27,"time":1379399280,"description":"After a brief nap, the Eclipse Comics Upload Project yawns, scratches its swollen, hairy balls and shuffles on with 'Crossfire' by Mark Evanier and Dan Spiegle!\n\nWiki waki woo says:\n\nCrossfire is a comic book series created by writer Mark Evanier and artist Dan Spiegle originally for Eclipse Comics. It was a spin off from DNAgents, which was also written by Evanier. \n\nThe series featured the adventures of a Los Angeles bail bondsman named Jay Endicott; Endicott assumed the identity of the original Crossfire, a notorious criminal, who was murdered in the midst of one of his crimes. Endicott decided to use the costume to fight crime as a superhero while impersonating the original to take advantage of his reputation to secure, and then hunt down, underworld contacts.\n\nIn an early adventure, Endicott met the DNAgents and fell in love with their member, Rainbow. He was also seriously wounded and while in the care of the Agents' organization, he was given specific enhancements to his body such as replacing his blood with an artificial chemical that mimics the characteristics of blood more efficiently.\n\nIn addition to the superhero adventures, Evanier used his considerable experience in the Hollywood entertainment industry to feature secondary stories of characters trying to work and survive in that business. In addition, Evanier also contributed lengthy essays on the subject in each issue with illustrations by Sergio Aragones, a tradition continued in the later series, Hollywood Superstars for Epic Comics (which, hopefully is still available on TPB).\n\nThis torrent contains the complete series, which ran for 26 issues. Thank you Messrs. Evanier and Spiegle! Thank you scanners! Get it, seed it!","torrent":{"xt":"urn:btih:c0b87c0b029e5157579aba1f4b944f3775add142","amp;dn":"Crossfire+%28Eclipse+Comics%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0b87c0b029e5157579aba1f4b944f3775add142","infoHashBuffer":{"type":"Buffer","data":[192,184,124,11,2,158,81,87,87,154,186,31,75,148,79,55,117,173,209,66]},"announce":[],"urlList":[]}}