{"title":"Enki Bilal - The Nikopol Trilogy [CBR]","uid":4921490,"size":92055309,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:c180a7ebb8c69d751b0ee68394608859251bfe51&amp;dn=Enki+Bilal+-+The+Nikopol+Trilogy+%5BCBR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ill88eagle","files":-1,"time":1243681739,"description":"Enki Bilal - The Nikopol Trilogy [CBR]\nThe Carnival of Immortals - The Woman Trap - Equator Cold\n\nFrom Publishers Weekly:\n&quot;The Nikopol Trilogy brings together three previously published volumes Carnival of Mortals, Woman Trap and Cold Equator all impressive works of imagination meticulously written, drawn and colored by European comics artist Bilal. It's the year 2023 and Alcide Nikopol has been revived from a state of suspended animation after 30 years orbiting Earth. In the meantime, the planet has suffered two nuclear wars, and France is ruled by the ruthless dictator J.F. Choublanc. The immortal gods of Egyptian antiquity have also reawakened to revive their rule over humanity, and they now hover above the crumbling technopolis of Paris in a massive stone pyramid/airship. Horus, the renegade falcon god, takes possession of Nikopol's body, rendering him immortal, and concocts a conspiracy to overthrow the Choublanc regime. When Nikopol cracks under the pressure of Horus's possession, he is reduced to muttering the poetry of Baudelaire while he wanders the halls of a mental hospital. &quot;Woman Trap&quot; picks up two years later in a war-torn London. Blue-haired news correspondent Jill Bioskop dispatches stories 30 years into the past using a device called a scriptwriter, while she takes pills to eradicate the bloody memories of men she has murdered. In &quot;Cold Equator&quot; the story is further complicated as Nikopol's son boards a train bound for Equator City, an African metropolis afflicted with a freezing micro-climate of minus-six degrees, but surrounded by desert and surrealistically populated by sub-Saharan wildlife. Intricate plot twists and stunning color artwork mark this work as both an extraordinary comics literary achievement and a crackling good story.&quot;\n\nFrom Library Journal:\n&quot;It's 2023 in France and the Egyptian deities rule from their home in the sky. Alcide Nikopol, hero of this graphic novel trilogy, awakens after a 30-year sleep and forms a strange pact with renegade god Horus. This pact allows Horus to seek revenge on his fellow deities in the Egyptian pantheon while punishing humanity and merging with Nikopol. A parallel plot line is formed by Nikopol's search for his son, who was not yet born at the time that his long sleep began. Unable to believe that this man in his thirties is his father, Nikopol's son thinks he has found a long lost twin. The graphics contain the requisite dose of violence, nudity, and sex, some of it central to the story. While there is an attempt to create a sense of urgency in the narrative, the gods remain undeveloped figures. The characters of Nikopol, the woman with blue hair, and Nikopol's son essentially remain unchanged by the story's resolution. - Stephen Weiner, Maynard P.L., MA&quot;\n\n\nSample pages:\nhttp://bayimg.com/maaobAaCe\nhttp://bayimg.com/maAOLAAce\nhttp://bayimg.com/MaaOOAACe\nhttp://bayimg.com/NAaObaaCE\n\nEnjoy","torrent":{"xt":"urn:btih:c180a7ebb8c69d751b0ee68394608859251bfe51","amp;dn":"Enki+Bilal+-+The+Nikopol+Trilogy+%5BCBR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c180a7ebb8c69d751b0ee68394608859251bfe51","infoHashBuffer":{"type":"Buffer","data":[193,128,167,235,184,198,157,117,27,14,230,131,148,96,136,89,37,27,254,81]},"announce":[],"urlList":[]}}