{"title":"Two Tongues (2009) [FLAC]","uid":7990414,"size":272535588,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c228536b4c8fb76448f4093fa7cf6dac4891abcb&amp;dn=Two+Tongues+%282009%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1357402710,"description":"\n  Two Tongues (2009) [FLAC]\n\n  Released: 2009\n  Genre: Pop/Rock\n  Style: Alternative\n  Codec: FLAC\n  Bit Rate: 1,000 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n  Cover: Front\n\n  01 Crawl\n  02 If I Could Make You Do Things \n  03 Dead Lizard \n  04 Interlude (feat. Sherri DuPree) \n  05 Tremors \n  06 Silly Game \n  07 Don't You Want To Come Home \n  08 Wowee Zowee \n  09 Come On \n  10 Alice \n  11 Try Not To Save Me \n  12 Back Against The Wall \n  13 Even If You Don't \n\n  Comprising members of Say Anything and Saves the Day, Two Tongues is a 21st century punk-pop dream team, complete with two able-voiced frontman and hefty helpings of angsty, rhythmic crunch. Max Bemis (the brainchild behind Say Anything's musical mishmash) and Saves the Day's Chris Conley may be unlikely partners, both of them boasting wildly different voices, but their give-and-take relationship is one of Two Tongues' most endearing aspects. Taking strength in that duality, the band's debut album covers a surprising amount of ground, from the requisite Warped Tour anthems (including the angsty opener, &quot;Crawl&quot;) to such '90s alt rock throwbacks as &quot;Don't You Want to Come Home&quot; and &quot;Try Not to Save Me.&quot; Throughout the album's 13 tracks, Two Tongues embraces an older interpretation of emo music, prizing angular guitars and soft/loud dynamics over the genre's newfound emphasis on pristine production and oversize pop choruses. That being said, there's plenty of pop to be had here, particularly during the sugary, slaphappy verses of &quot;Wowee Zowee.&quot; Meanwhile, Eisley's Sherri DuPree (who designed the album's cover art) gives an uncredited performance on &quot;Interlude,&quot; her gorgeous vocals serving as a brief breather from the band's heavy onslaught, while a cover of Ween's &quot;Even If You Don't&quot; serves as the album's closer. Bemis and Conley may wield the most power here, but Two Tongues debut is a collaborative effort through and through, with the band taking measures to prove its debt to past traditions and present friends.","torrent":{"xt":"urn:btih:c228536b4c8fb76448f4093fa7cf6dac4891abcb","amp;dn":"Two+Tongues+%282009%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c228536b4c8fb76448f4093fa7cf6dac4891abcb","infoHashBuffer":{"type":"Buffer","data":[194,40,83,107,76,143,183,100,72,244,9,63,167,207,109,172,72,145,171,203]},"announce":[],"urlList":[]}}