{"title":"[WebYoung] Rival Cheerleaders-Part One","uid":14072211,"size":1523008133,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:c283de9c7151d1e4a2538b06745dfdeff732741b&amp;dn=%5BWebYoung%5D+Rival+Cheerleaders-Part+One&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"distinc","files":1,"time":1459185441,"description":".......:::Screenshots:::.......\r\n\r\n \nhttp://imagedisco.net/?v=117068608\r\n \nhttp://imagedisco.net/?g=2912912248\r\n\r\nAs Bailey Brooke and Piper Perri arrive home from cheer leading practice, Piper shares her jealousy for her step-sister, over how good she is, how loud she cheers and everything. Piper has recently gone through a big turning point in her life. She's decided that it's time to be herself, no more lying, and missing out on all the opportunities life has to offer. Bailey tries to explain why Piper is failing at cheer leading, and ends up rooting through her bag to try and find more evidence to prove Piper just doesn't have what it takes.\r\n\r\nWhen Bailey finds Piper's vibrating wand, Piper confesses, that her whole interest in cheer leading is rooted to her decision to be more confident and authentically her. Piper comes out with the fact that she's a lesbian, and that it's time Bailey knows, since their parents do. Bailey is caught off guard by Piper's confidence, expressing how gutsy it was of piper to tell their parents that she's a lesbian. Bailey's own secret surfaces, because she understands how much courage it must have taken to come out as lesbian. Bailey also confesses she's one too.\r\n\r\nBefore long, these beautiful teen girls have discovered that the very thing they need to express their inner voices is each other. Bailey makes a deal, if Piper will sleep with her, she'll be easier on her in practice. Piper warns her that she might not be able to take her, but Bailey gloats about how many girls she's slept with. Soon, their cute little cheer uniforms are flying off and they're using every trick they know of to get one another off, any way possible. The heavy rivalry between these lesbian teens grows and builds with their tiny bodies until finally they have some of the most amazing taboo orgasms either one has ever witnessed. Thank teens we got to witness too!","torrent":{"xt":"urn:btih:c283de9c7151d1e4a2538b06745dfdeff732741b","amp;dn":"%5BWebYoung%5D+Rival+Cheerleaders-Part+One","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c283de9c7151d1e4a2538b06745dfdeff732741b","infoHashBuffer":{"type":"Buffer","data":[194,131,222,156,113,81,209,228,162,83,139,6,116,93,253,239,247,50,116,27]},"announce":[],"urlList":[]}}