{"title":"Standup Comedy - Don Rickles Speaks! - 1969","uid":4540564,"size":36190312,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c28874552021e7b8ef29b88bd4c6b363e4cdf15c&amp;dn=Standup+Comedy+-+Don+Rickles+Speaks%21+-+1969&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rambam1776","files":-1,"time":1227923318,"description":"Review by David Jeffries \n\nA conceptual follow-up to his hit standup album Hello Dummy!, Don Rickles Speaks! features the great insult comic fielding questions from five panelists (Rosalind Ross, Dick Whittington, Pat McCormick, Don Richmond, and Joe Smith) and skewering all that was &quot;hip&quot; in the late '60s. Way out of print, Speaks! had to wait till 2006 to be issued on CD by Jewish Music Group, and if one had to guess why original label Warner Bros. passed and then passed on this collection after so many years, it has to be how of its time the record is. Swinging nights where the adults all dressed in suits, drank highballs, and smoked cigarettes are brought to mind in this intimate show along with how politically incorrect this &quot;sophisticated&quot; crowd could be. Rickles is good friends with Sammy Davis, Jr. because &quot;you can't get good help like that anymore&quot; and Mexicans do the dirty work while shouting &quot;Zapata is alive!&quot; As is the common excuse, every race, creed, and religion get equal beatings and Rickles is a much smarter smartass than Andrew Dice Clay. Nostalgia buffs will dig the now obscure references to Snooky Lanson, Huntz Hall, and the Electric Prunes (&quot;they should all go suck on a lemon and go to a fruit festival&quot;) plus the cameo from the legendary announcer Gary Owens. The Sinatra thrashing tops it all and the liner notes are wonderful, with '60s pop culture expert Hal Lifson setting the stage for this nostalgia trip. While Hello Dummy! is the more representative release, the looser Speaks! is just as fun and twice as cool. \n\n\nTracks \n1 Current Events 3:36 \n2 Some Good Friends 2:56 \n3 Sinatra 2:52 \n4 Names in the News 2:00 \n5 Show Biz and Travel 3:19 \n6 Night Clubs 4:11 \n7 Television 3:44 \n8 Some Big Stars 3:15 \n9 Sports 2:32 \n10 Thoughts 3:18 \n11 Capsule Comments 2:04 \n12 Famous Men and Women 3:00 \n\n &lt;a href=&quot;\nhttp://allmusic.com/cg/amg.dll?p=amg&amp;sql=10:3nfuxqq0ldje&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://allmusic.com/cg/amg.dll?p=amg&amp;sql=10:3nfuxqq0ldje&lt;/a&gt; \n\n\nBiography by Jason Ankeny \nDon Rickles was the ultimate putdown artist, comedy's unquestioned master of the insult. No one regardless of gender, ethnicity, sexual orientation, or cultural standing escaped the vicious taunts of &quot;Mr. Warmth&quot;; even audience members, as well as other celebrities, were fair game for his delirious rages of verbal abuse. Born Donald Jay Rickles in New York City on May 8, 1926, he initially set out to become a serious actor, and even attended the American Academy of Dramatic Arts; however, his short, stocky physique and balding head firmly typecast him as a character actor, and he found work infrequently. During a long dry spell between acting assignments, Rickles began working up a nightclub act. At the outset, his material was traditional and tame; however, when annoyed by hecklers he shot back with a string of brutal, rapid-fire putdowns, much to the delight of the audience. \n\nAs a result, Rickles gradually transformed himself into the so-called &quot;Merchant of Venom,&quot; a loud-mouthed misanthrope attacking everyone in range. Nonetheless, by 1957 he was still struggling when he landed a gig at Slate Brothers, a small nightclub in Hollywood. During his set, Frank Sinatra appeared in the audience, prompting Rickles to remark &quot;Make yourself at home, Frank. hit somebody.&quot; Immediately, Sinatra became one of Rickles' biggest boosters, and soon the comedian was the hottest ticket in town as celebrities lined up to be the next target of a flurry of insults. Within two years, Rickles made his Las Vegas debut, quickly graduating to headliner status in the main room of the Hotel Sahara. In 1958, he also made his film debut in Run Silent, Run Deep, and went on to appear in small roles in a number of films, primarily in the Frankie Avalon/Annette Funicello beach party movies and television series. Rickles rose to national prominence thanks to his frequent appearances with Johnny Carson on The Tonight Show, where he first performed in 1965; after several years as a regular guest on the program, in 1968 the ABC network offered him his own variety series, titled The Don Rickles Show. \n\nConcurrently, Rickles also signed to the Warner Bros. label to record his first comedy album, 1968's Hello Dummy!, a live set recorded in Vegas spotlighting his crowd-taunting antics as well as an almost surreal rant about his wife's sexual fetishes. The follow-up, 1969's Don Rickles Speaks!, featured a group of five panelists (Rosalind Ross, Dick Whittington, Pat McCormick, Don Richmond, and Joe Smith) posing questions to which the comedian shot back with ad-libbed answers touching upon television, sports, Sinatra, and other comics. Despite remaining a fixture on the couch of The Tonight Show as well as Dean Martin's series of celebrity roasts, Rickles found mainstream audiences reluctant to embrace him; the first Don Rickles Show was canceled after just 13 weeks, while a 1972 sitcom of the same name fared just slightly better. Only 1976's C.P.O. Sharkey found any real measure of success, although it lasted just two seasons; 1993's Daddy Dearest, co-starring the neurotic comedian Richard Lewis, stayed on the schedule for barely two months. Throughout his career, however, Rickles remained a huge Vegas draw, and in 1995 he enjoyed a major Hollywood renaissance with high-profile supporting roles in Martin Scorsese's Casino and as the voice of Mr. Potato Head in John Lasseter's breakthrough computer-animated tale Toy Story. \n","torrent":{"xt":"urn:btih:c28874552021e7b8ef29b88bd4c6b363e4cdf15c","amp;dn":"Standup+Comedy+-+Don+Rickles+Speaks%21+-+1969","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c28874552021e7b8ef29b88bd4c6b363e4cdf15c","infoHashBuffer":{"type":"Buffer","data":[194,136,116,85,32,33,231,184,239,41,184,139,212,198,179,99,228,205,241,92]},"announce":[],"urlList":[]}}