{"title":"MX Superfly Soundtrack","uid":9151890,"size":530786838,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:c32846a89385ed0ae445b89cab318b53f05fd66d&amp;dn=MX+Superfly+Soundtrack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"music4Uploads","files":-1,"time":1383709594,"description":"Tracklist:                      \n\nBodyjar - Not the Same\n\nCourse of Nature - Gain\n\nDel tha Funkee Homosapian - Style Police\n\nDropkick Murpheys - The Gauntlet\n\nHoobastank - Pieces\n\nHotwire - Prosthetics or Steel\n\nLittle Known Fact - Deeper Down the Rabbit Hole\n\nMest - Cadillac\n\nSouls of Mischief - Airborne Rangers\n\nSpineshank - New Disease\n\nSpineshank - Synthetic\n\nThe Coup - Superfly\n\nThe Dickies - Roadkill\n\nThe Turbo A.Cs - Last One Standing\n\nVandals - Girls Turn 18 Everyday\n\n***********************************notes***************************************\n---------------READ----------------\n\n**Before anything, one song &quot;the Guantlet - Dropkick Murpheys&quot;\nwas downloaded seperatley because it failed to rip from disc.\nI ensure you the quality is the same as the others and it is virus free.\n\n\nThis is the MX Superfly Soundtrack. This is a motorcross racing\ngame from about 2002.I decided to grab the audio from this disc because i remember last \nplaying this and it having an amazing soundtrack. I just wanted to share \nit with everyone else, and just bring back some nostalgia for many, as it\ndid for me.\n\n\nI ripped this audio using &quot;MF Audio v1.1&quot;\nThis has been ripped straight from the Ps2 disc\n@16bit, 44.1hz, A000, WAv (uncompressed).\nThe Files are bigger because they are in a lossess format,\nso the quality is &quot;CD&quot;, which is near perfection scientifically\nbecause our hearing threshold just about ends at cd quality. However,\nit would still be best to buy the cd itself. I'm not sure how much \nquality (if any) was lost during the transaction. I ensure the quality of the audio is Pristine,\nbut if it really means that much to you, buy the cd. This particular soundtrack is as close as it gets\nand you probably won't find any other torrents/downloads with this quality. To save space, you can always\nconvert the .wav audio into smaller FLAC or ALAC files, which i recommend because it will yield the same\naudio quality just in a more condensed fashion (lossless). Or convert to MP3, AAC, ect.. Which will\npermanently decrease the audio quality forever (lossy). Remember, the more you convert your audio\nfrom lossy to lossy, the WORSE it will sound each time! I have provided you with the raw audio files\nso that you could use them to your discretion. :)\n\nA Spectrogram is included to sample some songs and their quality.\nfor any lossless 16bit 44.1hz audio file, it should have around 22.1Khz\nand should show a full graph. This is shown using a program called spectro.\n\nA snapshot of the program i used to rip the audio from the game is also\nincluded, just to show you the features and just to show you im not lying.\n\nA snapshot of a song is also included to show a sample of how big the songs are,\nand how good the quality is. I am seeing this information with a feature from\ndBpoweramp (a music converting software). Just to make you aware, mp3 usually has\n192, 240, or 320 bit rate, and these songs have over 1,400!\n\n!!!Remember, these are lossless, so converting them to ANY lossy format like mp3 or AAC will result\nin PERMANENT quality loss even if it is reconverted back to a lossless format!!!\n\nMy recommendation would be to convert them to FLAC or ALAc (for iPod)\nso you can enjoy the full quality of these songs. +++TIP- You can convert from FLAC, ALAC,\n.wav, and AIFF all interchangeably without losing any quality because they are all lossless!\n\nPlease enjoy!\nPlease don't Reupload!\nThanks\n\n*NONE OF THESE SONGS ARE MINE AND BELONG TO THE RIGHTFUL OWNERS\nPLEASE GO OUT AND BUY THE MUSIC IF YOU LIKE IT.\n\n**I TRY TO ENSURE THAT ALL OF MY UPLOADS ARE COMPLETELY FREE\nOF ANY VIRUS OR MALWARE OF ANY KIND. PLEASE NOTIFY ME IF ANYTHING\nSUSPICIOUS HAS CAUGHT YOUR ATTENTION AND I WILL TAKE ACTION.\n\n***THE &quot;Z&quot; IN FRONT OF READ ME AND STUFF IS JUST SO ITS AT THE BOTTOM\nTO MAKE IT EASIER.\n\n****I am sorry to say that there is no Metadata with these audio files,\ni was way to lazy after spending the hour ripping the songs, so that means\nyou are going to have to plug all the info (like artist, album, artwork, ect.)\nif you want to put them into iTunes or a similar music library.\n------------------------------------------------------------------\nEXAMPLE OF SIZE AND QUALITY: &quot;BODYJAR - NOT THE SAME&quot;\n \nSize 32.13 MB  (0% Compressed)\nOriginal Size 32.13 MB\nLength 3 minutes 11 seconds\nChannels 2  (stereo)\nSample Rate 44.1 KHz{CR}\nSample Size 16 bit\nBit Rate 1,411 kbps\nEncoder \nEncoder Settings PCM\nAudio Quality CD  (Lossless)\nContains \nChannel Mapping Left, Right\nFile Bodyjar - Not the Same\nType Wave Sound    [.wav]\n\n*******************************************************************************","torrent":{"xt":"urn:btih:c32846a89385ed0ae445b89cab318b53f05fd66d","amp;dn":"MX+Superfly+Soundtrack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c32846a89385ed0ae445b89cab318b53f05fd66d","infoHashBuffer":{"type":"Buffer","data":[195,40,70,168,147,133,237,10,228,69,184,156,171,49,139,83,240,95,214,109]},"announce":[],"urlList":[]}}