{"title":"EXPLOITED COLLEGE GIRLS - Lanina - Her First Painful Anal SD","uid":8863886,"size":436705604,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:c467b6c73fe384616a8b1e3985c96e59d7b5d877&amp;dn=EXPLOITED+COLLEGE+GIRLS+-+Lanina+-+Her+First+Painful+Anal+SD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"beta2008x","files":1,"time":1377846627,"description":" &lt;a href=&quot;http://imgboxxx.com/viewer.php?file=mdf2n_lmi.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://imgboxxx.com/viewer.php?file=mdf2n_lmi.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=o55og_ecg_lanina_s.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=o55og_ecg_lanina_s.jpg&lt;/a&gt;\n\nAnal fans, get excited. This week I've got an exotic hypersexual little 18 year old who will do almost anything, from letting me face fuck her to anal sex to a facial that completely glazes her eyes shut. I found Lanina at the University of Arizona where her cute light brown skin and tight little spinner body caught my eye.\n\nWe start off, as usual, getting to know each other in the car where Lanina explains that she's not really Latina but just a cute, dark skinned mutt. I'm very okay with that because she follows it up with a detailed explanation of her sexual likes (everything.) From girl on girl where she admits to fucking her friends to ass play to her love of cum and cumplay, there's nothing this girl hasn't tried. In my experience a girl who loves cum loves to suck cock, so I have her give me road head to get this party started.\n\nHer oral skills are fantastic, so my theory is still legit. She really gets into it, lots of hand motion, lots of spit. It's so good I have to stop her before I blow my load. I'm not making that mistake two weeks in a row! We head back to the location to get the real fun started.\n\nWe got most of the interview done in the car, but while I get the cameras set up we chat some more and Lanina reveals that she often fingers her ass while she masturbates which is just FUCKING hot. It also means that when I suggest anal, she's game to try it. I love me some anal, so this shoot just improved a lot. I have her get naked and she's as excited as I am, her pussy is already a little wet. Between my fingers in her ass and pussy, a toy and her own fingers, she's driven to her first orgasm. Once she cums, she's in a very high state of arousal, her pussy is soaked and creamy and even when I step away for a second, she continues to pound her pussy with the toy. This girl is a sex fiend.\n\nI get her positioned on a pillow and dive into that pussy. It's great, she's really responsive and tight but I can't help but see her little starfish staring up at me begging for my cock. &quot;Jay&quot; it's saying, &quot;Fill me up, Jay.&quot; As I'd hoped, Lanina doesn't even hesitate when I ask about anal, she relaxes right into it. Let me tell you, it's everything I hoped it would be. I fuck her ass until she can't take anymore and then I have her clean my dick off in her mouth. It's really hot. I let her ride me in cowgirl until I'm ready to pop and I glaze her face with a cumshot so huge I'm lightheaded afterward.\n\nIf you are the kind of guy who is really into hardcore sex crazed sluts, be sure to stay tuned after the pop shot for a little behind the scenes where Lanina gives me a little insight into her sex life as she gives me a friendly 'off camera' goodbye beej. Normally I don't like a girl to be a chatty Cathy when she's sucking me off but the story she tells in this clip is just insane, you have to watch.","torrent":{"xt":"urn:btih:c467b6c73fe384616a8b1e3985c96e59d7b5d877","amp;dn":"EXPLOITED+COLLEGE+GIRLS+-+Lanina+-+Her+First+Painful+Anal+SD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c467b6c73fe384616a8b1e3985c96e59d7b5d877","infoHashBuffer":{"type":"Buffer","data":[196,103,182,199,63,227,132,97,106,139,30,57,133,201,110,89,215,181,216,119]},"announce":[],"urlList":[]}}