{"title":"Stardust - June 2016 (gnv64)","uid":14857618,"size":41498356,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c46876a56c0ac91cffc325642dbf2f98027e8526&amp;dn=Stardust+-+June+2016+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gnv65","files":4,"time":1465495755,"description":"Stardust - June 2016\r\nEnglish | 150 pages | True PDF | 39.5 mb\r\n\r\nRuling the roost for over 40 years, Stardust is India’s numero uno Bollywood magazine! Stardust gets you all the \r\n\r\nlatest filmy gossip, masala, break-ups and make-ups, previews and reviews, posters and more!\r\n\r\nCONTENTS\r\nCOVER STORY - In 2013, when ALIA BHATT sailed through the gates of B’town, people thought she was just another \r\n\r\nstar-kid who had things set on a platter. But with her second film, she proved that she is not just the rosycheeked, \r\n\r\ndimple-chinned industry child, but a talent to reckon with, and something she has been steadily building on with \r\n\r\neach release of hers. Today, Alia is at the top of her league, her kitty overflowing with juicy projects &amp; films.\r\n\r\nTIGER SHROFF has come a long way with his dance moves, stunts and more importantly, his goal to enter Bollywood and \r\n\r\ncarve a niche for himself.\r\n\r\nThe girl-next-door is one of the labels attached to this actress on screen. With her voice, she won hearts, she \r\n\r\nsurprised everyone last year with her dance moves, and now, with her action chops, she simply mesmerized the \r\n\r\naudience. Though she comes across as bubbly and chirpy, SHRADDHA KAPOOR is actually very calm, composed, sweet and \r\n\r\npetite.\r\n\r\nAfter Masaan, Richa has paraded the title of an actress who knows her craft, but with Cabaret, Richa plans to zip \r\n\r\nloose talk and prove herself a glam diva and a competent actress. Richa chadha is simply the most honest actress...\r\n\r\nJust around the time her much awaited release, the biopic (technically a docu-drama) with Emraan Hashmi, Azhar), was \r\n\r\nto hit the screens, NARGIS FAKHRI sent the industry folk into a tizzy by doing a disappearing act. Stardust airs a \r\n\r\ntake on the happenings, as we try to get to the bottom of it all.\r\n\r\nAMRITA RAO was the innocent face of Bollywood for a while, and since her debut, men have been smitten by her. She is \r\n\r\ngorgeous, vivacious, spontaneous and witty to the core. She became a household name after she became the Rajshris’ \r\n\r\nbahu with Vivah and ever since, in every encounter with fans, they cannot forget the reel character she portrayed. \r\n\r\nSuch is the persona she possesses. Whilst the audience want to see their favourite actress more often, she is very \r\n\r\npicky about roles that befit her, and wisely so. She is currently visible on television, essaying the younger role \r\n\r\nof a legendary singer, and has touched millions of hearts once again.\r\n\r\nSIKANDAR KHER was seventh or eighth assistant to director Sanjay Leela Bhansali, on his millennial magnum opus \r\n\r\nDevdas. 2016 is the Sikandar shining year. His double role and perfect comic timing were much appreciated in the \r\n\r\nfilm Tere Bin Laden – Dead or Alive, earlier this year. Plus he’s in a couple of really big television serials, in \r\n\r\ninteresting and pivotal parts. He now stands sleek and sharper if anything, has the added wisdom of years and \r\n\r\nexperience, and is raring to go with good work...\r\n\r\nRAM GOPAL VARMA is a classic example of how dizzying heights of success can also plummet to the depths of failure. \r\n\r\nAfter being ranked as one of the finest filmmakers, his latter body of work was questioned and ridiculed for its \r\n\r\ninanity and lack of substantial content. However, he has no qualms in admitting the mistakes he’s made and all the \r\n\r\nimpulsive decisions taken. Selfassured and devoid of emotions, in his second innings, he is back with a yet another \r\n\r\ngruesome thriller Veerappan...\r\n\r\nSTARDUST STYLE\r\nCASUAL LOOKS - Check out Deepika in some of her coolest casual avatars.\r\nRED CARPET LOOKS - Take a look at the actress as she mesmerises in extravagant designer creations.\r\nLOOK TEST - Here’s a review of her memorable on-screen ensembles.\r\nACCESSORIES - The actress shows us how to jazz up an outfit with these add-ons.\r\nFITNESS - An insight into Deepika’s diet and exercise regime.\r\nCARNAMA - Check out the luxurious wheels that Ms. Padukone owns.\r\nQUOTE ROOM - Here’s what the actress has to say about all rumours surrounding her life.\r\n \nhttps://s33.postimg.org/qlo50iakv/Stardust_June_2016.jpg","torrent":{"xt":"urn:btih:c46876a56c0ac91cffc325642dbf2f98027e8526","amp;dn":"Stardust+-+June+2016+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c46876a56c0ac91cffc325642dbf2f98027e8526","infoHashBuffer":{"type":"Buffer","data":[196,104,118,165,108,10,201,28,255,195,37,100,45,191,47,152,2,126,133,38]},"announce":[],"urlList":[]}}