{"title":"Recent Application in Biometrics (scuba-doo) [eRG]","uid":6586770,"size":26350150,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c49c468aab93c2ea5b5685bb91d9fe1491365da2&amp;dn=Recent+Application+in+Biometrics+%28scuba-doo%29+%5BeRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"scuba-doo","files":-1,"time":1312639375,"description":"Edited by: Jucheng Yang and Norman Poh\n\n- ISBN 978-953-307-488-7\n- Hard cover, 302 pages\n- Publisher: InTech\n- Publication date: July 2011\n- Subject: Pattern recognition\n\n\nIn the recent years, a number of recognition and authentication systems based on biometric measurements have been proposed. Algorithms and sensors have been developed to acquire and process many different biometric traits. Moreover, the biometric technology is being used in novel ways, with potential commercial and practical implications to our daily activities. The key objective of the book is to provide a collection of comprehensive references on some recent theoretical development as well as novel applications in biometrics. The topics covered in this book reflect well both aspects of development. They include biometric sample quality, privacy preserving and cancellable biometrics, contactless biometrics, novel and unconventional biometrics, and the technical challenges in implementing the technology in portable devices. The book consists of 15 chapters. It is divided into four sections, namely, biometric applications on mobile platforms, cancelable biometrics, biometric encryption, and other applications. The book was reviewed by editors Dr. Jucheng Yang and Dr. Norman Poh. We deeply appreciate the efforts of our guest editors: Dr. Girija Chetty, Dr. Loris Nanni, Dr. Jianjiang Feng, Dr. Dongsun Park and Dr. Sook Yoon, as well as a number of anonymous reviewers.\n\n\n\n\nHASH: C49C468AAB93C2EA5B5685BB91D9FE1491365DA2\n\n\n\nscanned with Kaspersky  + SuperAntiSpyware + Malwarebytes = Malware FREE\n\nENJOY\n       scuba-doo\n\n\nshare the wealth and seed, comments are more then welcome","torrent":{"xt":"urn:btih:c49c468aab93c2ea5b5685bb91d9fe1491365da2","amp;dn":"Recent+Application+in+Biometrics+%28scuba-doo%29+%5BeRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c49c468aab93c2ea5b5685bb91d9fe1491365da2","infoHashBuffer":{"type":"Buffer","data":[196,156,70,138,171,147,194,234,91,86,133,187,145,217,254,20,145,54,93,162]},"announce":[],"urlList":[]}}