{"title":"Jason and The Scorchers - Still Standing [1986][EAC,log,cue. FLA","uid":8148621,"size":312781730,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c4d2dc8cce5d23893f7229e8b7c637d39a2f3080&amp;dn=Jason+and+The+Scorchers+-+Still+Standing+%5B1986%5D%5BEAC%2Clog%2Ccue.+FLA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":19,"time":1360984767,"description":"one of Dicks Americana collection\n\nArtist: Jason &amp; The Scorchers\nRelease: Still Standing\nDiscogs: 3516001\nReleased: 1986 / 2002\nLabel: EMI America\nCatalog#: AML 3110 / 72435-41210-2-9\nFormat: LAC / Lossless / Log (100%) / Cue / CD\nCountry: US\nStyle: Rock, Country Rock\n\nTracklisting:\n\n01. Golden Ball And Chain (4:42)\n02. Crashin' Down (4:00)\n03. Shotgun Blues (2:16)\n04. Good Things Come To Those Who Wait (5:00)\n05. My Heart Still Stands With You (3:35)\n06. 19th Nervous Breakdown (3:46)\n07. Ocean Of Doubt (3:17)\n08. Ghost Town (3:40)\n09. Take Me To Your Promised Land (4:40)\n\nJason and the Scorchers recorded &quot;Still Standing&quot;, their second full-length album, in the first half of 1986 at Cherokee Studios in Los Angeles and at Scruggs Sound Studio in Nashville. Tom Werman, producer of several albums with Cheap Trick, Molly Hatchet and Ted Nugent, supervised the production. The album was released it November of 1986. The sound was fuller and more hard-rock oriented than the Scorchers' first three albums, 1982's EP &quot;Reckless Country Soul&quot;, 1984's EP 'Fervor' and 1985's 'Lost and Found. &quot;Still Standing&quot; does contain the jangly 'My Heart Still Stands With You' and the folky 'Ocean of Doubt, 'but most of the album sounds closer to the sweeping and metallic guitar rock that had become mainstream in the 1980's than the proto-Americana of the Scorchers' first releases.\nJason Ringenberg's songwriting had continued to improve, and he wrote some of his most lasting work for &quot;Still Standing.&quot; Twenty-seven at the time he wrote most of the album, he blazes the trail of a man who is determined to make sense somehow of the storms of life, or at least to channel them into great rock n' roll. Jason's singing also proved to be every bit as potent for epic rock songs as it was for the 'country punk' of the Scorchers' roots. Jason ranges easily on the record from the ethereal limbo of 'Ocean' to the full-steam-ahead rock of 'Golden.' He takes time out on the hillbilly highway in 'My Heart,' conjures portentously in 'Take Me To Your Promised Land,' and reveals his unerring gift for melody in 'Crashin' Down.' \nThe album proved challenging to play live, since Hodges used several guitar tracks on some of the songs. Warner proved more than able, and songs such as 'Golden' and 'Good Things Come To Those Who Wait' have been staples of the band's live shows ever since. 'My Heart' made a resurgence in their shows after bassist Kenny Ames joined the band in 1997. I have not heard of the band playing '19th Nervous Breakdown,' the cover version of the Rolling Stones song that became a single, in any live show since they reunited in 1993. They might well have played it; but it as about as rare a song as you will, or won't, hear them play. \nPeople have speculated for years about exactly how many &quot;Still Standing&quot; CDs EMI released in 1986. Estimates range from two to eight thousand. Whatever the exact number, this first Scorchers CD release ('Fervor' and 'Lost and Found' were issued on vinyl and tape only) became very difficult to procure by the 1990's. Only vinyl copies of 1982's 'Reckless Country Soul' (2,000 copies), their recording debut, and the UK single of 'Window Town' are more difficult to find than original &quot;Still Standing&quot; CDs. Vintage 1986 &quot;Still Standing&quot; CDs still sell on Ebay for an average price of $35. \n&quot;Still Standing&quot; landed Jason and the Scorchers some nationwide FM radio airplay, with 'Golden' leading the way as a single. It has been the band's highest-charting single in their career. &quot;Still Standing&quot; was Jason and the Scorchers' last album with EMI, as the label dropped them in 1987. A&amp;M signed the band soon after and spent two years with them developing 1989's Thunder and Fire. \n &lt;a href=&quot;\nhttp://dickthespic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:c4d2dc8cce5d23893f7229e8b7c637d39a2f3080","amp;dn":"Jason+and+The+Scorchers+-+Still+Standing+%5B1986%5D%5BEAC%2Clog%2Ccue.+FLA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4d2dc8cce5d23893f7229e8b7c637d39a2f3080","infoHashBuffer":{"type":"Buffer","data":[196,210,220,140,206,93,35,137,63,114,41,232,183,198,55,211,154,47,48,128]},"announce":[],"urlList":[]}}