{"title":"[BangBros Remastered] Ice la fox, Dasani, Natalia Woods (Porn-St","uid":9240981,"size":537674564,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:c5c62d544ae007cf33f78fcdb7710c9db8ef3648&amp;dn=%5BBangBros+Remastered%5D+Ice+la+fox%2C+Dasani%2C+Natalia+Woods+%28Porn-St&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"chkm8te","files":1,"time":1385277656,"description":"[BangBros Remastered] Ice la fox, Dasani, Natalia Woods (Porn-Star Heaven / 11.24.2013)\n\nWe are just about the sexiest trio you're ever gonna see. There was a mission at hand, but my friends Natalia and Dasani are so pretty we just couldn't seem to keep our hands off each other. Can you blame us? Anyway, we were feeling a little merciless this week when we were out on the prowl. We played nice (sorta) with the first guy up, Dante. All we really wanted was to give him a blowjob, play with his cock, and watch him bust a load. Things looked promising when Dasani was sucking his dick, and even more so when Natalia stepped up to the plate and fucked the shit out of him. Seems like every guy's dream come true, right? But the pressure was too much for Dante. After dumping his ass somewhere in South Beach, we headed home unsatisfied and with a vengeance. Natalia's brilliant idea to call a delivery guy worked out perfectly! Poor guy didn't know what was coming! We took turns sitting on his face while the rest sucked his dick and tried to get him really hard. It's safe to say he had never had such close contact with so much pussy before, and almost buckled under the pressure too. We were determined though, and used our last resort, and my personal favorite - some serious ass play. I'll give you a hint: Vaseline and latex gloves. Now I don't know if he really enjoyed it. Maybe he was just turned on by seeing us lick each other's clits, but soon after, he delivered the goods we'd been waiting for and came all over our tits like a good boy. You're gonna have to see this one!\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=cs9086mgqmkddg6oi7n9.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=cs9086mgqmkddg6oi7n9.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=2rx2npwrzygj76z61l17.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=2rx2npwrzygj76z61l17.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:c5c62d544ae007cf33f78fcdb7710c9db8ef3648","amp;dn":"%5BBangBros+Remastered%5D+Ice+la+fox%2C+Dasani%2C+Natalia+Woods+%28Porn-St","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5c62d544ae007cf33f78fcdb7710c9db8ef3648","infoHashBuffer":{"type":"Buffer","data":[197,198,45,84,74,224,7,207,51,247,143,205,183,113,12,157,184,239,54,72]},"announce":[],"urlList":[]}}