{"title":"Longtion Software AutoRun Pro Enterprise II v6.0.1.136 with Key ","uid":8381073,"size":15029674,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c63ba73e028985a31d8dda7c689414e23a2a3c6b&amp;dn=Longtion+Software+AutoRun+Pro+Enterprise+II+v6.0.1.136+with+Key+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TorDigger","files":9,"time":1366166150,"description":"AutoRun Pro Enterprise II\n\nCreate your own custom autorun menus, interactive presentations, multimedia applications, and custom software in just minutes. AutoRun Pro Enterprise II features a completely visual drag and drop environment. Simply add content such as buttons, photos and text to your pages and position them using your mouse. Even if you have absolutely no programming experience you'll be able to get started creating your own custom applications in just minutes.\n\nAutoRun Pro Enterprise II is a popular design tool for rapid creation of autorun CD browsers and presentations. Offering a simple point-and-click design environment, AutoRun Pro Enterprise II allows anyone, regardless of computer competence and creative ability, to blend texts, images, video and audio into an interactive front-end for CDs and DVDs. In doing this, you can make use of wizards, templates and demos that let you jumpstart your autorun project in minutes. The end result can be compiled as a single executable file and burned onto a CD or DVD disk directly using the built-in CD Burner.\n\nThe best in AutoRun Pro Enterprise II is that it has been designed with the ordinary user in mind, the one who doesn't want to take the time to learn how to use a complicated design tool or hire a designer to do the work. It lets you create and edit a front-end in much the same way as you would design a presentation in Microsoft PowerPoint. Just click, drag, position in the desired area and preview to see whether you have the intended result. In just a few clicks, you can create a main page, a splash screen, an agreement form, a security form and an exit form, plus add the unlimited number of sub pages. Pages can be connected by using transition effects like page fade in, fade out and others. You can elaborate pages by adding buttons, images, simple text, links and many other objects and associate each of them with actions so that end users can interact with and navigate through the front-end content. The front-end can let them open and execute files, print documents, send email, visit web sites, browse CD and more...\n\nSupported OS: \n\nWindows 9x/2000/XP/2003/2008/Vista/7\n\nHomepage: http://www.longtion.com/\n\nInstallation Instructions:\n\n- Install program.\n- Register application with given name/key.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:c63ba73e028985a31d8dda7c689414e23a2a3c6b","amp;dn":"Longtion+Software+AutoRun+Pro+Enterprise+II+v6.0.1.136+with+Key+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c63ba73e028985a31d8dda7c689414e23a2a3c6b","infoHashBuffer":{"type":"Buffer","data":[198,59,167,62,2,137,133,163,29,141,218,124,104,148,20,226,58,42,60,107]},"announce":[],"urlList":[]}}