{"title":"Coast to Coast AM December 02 2012","uid":7882900,"size":57152061,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:c72ffa0e844de2f2d4bfe05631bc59352bffb40a&amp;dn=Coast+to+Coast+AM+December+02+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1354541844,"description":"Date: \t12-02-12\nHost: \tGeorge Noory\nGuests: \tIrvin Baxter, Sonia Arrison\n\nFounder of End Time Ministries, Rev. Irvin Baxter, discussed biblical \n\nprophecy, and why he believes many signs are in place that were foretold \n\nin the Book of Revelation. &quot;A war is coming that will kill 1/3 of mankind\n\n-- 2.3 billion human beings,&quot; he warned, adding that the Bible says that \n\nthe war will start from the Euphrates River (which runs through Turkey, \n\nSyria, Iran, and Iraq, countries that currently have much tension). &quot;I \n\nwill be shocked if we don't see this war in 2013, but that's not a \n\nprediction, because I don't know,&quot; he declared. In the event of such a \n\ncatastrophic war, the surviving populace might be willing to accept a \n\nmicrochip implant in the name of a security, Baxter noted, and this would \n\nlikely be the prophesied &quot;Mark of the Beast&quot; (view related video clip).\n\nBaxter believes that the Antichrist is alive now, and that he will \n\neventually be possessed by Satan. He will then try to realize his \n\nambition-- having everyone on Earth worship him through forcing them to \n\npledge their allegiance to him or they won't be able to buy or sell-- \n\n&quot;that's what the Mark of the Beast is all about,&quot; he said. Whoever is the \n\nPope during the time of the Antichrist will be known as the &quot;False \n\nProphet,&quot; the last Pope, he continued.\n\nDuring the time of the Antichrist, there'll be a one-world government, \n\none-world religion, and one-world economy-- this &quot;Master Plan of the \n\nDragon&quot; was launched 100 years ago with the start of the Federal Reserve, \n\nBaxter stated. He also spoke about how current events could be strong \n\nindicators of prophecy, such as turmoil in the Middle East, as well as his \n\nplanned Jerusalem Prophecy College.\nExtending Life Expectancy\n\nFirst hour guest, author and technology analyst Sonia Arrison talked about \n\nthe impact of extending human lifespans. Since 1850, humans have double \n\ntheir life expectancy, and with advances in such areas as gene therapy, \n\nstem cells, and personalized medicine, longevity will increase even \n\nfurther, she said. Not only will people be living longer, but they'll also \n\nbe healthier, she commented, adding that the military is actually fueling \n\nsome of the advances by funding studies in regenerative medicine to help \n\nwounded soldiers. Arrison is particularly excited about the prospect of \n\ntissue engineering, in which a persons' stem cells can be used to grow new \n\norgans or body parts.\n\nNews segment guests: Ryan Mauro, David Blume\nWebsite(s):\n\n    endtime.com\n    soniaarrison.com\n\nBook(s):\n\n    100 Plus\n","torrent":{"xt":"urn:btih:c72ffa0e844de2f2d4bfe05631bc59352bffb40a","amp;dn":"Coast+to+Coast+AM+December+02+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c72ffa0e844de2f2d4bfe05631bc59352bffb40a","infoHashBuffer":{"type":"Buffer","data":[199,47,250,14,132,77,226,242,212,191,224,86,49,188,89,53,43,255,180,10]},"announce":[],"urlList":[]}}