{"title":"Stephen King's The Shining ([XviD - Ita Eng Fra -- MULTISub]","uid":5276044,"size":4123264546,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c7484c79344924cd477f818cbbb4efb2f3d86957&amp;dn=Stephen+King%5C%27s+The+Shining+%28%5BXviD+-+Ita+Eng+Fra+--+MULTISub%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rocking_cat","files":-1,"time":1263383968,"description":"Stephen King's The Shining ([XviD - Ita Eng Fra Ac3 - MULTISub]\n\n\nIMDB: http://www.imdb.com/title/tt0118460/\n\n\nPlot overview:\nJack Torrance has been regretting his drinking habit since it nearly destroyed his life. His alcoholism and explosive temper have led to him losing his teacher job at Stovington, a respectable preparatory school. The incident revolved around a student named George Hatfield, who in revenge for being cut from a debate team, slashed the wheels of Jack's car. Upon discovery, Jack had attacked George, and it was these dangerous outbursts that nearly led to the break up of his family when Jack injured his son Danny.\n\nNow, nursing a life of sobriety and pulling in work as a writer, Jack and his family take on the seemingly dream job of looking after a large and rambling hotel as well as its grounds as winter caretakers. The Overlook Hotel, a large colonial building is sheltered away in a picturesque valley in the Rockies and commands impressive views of the local countryside and nearby mountains.\n\nHoping to succeed and move on as a writer, Jack is happy to take the job as it will provide desperately needed funds and the time to complete his first promising play.\n\nJoining him are his wife Wendy and son Danny who also seem eager for the break from normal life and a home for the immediate future. Wendy has become strong in character due to Jack's former alcoholic streak. Upon entering the Overlook and meeting its head cook, Dick Hallorann, Danny discovers that he possesses a unique power which grants him a form of clairvoyance and telepathy. Hallorann tells Danny that he &quot;shines&quot;, and thus this gives us the title of the story.\n\nAs the plot unfolds, it becomes increasingly apparent that the hotel's ghosts are more than figurative and far from peaceful. There is a force within the building that seems intent on using Danny for a means that remains unknown, and it goes from flickering lamps and spectral voices to a full-on masked ball from the Overlook's past.\n\nDanny is the first to have fully noticed the darker character of the Hotel, having experienced visions and warnings that foreshadow what he and his parents will encounter over the winter.\n\nIn order to achieve its goal, the hotel will happily take over the person dearest to Danny: his father.\n\n\n\nCountry.......: USA\nYear..........: 1997\nFormat........: TV miniseries\nGenre.........: horror\nEpisodes......: 3\nDirected by...: Mick Garris\nWritten by....: Stephen King\nScreenplay....: Stephen King\nPhotography...: Shelly Johnson\nEdited........: Patrick McMahon\nMusic.........: Nicholas Pike\n\n\nSource........: 3xDVD5 --&gt; DVDRip\nAudio.........: Italian AC3 3.0\n                English Ac3 2.0\n                French  Ac3 2.0\nSubtitles.....: Italian\n                English\n                French\n                Dutch\n                Spanish\n                German\n                Rumanian\n                Arabic\nRuntime Part 1: 01:27:08\nRuntime Part 2: 01:27:01\nRuntime Part 3: 01:27:32\nRuntime Extra.: 00:16:51\n\n\n","torrent":{"xt":"urn:btih:c7484c79344924cd477f818cbbb4efb2f3d86957","amp;dn":"Stephen+King%5C%27s+The+Shining+%28%5BXviD+-+Ita+Eng+Fra+--+MULTISub%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7484c79344924cd477f818cbbb4efb2f3d86957","infoHashBuffer":{"type":"Buffer","data":[199,72,76,121,52,73,36,205,71,127,129,140,187,180,239,178,243,216,105,87]},"announce":[],"urlList":[]}}