{"title":"The Economist January 17th 2009","uid":4651666,"size":2291017,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c7c4b795ea94309f07cc68c380a6b9e76ad8d680&amp;dn=The+Economist+January+17th+2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"pokerrocket","files":1,"time":1232063431,"description":"The Economist January 17th 2009\n\nGeorge Bush has left a dismal legacy, but Barack Obama can do much to repair the damage:\n\nMr Bush had a simplistic tendency to see the world through ideological and partisan spectacles. He hung on to bad advisers for longer than he should have; he divided the world too often into good and evil; and he plotted to establish a Republican hegemony although he had sold himself to the electorate as bipartisan. In economic matters, he was too prone to sacrifice the long-term good for short-term gain. He seemed curiously incurious about vital details, such as the conduct of the war in Iraq.\n\nMr Obama seems to be different. By offering the most prized cabinet job to his rival, Hillary Clinton, and by keeping on Robert Gates, the defence secretary, who has done a good job, Mr Obama has shown a determination not to surround himself with cronies. He has put together a team which has impressed almost everyone with its calibre and its centrism. He has been tough already, dispatching blunderers and being prepared to admit to mistakes. He has repeatedly warned Americans that he will have to do unpleasant things.\n\nThe next four, or eight, years may be a disappointment, a triumphant renewal or something in between. Mr Obama is inexperienced, and right now the world looks especially forbidding. But he is a respectful and thoughtful man, and that is a good start. ","torrent":{"xt":"urn:btih:c7c4b795ea94309f07cc68c380a6b9e76ad8d680","amp;dn":"The+Economist+January+17th+2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7c4b795ea94309f07cc68c380a6b9e76ad8d680","infoHashBuffer":{"type":"Buffer","data":[199,196,183,149,234,148,48,159,7,204,104,195,128,166,185,231,106,216,214,128]},"announce":[],"urlList":[]}}