{"title":"Total Recorder DE 8.3.4600 (keygen-patch-Lz0) [ChingLiu]","uid":6925967,"size":6982770,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c7c452736a2a4e385bb122bff804ab79f37f1ea4&amp;dn=Total+Recorder+DE+8.3.4600+%28keygen-patch-Lz0%29+%5BChingLiu%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"maximersk","files":5,"time":1325501184,"description":"Total Recorder DE 8.3.4600 (keygen-patch-Lz0) [ChingLiu]\n\n\n\n\nTotal Recorder Developer Edition is an edition of Total Recorder that allows you to integrate the capabilities of Total Recorder (audio and video recording, editing, processing, and playing) with other applications. With the Developer Edition, you can record from any combination of video and audio sources, including output of another audio application in Software mode.\n\nTotal Recorder Developer Edition Main Features:\n\nAs a stand-alone program, it has the same features as the VideoPro Edition. \nTotal Recorder Developer Edition provides COM interfaces so that all of its functions can be invoked programmatically from within another program (e.g. C/C++, C#, VB, or Java programs) or from within a script (e.g. VB Script, JavaScript, or Perl) rather than interactively. In this mode, Total Recorder can be visible or invisible depending on your needs for controlling the program.\nThe Total Recorder Developer Edition package contains additional documentation and sample code (C++, C#, Visual Basic and JavaScript) for writing applications that can control Total Recorder through COM facilities.\nYou can obtain the source code for the symbolic language (similar to Visual Basic) that corresponds to the interface operations you performed during your current Total Recorder session. The code can be appended with other useful information you can use to write applications to control Total Recorder. This feature can greatly facilitate writing your own code to control Total Recorder Developer Edition through COM technology. \nMany others features. \n\nSystem Requirements\n\nTotal Recorder Developer Edition requires the following:\n\n* A sound card. \n* 32-bit or 64-bit version of Microsoft Windows XP (SP2 or later), Windows Vista, or Windows 7. If you want to use Total Recorder with an older operating system, please follow this link. \n* DirectX version 9.0 or later (you can download the latest version of Direct X from the Microsoft website). \n* A graphic card that meets the VMR System Requirements. All video cards with the exception of some older cards meet these requirements. \n* Specific requirements for hardware resources depend on the operations you plan to perform with video. \n\nHomepage : http://www.totalrecorder.com/productfr_trDEV.htm\n\n\n\n\n          THANKS TO [ChingLiu] !!!!\n\n","torrent":{"xt":"urn:btih:c7c452736a2a4e385bb122bff804ab79f37f1ea4","amp;dn":"Total+Recorder+DE+8.3.4600+%28keygen-patch-Lz0%29+%5BChingLiu%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7c452736a2a4e385bb122bff804ab79f37f1ea4","infoHashBuffer":{"type":"Buffer","data":[199,196,82,115,106,42,78,56,91,177,34,191,248,4,171,121,243,127,30,164]},"announce":[],"urlList":[]}}