{"title":"O'Reilly - Learning SQL (August 2005) by Alan Beaulieu","uid":3590540,"size":614430,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c81d81f12d31844db588d005430cf896ea9fdef1&amp;dn=O%5C%27Reilly+-+Learning+SQL+%28August+2005%29+by+Alan+Beaulieu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"triplehorn","files":1,"time":1168038157,"description":"SQL (Structured Query Language) is a standard programming language for generating, manipulating, and retrieving information from a relational database. If you&amp;#039;re working with a relational database--whether you&amp;#039;re writing applications, performing administrative tasks, or generating reports--you need to know how to interact with your data. Even if you are using a tool that generates SQL for you, such as a reporting tool, there may still be cases where you need to bypass the automatic generation feature and write your own SQL statements.\nTo help you attain this fundamental SQL knowledge, look to Learning SQL, an introductory guide to SQL, designed primarily for developers just cutting their teeth on the language.\n\nLearning SQL moves you quickly through the basics and then on to some of the more commonly used advanced features. Among the topics discussed:\n\n - The history of the computerized database\n - SQL Data Statements--those used to create, manipulate, and retrieve data stored in your database; example statements include select, update, insert, and delete\n - SQL Schema Statements--those used to create database objects, such as tables, indexes, and constraints\n - How data sets can interact with queries\n - The importance of subqueries\n - Data conversion and manipulation via SQL&amp;#039;s built-in functions\n - How conditional logic can be used in Data Statements\n\nBest of all, Learning SQL talks to you in a real-world manner, discussing various platform differences that you&amp;#039;re likely to encounter and offering a series of chapter exercises that walk you through the learning process. Whenever possible, the book sticks to the features included in the ANSI SQL standards. This means you&amp;#039;ll be able to apply what you learn to any of several different databases; the book covers MySQL, Microsoft SQL Server, and Oracle Database, but the features and syntax should apply just as well (perhaps with some tweaking) to IBM DB2, Sybase Adaptive Server, and PostgreSQL.\nPut the power and flexibility of SQL to work. With Learning SQL you can master this important skill and know that the SQL statements you write are indeed correct.","torrent":{"xt":"urn:btih:c81d81f12d31844db588d005430cf896ea9fdef1","amp;dn":"O%5C%27Reilly+-+Learning+SQL+%28August+2005%29+by+Alan+Beaulieu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c81d81f12d31844db588d005430cf896ea9fdef1","infoHashBuffer":{"type":"Buffer","data":[200,29,129,241,45,49,132,77,181,136,208,5,67,12,248,150,234,159,222,241]},"announce":[],"urlList":[]}}