{"title":"Encyclopedia of Psychology 1st Ed (8 Vol Set) (2000).pdf Gooner","uid":12193424,"size":119143723,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c9c9f29fa903aa4d1fdb0c89be05356152fc1b9b&amp;dn=Encyclopedia+of+Psychology+1st+Ed+%288+Vol+Set%29+%282000%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1438699470,"description":"Publisher: American Psychological Association; 1 edition (March 16, 2000)\nLanguage: English\nISBN-10: 1557981876\nISBN-13: 978-1557981875\n\nAfter more than a century of extraordinary growth and development, the science of psychology at last has a reference source that defines the study of mind and behavior. \nHere in eight superbly organized volumes is the definitive guide to every area of psychological theory, research, and practice. International in scope, the Encyclopedia of Psychology is the first place to turn to for authoritative information on every area of the field. Organized alphabetically, the articles range from 500 to 7,000 words in length including 400 biographies. An extensive system of cross-references and blind entries facilitate research from article to article and clarify links within the field. And an exhaustive index locates topics quickly and easily--providing many points of access across areas of interest and fields of study. \nThe Encyclopedia of Psychology serves a remarkable variety of readers: students and their teachers in every area of psychology as well as in such related fields as sociology, social work, nursing, and allied health; researchers in the cognitive sciences and neurosciences; and clinicians, counselors, and other mental health and human service professionals. It will be the definitive information, research, and reference source for many years to come","torrent":{"xt":"urn:btih:c9c9f29fa903aa4d1fdb0c89be05356152fc1b9b","amp;dn":"Encyclopedia+of+Psychology+1st+Ed+%288+Vol+Set%29+%282000%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9c9f29fa903aa4d1fdb0c89be05356152fc1b9b","infoHashBuffer":{"type":"Buffer","data":[201,201,242,159,169,3,170,77,31,219,12,137,190,5,53,97,82,252,27,155]},"announce":[],"urlList":[]}}