{"title":"Earth.2140.HD-HI2U","uid":9203855,"size":797233211,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c9f4719ba5e73139c8d87fce1548eb6af4cf4d6e&amp;dn=Earth.2140.HD-HI2U&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mr.Stifmeister","files":2,"time":1384645345,"description":"\nHI2U!\n\nEarth 2140 HD (c) Topware Interactive\n\nRelease Date : 16th of November, 2013\nProtection   : Steam\nType         : Strategy\nSize         : 16 x 50mb\n\nDescription:\n~~~~~~~~~~~~\n\nThe year is 2140. After numerous wars and several environmental disasters, only\ntwo world powers remain; the United Civilized States ( UCS ), covering the\nAmerican continent, Western Europe and North Africa, and the Eurasian Dynasty\n( ED ) covering the coherent landmasses of Eastern Europe and Asia. The damage\ncaused by the long wars led both world powers to evacuate the population to\nrecently built underground cities.\n\nAustralia and most parts of Africa were sacrificed during the long wars, which\nlasted several decades. Highly toxic biological and chemical weapons were\ndeveloped on these continents, leaving them so badly contaminated, that no human\nlife can survive there. Not even the use of robots and machines is possible. The\ngeneral opinion was that these continents would forever remain uninhabitable,\nand they were wiped from every map. Most of the worlds population forgot that\nthis land ever existed.\n\nNatural resources are becoming scarce and have to be extracted above ground.\nThere have been a number of small conflicts between the UCS and the ED, the last\nof which escalated and became a fierce and bitter war - the final world war.\nOnly one side can win. This final war will decide who will get the last of the\navailable natural resources and ultimately rule the world.\n\nEARTH 2140 is a real time strategy game involving the high tech warfare of the\n22nd century. More than 50 exciting missions, an unprecedented AI, more than 100\nground units, mechs, flying units and ships, strategic orders like formations,\nescorts and others make Earth 2140 a high class product.\n\nThis version of Earth 2140 supports resolutions up to full HD and contains both\nMission Packs (Mission Pack 1 and Mission Pack 2).\n\n\nInstall:\n~~~~~~~\nUnrar, mount/burn, install, copy crack from Crack folder on the image to where\nyou installed the game. Enjoy.\n\nNote: old/classic version of this game is found in the classic subdir.\n","torrent":{"xt":"urn:btih:c9f4719ba5e73139c8d87fce1548eb6af4cf4d6e","amp;dn":"Earth.2140.HD-HI2U","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9f4719ba5e73139c8d87fce1548eb6af4cf4d6e","infoHashBuffer":{"type":"Buffer","data":[201,244,113,155,165,231,49,57,200,216,127,206,21,72,235,106,244,207,77,110]},"announce":[],"urlList":[]}}