{"title":"Wet Wilderness (1975)","uid":14744467,"size":1294635303,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:ca8bec20ee5eb0589ab1172fee39e326dd21091e&amp;dn=Wet+Wilderness+%281975%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"distinc","files":3,"time":1464710817,"description":"...::ScreenShots::...\r\n \nhttp://imagedisco.net/?v=4600089486\r\n \nhttp://imagedisco.net/?g=289871623\r\n\r\nOrgy, All Sex, Feature, Anal, Lesbians, Oral, Retro, Classic, Horror\r\n\r\nDescription:\r\n\r\nA mother, her son and daughter, and the daughter's girlfriend are out in the woods on a camping trip. While the mother and son head to a cabin, the daughter and her girlfriend go to a clearing, where they have sex. While the two women fornicate, they are happened upon by a machete-wielding man in an orange balaclava, who forces the two to perform various sexual acts on him, and each other. While her girlfriend is fellating the masked man, the daughter flees, with the man giving chase after he stabs the girlfriend in the crotch with his machete.\r\n\r\nThe man follows the daughter to the rest of the family, sexually abuses the mother, and forces the daughter to perform oral sex on her brother. After he sodomizes the mother, the man has her and her son copulate, and while he is distracted watching the two, the daughter makes a run for it. While stumbling through the woods, the daughter finds a man bound to a tree, and unties him after he says the masked man had captured him three days ago. Just as the daughter unleashes the man, the rapist (who has killed the son offscreen) appears with the mother in tow. The rapist makes the man, the daughter, and the mother have a threesome, then murders the man by striking him in the chest with an axe.\r\n\r\nAfter he has the mother and daughter clean the dead man's blood off themselves, the rapist forces the two to perform oral sex on him. As her mother fellates the man, the daughter grabs his discarded machete, and castrates him with it","torrent":{"xt":"urn:btih:ca8bec20ee5eb0589ab1172fee39e326dd21091e","amp;dn":"Wet+Wilderness+%281975%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca8bec20ee5eb0589ab1172fee39e326dd21091e","infoHashBuffer":{"type":"Buffer","data":[202,139,236,32,238,94,176,88,154,177,23,47,238,57,227,38,221,33,9,30]},"announce":[],"urlList":[]}}