{"title":"Terry Oldfield","uid":3516562,"size":146246216,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cb04a016556dc64dc00aef612cef09cfd5cb5870&amp;dn=Terry+Oldfield&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2012","files":17,"time":1156693796,"description":"Terence &quot;Terry&quot; Oldfield is an English composer. He is brother to well known music composers and performers Mike Oldfield and Sally Oldfield.\n\nFor those who are looking for the feelings of awe and wonder these encounters convey there is the music of Terry Oldfield. \n\nTerry&amp;#039;s gifts translate the enormity and complexity of these emotions to the rest of us through beautifully woven melodies.\n\nTerry began playing the flute on the Island of Hydra in Greece in 1970. The call of the ocean and the tinkering sounds of goat bells on his simple island home inspired him greatly. At this time he also began to practice meditation and contemplation on the mysteries of the realms of sound. Terry spent seven years in this way. During this time Terry travelled extensively throughout India. The mystical magic of India with its colours and music has always been a strong influence on his career and has flavoured his music. \n \nFrom here he moved into composing music for television in England, America and Europe. He also began a career as a recording artist with 30 CD?s released and three million sales world wide. \n\nTerry is a deeply spiritually inspired flautist and has focused in the past on his silver flutes including the concert and Alto. Recently he has become inspired to play the Bansuri Flute. The Bansuri is the traditional Indian flute made of simple bamboo. Various sizes of these flutes give different tones and notes. His latest albums: Reiki Harmony, Labyrinth and Ethereal are composed around the Bansuri.\n \n","torrent":{"xt":"urn:btih:cb04a016556dc64dc00aef612cef09cfd5cb5870","amp;dn":"Terry+Oldfield","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb04a016556dc64dc00aef612cef09cfd5cb5870","infoHashBuffer":{"type":"Buffer","data":[203,4,160,22,85,109,198,77,192,10,239,97,44,239,9,207,213,203,88,112]},"announce":[],"urlList":[]}}