{"title":"Secrets of Alchemy - The Great Cross and the End of Time by Jay","uid":4685200,"size":363925961,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cb078b5900b4dae214830ec06a991c2db835769a&amp;dn=Secrets+of+Alchemy+-+The+Great+Cross+and+the+End+of+Time+by+Jay+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Malbiz","files":1,"time":1233207956,"description":"New Dawn Magazine, Summer 2005\nA recommended addition to the library of any budding alchemist or metaphysician. Production values are solid, cinematography bright and steady.\n\nProduct Description\nIn this visually compelling and thought-provoking documentary, author, scholar and modern-day Indiana Jones, Jay Weidner uncovers some of the deepest secrets of the ancient western tradition of Alchemy - the knowledge of the fatal season of the apocalypse, the end of time and the great and imminent transformation of humanity. Using the work of the mysterious twentieth century French Alchemist, Fulcanelli, as his foundation, and his discovery of a three hundred fifty year old Alchemical Cross in the South of France, Jay Weidner describes the experiences, insights and powerful evidence that opens the door to a new view of the intimate relationship between myth, history, science and the true destiny of humanity. In doing so, he reveals the ultimate meaning underlying the resurrection of Christ, the message of the Book of the Revelations, the vision of Ezekiel and the Kabbalistic concept of the &quot;Restoration of the World.&quot;\n\nJoin him on this remarkable adventure as Jay Weidner journeys from the shores of Southern France through Alchemical Europe, Ancient Egypt and Peru, to decode the powerful and haunting message of the Great Cross of Hendaye.\n","torrent":{"xt":"urn:btih:cb078b5900b4dae214830ec06a991c2db835769a","amp;dn":"Secrets+of+Alchemy+-+The+Great+Cross+and+the+End+of+Time+by+Jay+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb078b5900b4dae214830ec06a991c2db835769a","infoHashBuffer":{"type":"Buffer","data":[203,7,139,89,0,180,218,226,20,131,14,192,106,153,28,45,184,53,118,154]},"announce":[],"urlList":[]}}