{"title":"Real World Adobe Illustrator CS4","uid":4818832,"size":49632451,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cb6ef0806ac2bbe67a548c7fa4a5398d1f3d74a9&amp;dn=Real+World+Adobe+Illustrator+CS4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"VasiaZozulia","files":-1,"time":1238660511,"description":"Real World Adobe Illustrator CS4 is the definitive reference to Adobe's industry-standard vector graphics software and is now in 4-color. With an easy, engaging style, author and past Illustrator product manager Mordy Golding takes readers through all of the features of the program, explaining not only how to use the multitude of features but also why and when to use them. This edition has been thoroughly updated for Illustrator CS4 and includes techniques on using the new multiple artboards for quicker Illustrator work across a variety of designs, demonstrations of the new Blob Brush tool and transparency in gradients, overviews of the new cross-product feature support with InDesign, Flash, and Flex (opening up new opportunities for collaborations between developers and designers), and coverage on a whirlwind of other new useful features.\n\nAlong with tips, sidebars, and expert commentary, there are also numerous 4-color illustrations and screen shots from contributing artists included to offer readers the most complete coverage on this extraordinary application. Designers from all fields--illustrators, animators, package designers, graphic designers, web designers, and more--will find Real World Adobe Illustrator CS4 their one-stop guide to creating powerful designs in Illustrator","torrent":{"xt":"urn:btih:cb6ef0806ac2bbe67a548c7fa4a5398d1f3d74a9","amp;dn":"Real+World+Adobe+Illustrator+CS4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb6ef0806ac2bbe67a548c7fa4a5398d1f3d74a9","infoHashBuffer":{"type":"Buffer","data":[203,110,240,128,106,194,187,230,122,84,140,127,164,165,57,141,31,61,116,169]},"announce":[],"urlList":[]}}