{"title":"PC Auto Shutdown v5.5 with Key [TorDigger]","uid":8304269,"size":873901,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:cbe5ecbc34340e7de46746f694953da969f6dfc7&amp;dn=PC+Auto+Shutdown+v5.5+with+Key+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TorDigger","files":9,"time":1364329410,"description":"PC Auto Shutdown\n\nPC Auto Shutdown is a handy software that helps you automatically shutdown, power off, reboot, hibernate, suspend or log off computers at schedule time you specifies. It can shut down computers at schedule time when no user is logged in or when computers are in suspended power conservation mode. It gives you different ways to schedule the shutdown event for your needs, such as daily, weekly and only once. During the shutdown, it can clean up Recycle Bin, temporary files, IE cache, IE cookies, IE history, IE auto- complete entries and recent document list to improve system performance and protect your privacy. \nA typical PC left on for 24 hours each day can use $70 or more of energy per year. If it's turned off at night and weekends, it will only use around $20 of energy per year. Power outages have happened in the world, from United States to Europe, so it's important for us to save electricity and money.\n\nKey features: \n\nShut down, power off, reboot, hibernate, suspend or log off computers at schedule time.\nShut down, power off, reboot, hibernate, suspend or log off computers at schedule time when no user is logged in\nActivate computers from suspended power conservation mode, and shut down, power off, reboot, hibernate, suspend or log off computers at schedule time\nDifferent schedules to meet your needs.\nYou can set up hotkeys to shut down your computer instantly.\nClean up IE cookies, history ,temporary files and Recycle Bin to protect your privacy.\nSet password to avoid others changing your schedule configuration.\nCustomize alarm sound and countdown duration during shutdown.\nLog each shutdown events.\n\nWhat's new:\n\nMarch 25th, 2013 PC Auto Shutdown Version 5.5 released\nSome minor tweaks\n\nSystem Requirement:\n\nPentium 166MHz or higher\nWindowsÂ© 98, SE, ME, 2000, XP, 2003, Vista, 7 and 8\n32 MB of available RAM (64 MB recommended) plus 3 MB of available disk space for installation\n\nHomepage: http://www.drivermagician.com/autoshutdown/index.htm\n\nInstallation Instructions:\n\n- Install program.\n- Register application with given name/key.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:cbe5ecbc34340e7de46746f694953da969f6dfc7","amp;dn":"PC+Auto+Shutdown+v5.5+with+Key+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cbe5ecbc34340e7de46746f694953da969f6dfc7","infoHashBuffer":{"type":"Buffer","data":[203,229,236,188,52,52,14,125,228,103,70,246,148,149,61,169,105,246,223,199]},"announce":[],"urlList":[]}}