{"title":"More Money than Brains - Penny, Laura [Non-Fiction] Mobi/Epub/PD","uid":8719246,"size":2296792,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cc5dbb09c2eb80e9eaa4a2fcd309fc8fb94d8811&amp;dn=More+Money+than+Brains+-+Penny%2C+Laura+%5BNon-Fiction%5D+Mobi%2FEpub%2FPD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"K-Slender","files":5,"time":1374390227,"description":"One of Canada's funniest and most incisive social critics reveals why in North America, where governments spend so much on schools and colleges, training is valued far more than education and loud-mouth ignoramuses are widely and publicly celebrated.\n\nPublic education in the United States is in such pitiful shape, the president wants to replace it. Test results from Canadian public schools indicate that Canadian students are at least better at taking tests than their American cousins. On both sides of the border, education is rapidly giving way to job training, and learning how to think for yourself and for the sake of dipping into the vast ocean of human knowledge is going distinctly out of fashion.\n\nIt gets worse, says Laura Penny, university lecturer and scathingly funny writer. Paradoxically, in the two nations that have among the best universities, libraries, and research institutions in the world, intellectuals are largely distrusted and yelping ignoramuses now clog the arenas of public discourse.\n\nA brilliant defence of the humanities and social sciences, More Money Than Brains takes a deadly and extremely funny aim at those who would dumb us down.","torrent":{"xt":"urn:btih:cc5dbb09c2eb80e9eaa4a2fcd309fc8fb94d8811","amp;dn":"More+Money+than+Brains+-+Penny%2C+Laura+%5BNon-Fiction%5D+Mobi%2FEpub%2FPD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc5dbb09c2eb80e9eaa4a2fcd309fc8fb94d8811","infoHashBuffer":{"type":"Buffer","data":[204,93,187,9,194,235,128,233,234,164,162,252,211,9,252,143,185,77,136,17]},"announce":[],"urlList":[]}}