{"title":"Mary Chapin-Carpenter - Come Darkness Come Light: 12 Songs","uid":5994124,"size":271996297,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:cdbfaa44249f52431f0c7083f56883f726b47441&amp;dn=Mary+Chapin-Carpenter+-+Come+Darkness+Come+Light%3A+12+Songs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ddawg","files":-1,"time":1290983349,"description":" &lt;a href=&quot;http://g-ecx.images-amazon.com/images/G/01/ciu/07/8d/0639810ae7a0970a66a5e110.L.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://g-ecx.images-amazon.com/images/G/01/ciu/07/8d/0639810ae7a0970a66a5e110.L.jpg&lt;/a&gt;\n\n\nTitle: Come Darkness Come Light: Twelve Songs of Christmas\nArtist: Mary Chapin Carpenter\nAudio CD (September 30, 2008) \nOriginal Release Date: 2008 \nNumber of Discs: 1 \nGenre: Christmas\nFormat: Free Lossless Audio Codec\n\n\nTrack Listing:\n\n01 Once in Royal David\\'s City\n02 Hot Buttered Rum\n03 Still, Still, Still\n04 On a Quiet Christmas Morn\n05 Come Darkness, Come Light\n06 Christmas Time in the City\n07 Candlelight Carol\n08 The Longest Night of the Year\n09 Thanksgiving Song \n10 Bells Are Ringing\n11 Christmas Carol\n12 Children, Go Where I Send Thee\n\n\nAmazon Description:\nFinally, a Christmas album worth listening to all year long. When Mary Chapin Carpenter set out to create Come Darkness, Come Light, she took a far different approach to recording a holiday album than most artists do. Rather than simply lending her voice to time-worn Christmas standards, Mary Chapin wrote her own set of heartfelt songs which explore the many meanings and emotions that Christmas evokes in each of us. These songs, mixed with a few hand-picked gems from other writers and rarely heard traditional tunes, will speak directly to the hearts of all Mary Chapin Carpenter fans. These are not merely holiday songs, they are simply great Mary Chapin Carpenter songs, both warm and intimate. And while they artfully capture the spirit of the season, this is a rare Christmas album that doesn\\'t feel like it needs to be kept on the shelf between New Year\\'s and Thanksgiving. With stellar support from longtime musical partners Jon Carroll (piano) and co-producer John Jennings (guitars), Mary Chapin\\'s voice goes down as warmly as hot cider on a cold winter\\'s night.\n\nAllmusic Review:\n\\&quot;The same old stories, same old songs/We dust them off when Christmas comes,\\&quot; Mary Chapin Carpenter sings in \\&quot;Christmas Carol,\\&quot; a song she wrote for her first holiday album, Come Darkness, Come Light: Twelve Songs of Christmas, and while the line resonates in context, it also stands out because it sums up what Carpenter has chosen not to do with this disc. While Christmas albums tend to be dominated by cheerful but rote interpretations of holiday favorites, especially from artists with a history on the country charts, Carpenter wrote or co-wrote six new songs for Come Darkness, Come Light, and though there are three traditional numbers on the album, the usual suspects such as \\&quot;White Christmas\\&quot; and \\&quot;Rudolph the Red-Nosed Reindeer\\&quot; are conspicuous in their absence. Come Darkness, Come Light instead focuses on the more thoughtful and spiritual side of the season -- \\&quot;Bells Are Ringing\\&quot; ponders symbols of faith in a chaotic world, \\&quot;Christmas Carol\\&quot; records the thoughts of a casual believer who is more concerned with Peace on Earth than the trappings of the Yuletide season, and \\&quot;Christmas Time in the City\\&quot; tells a fable of a street musician struggling to make a few bucks during the shopping season. Come Darkness, Come Light is the rare Christmas album that\\'s made with thinking adults in mind, and Carpenter and co-producer John Jennings weren\\'t afraid to make a record that\\'s as thoughtful in its music as its lyrics; the arrangements are spare and tasteful, conveying the beauty of the melodies without cluttering them with gingerbread, and Carpenter\\'s vocals are heartfelt without sounding histrionic, reflecting the inward contemplation that\\'s a clear part of this music. Come Darkness, Come Light is a brave and beautiful collection of songs that dares to run counter to what most folks expect from a Christmas album, and it asks some questions worth pondering about the meaning behind the annual celebration while mirroring the simple joys of a snowy night. \n\n","torrent":{"xt":"urn:btih:cdbfaa44249f52431f0c7083f56883f726b47441","amp;dn":"Mary+Chapin-Carpenter+-+Come+Darkness+Come+Light%3A+12+Songs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cdbfaa44249f52431f0c7083f56883f726b47441","infoHashBuffer":{"type":"Buffer","data":[205,191,170,68,36,159,82,67,31,12,112,131,245,104,131,247,38,180,116,65]},"announce":[],"urlList":[]}}