{"title":"Groovy Programming:An Introduction for Java Developers","uid":8416141,"size":3758296,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ce763f55168cdea592607518920e19974a9957dd&amp;dn=Groovy+Programming%3AAn+Introduction+for+Java+Developers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"roadjag","files":-1,"time":1367045585,"description":"Please help seed I have satcoms cant seed for long\n\nGroovy Programming is an introduction to the Java-based scripting language Groovy. Groovy has much in common with popular scripting languages such as Perl, Python, and Ruby, but is written in a Java-like syntax. And, unlike these other languages, Groovy is sanctioned by the Java community for use on the Java platform. Since it is based on Java, applications written in Groovy can make full use of the Java Application Programmer Interfaces (APIs). This means Groovy can integrate seamlessly with applications written in Java, while avoiding the complexities of the full Java language. This bare-bones structure also means Groovy can be used as an introduction to Java and to programming in general. Its simpler constructions and modern origins make it ideal as a first language and for introducing principles such as object-oriented programming.\nThis book introduces all the major aspects of Groovy development and emphasizes Groovy's potential as a learning tool. Case studies and exercises are included, along with numerous programming examples. The book begins assuming only a general familiarity with Java programming, and progresses to discuss advanced topics such as GUI builders, Groovlets, Unit Testing, and Groovy SQL. \n\n* The first comprehensive book on Groovy programming that shows how writing applications and scripts for the Java platform is fast and easy\n\n* Written by leading software engineers and acclaimed computing instructors\n\n* Offers numerous programming examples, code samples, detailed case studies, exercises for self-study, and a companion website with a Windows-based Groovy editor","torrent":{"xt":"urn:btih:ce763f55168cdea592607518920e19974a9957dd","amp;dn":"Groovy+Programming%3AAn+Introduction+for+Java+Developers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce763f55168cdea592607518920e19974a9957dd","infoHashBuffer":{"type":"Buffer","data":[206,118,63,85,22,140,222,165,146,96,117,24,146,14,25,151,74,153,87,221]},"announce":[],"urlList":[]}}