{"title":"Image.Line.PoiZone.v2.0.2.VSTi.MAC.OSX.UB-DYNAMiCS","uid":3992207,"size":3850464,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ce82be691b28115520d1c7a6feacdf7d8c00b0ca&amp;dn=Image.Line.PoiZone.v2.0.2.VSTi.MAC.OSX.UB-DYNAMiCS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"melmac_labs","files":5,"time":1201110169,"description":"PoiZone is a subtractive software synthesizer designed to bring you professional quality results, without a learning curve that hinders your creativity. The concept behind PoiZone was to design a synthesizer that had the smallest number of controls while providing the maximum flexibility and features.\n\nUseless knobs were ruthlessly removed so what remains is a UI where every knob counts. Once you have spent some time auditioning the preset patches we are sure you will agree that PoiZone packs a lot of punch in what appears to be a simple package, enjoy! \n\nFeatures :\n\n \t2 oscillators that can produce the two most popular and useful shapes for subtractive synthesis: fat, bright SAW and PULSE shapes, with adjustable pulse width. \n \tNoise generator. \n \tRing modulation\n \tSync modulation\n \t16 voice polyphony\n \t4 voice UNISON with user-adjustable stereo panning and &amp;#039;Octaver&amp;#039;. The Octaver expands the harmonic range and flexibility of the unison sound to support the creation of realistic &amp;#039;vox-like&amp;#039; effects\n \t2 ADSR envelope generators. One for traditional envelope duties, the other can be user assigned\n \t3 FILTER modes - low pass, band pass and high pass. PoiZone features a warm, super-trooper-extra-analog-moog-like-mega filter with self oscillation. Special attention has been given to precise filter tuning so that when KEYTRK is set to maximum, the PoiZone filter will track keyboard frequency precisely so it can be used as an oscillator. The PoiZone filter has bright and clean sound or it can be &amp;#039;grungy&amp;#039; and &amp;#039;angry&amp;#039; when resonance is introduced as it features some light distortion. And even with distortion the filter sounds clean on high frequencies as it has no aliasing\n \tKeyboard and Velocity tracking for the filter\n \tMulti-mode Arpeggiator\n \tNoise Gate with an adjustable 16 step pattern. The gate features smoothness control and the ability to import/export patterns to .fxp files\n \tDELAY effect, with tempo-synced click-free stereo delays and delay time modulation. Lo-cut and hi-cut for trancers! \n \tCHORUS with a warm sound with great unison emulation\n \tMIDI learn feature with the ability to save/load MIDI setups to/from a patch\n \tLFO and MOD WHEEL modulation. Can be assigned to a wide range of performance parameters in PoiZone  \n\n\nMORE INFORMATION AT: http://www.image-line.com/documents/poizone.html\n\nINSTALL NOTES:\n\n  *Install the app.                                                       \n  *Copy PoiZone.dll into the installed app dir(s).                        \n  *Import ?regkey.reg? into registry.\n\n","torrent":{"xt":"urn:btih:ce82be691b28115520d1c7a6feacdf7d8c00b0ca","amp;dn":"Image.Line.PoiZone.v2.0.2.VSTi.MAC.OSX.UB-DYNAMiCS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce82be691b28115520d1c7a6feacdf7d8c00b0ca","infoHashBuffer":{"type":"Buffer","data":[206,130,190,105,27,40,17,85,32,209,199,166,254,172,223,125,140,0,176,202]},"announce":[],"urlList":[]}}