{"title":"Krama_-_Terra_Nova-2008-gEm","uid":4262292,"size":97695562,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cfa9983a551737571c4887420da64d8f8461a797&amp;dn=Krama_-_Terra_Nova-2008-gEm&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Eudanick","files":12,"time":1214525229,"description":"Behind Krama Project are Greek duo Dimitris Violitzis and Elias Garanis. They start producing progressive trance music in 2001 after a lot of experiments in various styles, including experimental, i.d.m., classical etc. Dimitris Violitzis is music technologist,sound designer,and programmer and also running his solo downtempo experimental project Tau.T.C. since 2006. Elias Garanis has various studies in music theory. Since the age of 9 he&amp;#039;s on accordeon and piano playing and from the age of 16 he has start to compose his own concerts. Both known each other at high school where they met the electronic music world and start experiment for fun. Krama&amp;#039;s main vision is to create another style of music accessible to every ear, independently of his music background. The word Krama is Greek and means the mix of two metals which we translate as two different opinions that can be mixed to give one unique result that you can hear in the most known labels of Trance scene such Zillion Mental Anarchy, (collaboration with Maria Castell) Yellow Sunshine Explotion, Savva Records and Midijum Records.","torrent":{"xt":"urn:btih:cfa9983a551737571c4887420da64d8f8461a797","amp;dn":"Krama_-_Terra_Nova-2008-gEm","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cfa9983a551737571c4887420da64d8f8461a797","infoHashBuffer":{"type":"Buffer","data":[207,169,152,58,85,23,55,87,28,72,135,66,13,166,77,143,132,97,167,151]},"announce":[],"urlList":[]}}