{"title":"Bill Evans - The Gambler Live at Blue Note Tokyo TQMP","uid":4530318,"size":392263752,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d0fe1442a5a3cdb6ed28d55bc4f490e1533983cf&amp;dn=Bill+Evans+-+The+Gambler+Live+at+Blue+Note+Tokyo+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Breezin","files":6,"time":1227533541,"description":"Quote from amazon (5 stars)\n\n&quot;Great live album. Former Miles Davis &amp; Mahavishnu saxophone, Bill Evans, leads a quartet comprised of keyboardist Mitchell Forman (also ex-Mahavishnu), Weather Report electric bassist Victor Bailey and Brecker Brothers/Gato Barbieri drummer extraordinaire Richie Morales. I bought this fire-breather in 1990 and still listen to its best tracks: &quot;Sea of Fertility,&quot; &quot;Gorgeous,&quot; &quot;The Gambler&quot; &amp; &quot;Crest Annex,&quot; on a regular basis because they all made it to various best of comps. I made over the years. &quot;Sea of Fertility&quot; is the most incredible track here. A melodically soaring Mitch Forman composition that originally appeared on his out-of-print &quot;Train of Thought&quot; album &amp; featured one of Michael Brecker&amp;#039;s greatest tenor solos, this live, even more wired version features a Bill Evans soprano sax solo so intense, it&amp;#039;s hard to imagine even Wayne Shorter pulling it off in his mid-70s heyday. This is followed by a Chick-Corea-level piano solo by Foreman. This track now sits in an honored position on a best-of-the-best-of-fusion-horns compilation I made right next to its studio version with Brecker, &quot;Tres Palabras&quot; by Joe Henderson, &quot;Merceditas&quot; by Gato Barbieri,&quot; the live versions of &quot;Freezing Fire&quot; and &quot;Man in the Green Shirt&quot; by Weather Report,&quot; the live version of &quot;Sponge&quot; by the Brecker Brothers, the entire &quot;Ennea&quot; by Chase, and &quot;Squib Cakes&quot; by Tower of Power. Yes, it&amp;#039;s that good. Another Forman  composition, &quot;Gorgeous,&quot; is a ballad that starts off mellow before Evans turns up the heat on a very clear-toned and confident tenor, gradually getting louder and more intense but with just the right amount of passion and fire to take the song out, never overstating and straining too much for effect the way players of less Godzilla-like technical ability surely would. Tour chops are definitely a factor here. &quot;The Gambler&quot; is the next best track with a very cool, almost lounging, funky slow-burn intensity that simmers away fabulously while &quot;Crest Annex&quot; is the James Brown funky beat type tune taken to its apotheosis with scorching hot tenor solos alternating tearing-the-roof-off theatrics with intense Richie Morales drum breaks. \n\nThe sound quality of the live recording is excellent, very warm and superior to quite a few discs made since then in the same venue. If you have a good system, this one will really crank. Bottom line: a no-brainer purchase for anyone even remotely interested in great musicians playing at their absolute best.&quot;\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project me and my fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at:  &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980&amp;#039;s cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nYou can find all TQMP uploads at: www.thepiratebay.se  (Simply use the TQMP searchtag :)\n\nContact: &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;99fbebfcfce3f0f7d9f5f0effcb7f7f5&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\nGreetings to ya&amp;#039;all from the Breezin Dutchman! d:)\n","torrent":{"xt":"urn:btih:d0fe1442a5a3cdb6ed28d55bc4f490e1533983cf","amp;dn":"Bill+Evans+-+The+Gambler+Live+at+Blue+Note+Tokyo+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0fe1442a5a3cdb6ed28d55bc4f490e1533983cf","infoHashBuffer":{"type":"Buffer","data":[208,254,20,66,165,163,205,182,237,40,213,91,196,244,144,225,83,57,131,207]},"announce":[],"urlList":[]}}