{"title":"[MP3] The US Constitution","uid":4661395,"size":29899267,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d1186ead72d8f74f75a4bf66fb8fc01103e14d73&amp;dn=%5BMP3%5D+The+US+Constitution&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"liberty-books","files":1,"time":1232405046,"description":"The US Constitution as read by PitViper of LibertyForest.com forums.\n\n\nThe Constitution of the United States of America is the supreme law of the United States. It provides the framework for the organization of the United States Government. The document defines the three main branches of the government: The legislative branch with a bicameral Congress, an executive branch led by the President, and a judicial branch headed by the Supreme Court. Besides providing for the organization of these branches, the Constitution carefully outlines which powers each branch may exercise. It also reserves numerous rights for the individual states, thereby establishing the United States' federal system of government. It is the shortest and oldest written constitution of any major sovereign state.\n\nThe United States Constitution was adopted on September 17, 1787, by the Constitutional Convention in Philadelphia, Pennsylvania, and later ratified by conventions in each U.S. state in the name of &quot;The People&quot;; it has since been amended twenty-seven times, the first ten amendments being known as the Bill of Rights.[2][3] The Articles of Confederation and Perpetual Union was actually the first constitution of the United States of America.[4] The U.S. Constitution replaced the Articles of Confederation as the governing document for the United States after being ratified by nine states. The Constitution has a central place in United States law and political culture.[5] The handwritten, or &quot;engrossed&quot;, original document penned by Jacob Shallus is on display at the National Archives and Records Administration in Washington, D.C.","torrent":{"xt":"urn:btih:d1186ead72d8f74f75a4bf66fb8fc01103e14d73","amp;dn":"%5BMP3%5D+The+US+Constitution","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1186ead72d8f74f75a4bf66fb8fc01103e14d73","infoHashBuffer":{"type":"Buffer","data":[209,24,110,173,114,216,247,79,117,164,191,102,251,143,192,17,3,225,77,115]},"announce":[],"urlList":[]}}