{"title":"Frank Zappa - Baby Snakes (1979)(5.1 FLAC)","uid":10491285,"size":4338912714,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d16f57f1eaa96471f6b66636a80e1a9ce24bc32c&amp;dn=Frank+Zappa+-+Baby+Snakes+%281979%29%285.1+FLAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"scottyscum","files":-1,"time":1404551328,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0078820/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0078820/&lt;/a&gt;                                           Baby Snakes is a movie which includes footage from Frank Zappa's 1977 Halloween concert at New York City's Palladium Theater, backstage antics from the crew, and stop motion clay animation from award-winning animator Bruce Bickford.             Initially, the film had particular difficulty finding a distributor. Frank Zappa tried to interest United Artists, the company that released 200 Motels, but they declined. Other studios followed United Artists' lead, fearing that Zappa's &quot;cinematic style&quot; had lost considerable appeal in post-'70s pop culture, and also declined to distribute the film.\n\nSeveral European distributors told Zappa that there might be interest if the running time was cut from its original 168-minute length. The film was cut to 90 minutes, but still, there were no takers.\n\nEven after Bruce Bickford's sequences won first prize at a French animated film competition, there was no interest. Eventually Zappa took it upon himself to distribute the film independently, via his own production company, Intercontinental Absurdities. The film ran 24 hours a day at the Victoria Theater in New York City. (This can be clearly seen in the opening credits to the film, &quot;Eaten Alive,&quot; partly filmed in New York at the time Baby Snakes was playing. You can clearly see the theater marquee in said opening credits.) It made a handsome profit.[citation needed]\n\nThe film, in its original version, was released on VHS tape via mail order directly from Zappa until the mid-90s when the double-tape set eventually &quot;sold out&quot; and further replication runs were not fulfilled. The 90 minute-version was briefly made available on home video in the 1980s also. Finally, after many years of being &quot;out of print&quot; Baby Snakes was released on DVD on December 9, 2003 by Eagle Vision United States with a new 5.1 Surround mix. This was the first time that the film was made commercially available to the public at large rather than through limited mail order directly from Zappa.                                   Directed by \tFrank Zappa\nProduced by \tFrank Zappa\nBennett Glotzer\nStarring \tTerry Bozzio\nRoy Estrada\nAdrian Belew\nEd Mann\nPatrick O'Hearn\nPeter Wolf\nTommy Mars\nand New York's Finest Crazy Persons\nMusic by \tFrank Zappa\nDistributed by \tIntercontinental Absurdities\nRelease date(s) \tDecember 21, 1979\nRunning time \t166 min\nLanguage \tEnglish\nBudget \t$679,000","torrent":{"xt":"urn:btih:d16f57f1eaa96471f6b66636a80e1a9ce24bc32c","amp;dn":"Frank+Zappa+-+Baby+Snakes+%281979%29%285.1+FLAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d16f57f1eaa96471f6b66636a80e1a9ce24bc32c","infoHashBuffer":{"type":"Buffer","data":[209,111,87,241,234,169,100,113,246,182,102,54,168,14,26,156,226,75,195,44]},"announce":[],"urlList":[]}}