{"title":"Hentai / Urotsukidoji complete Saga flv. (eng)","uid":6328212,"size":3907148346,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:d294cd69434b078f3fa5ee5ce1cdb63a1e7c052c&amp;dn=Hentai+%2F+Urotsukidoji+complete+Saga+flv.+%28eng%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"jimevjr","files":13,"time":1303190832,"description":"Flash Video English version  NOT FOR KIDS\n\n\nUrotsukidoji: Legend of the Overfiend\n\nAccording to legend, the world consists of three dimensions - the Human World, the World of \nMan-Beasts and the World of Monster Demons. Every 3,000 years, the Overfiend is brought to \nlife through the body of a human to destroy the existing world and untie these three dimensions. \nHowever, the Overfiend's new world is a sickening place of horrendous violence, uncontrollable \nlusts and supernatural forces beyond comprehension. \n\n\n\n\nUrotsukidoji II: Legend of the Demon Womb\n\nDetermined to enslave the world, the mad scientist, Dr. Munhihausen Jr., uses his late father's \nNazi Death Rape Machine to summon a monster with the power to slay the Overfiend. Manhihausen's \nsearch for the Overfiend's nemesis leads him to supernaturally endowed 19-year-old cousin Nagumo's \nblood after an accident. Now, Takeaki has begun to develop monstrous powers of his own... Is he \ndestined to become the demonic King of Evil, and the only force capable of obliterating the Overfiend\n\n\n\nUrotsukidoji III: Return of the Overfiend (Eps. 1 - 4)\n\n\n\nAs the Overfiend slumbers, the mad emperor Caesar rises to power, enslaving a new race of demon beasts. \nInto this cruel existence is born the Lord of Chaos, the Overfiend's nemesis. As the blood-thirsty beasts \ncapture the tyrant's daughter in a brutal coup, the Overfiend must awaken to an apocalyptic battle of the \nGods! \n\n\nUrotsukidoji IV: Inferno Road (Eps. 1 - 3) \n\n\nThe road to Hell is paved with blood. It is the Age of the Overfiend, and flesh-hungry monsters rule the \nEarth. Immortal half-demon Amano Jyaku travels the wasteland, witness to the rape and torture of the human \nrace. The last hope for humanity is the demonic Lord of Chaos, the Overfiend's natural enemy. Will the \nworld survive their final battle? ","torrent":{"xt":"urn:btih:d294cd69434b078f3fa5ee5ce1cdb63a1e7c052c","amp;dn":"Hentai+%2F+Urotsukidoji+complete+Saga+flv.+%28eng%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d294cd69434b078f3fa5ee5ce1cdb63a1e7c052c","infoHashBuffer":{"type":"Buffer","data":[210,148,205,105,67,75,7,143,63,165,238,92,225,205,182,58,30,124,5,44]},"announce":[],"urlList":[]}}