{"title":"This Perfect Day - C-60 [1997]","uid":9686933,"size":329383348,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d3c9b4c053f332f09073897f8112cbf39c81bf29&amp;dn=This+Perfect+Day+-+C-60+%5B1997%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"GenXRock","files":-1,"time":1393786142,"description":"Review by Stewart Mason  [-]\nThis Perfect Day are probably the least overtly Swedish of the mid-'90s' deluge of Swede pop bands; if anything, they sound like yet another post-Blur Brit-pop group. Singer Mats Eriksson even sounds kind of like Damon Albarn without the Paul Weller-derived vocal affectations, and the shuffling beat, guitar explosions, and trumpet accents of the first single, &quot;Down on My Knees,&quot; suggest what Oasis might sound like if they had talent for anything besides Beatles plagiarism. C-60, the band's fourth album but only their second U.S. release, features a dozen catchy pop songs given depth and weight by smart production touches (whining Moog on &quot;Fishtank,&quot; horns on &quot;So Naive,&quot; handclaps and harmonies everywhere) and a super-compressed sound favored by guitarists Rickard Johansson and Ove Markstrom that gives nearly every song an exciting, contents-under-pressure edge. Titles like those above and the equally power-of-positive-thinking &quot;Young and Stupid,&quot; &quot;Break My Arm,&quot; and the ironically joyous &quot;In Two Weeks You Will Be Forgotten&quot; (probably the best song on the album) add to the, erm, fun. Although the opening track, the searing lost-love rocker &quot;Could Have Been Friends,&quot; sounded like a possible hit, C-60 did not live up to commercial expectations, and the group was dropped by Sony shortly after its release. (4.5/5)","torrent":{"xt":"urn:btih:d3c9b4c053f332f09073897f8112cbf39c81bf29","amp;dn":"This+Perfect+Day+-+C-60+%5B1997%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3c9b4c053f332f09073897f8112cbf39c81bf29","infoHashBuffer":{"type":"Buffer","data":[211,201,180,192,83,243,50,240,144,115,137,127,129,18,203,243,156,129,191,41]},"announce":[],"urlList":[]}}