{"title":"The Andromeda Strain Soundtrack by Gil MellÃƒÂ©","uid":4567437,"size":67996776,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d3f322f188a96bfd9ded4a93c8c54848791299b5&amp;dn=The+Andromeda+Strain+Soundtrack+by+Gil+Mell%C3%83%C2%A9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ARH08","files":12,"time":1228925885,"description":"This is the original soundtrack from the 1971 film &quot;The Andromeda Strain&quot;, based on the novel of the same name by Michael Crichton.  The music in this film was composed by Gil MellÃƒÂ©.\n\nThe soundtrack was only ever released on vinyl LP, and thus far has not yet been officially released digitally remastered, though there have been many different bootlegged copies floating around on CD.  A search through eBay usually turns up a few of these unofficial copies, as well as some of the original LP's.\n\nThe original LP was hexagonal in shape, and came in some interesting packaging.  Photos of the original LP are included in this torrent.\n\nI did not create any of the files in this torrent; after much searching, I found them in a .zip file via a link on someone's blog site.  Based on the contents of that blog, it seems the blogger had an original LP and managed to rip the music to MP3 himself at 320 kbps.  Whatever he did, he did it well, as this is a very high quality version with little to no background noise or unintentional static.\n\nThis is an early example of an electronically composed soundtrack, yet it still sounds reasonably fresh today.  It is an interesting listen, and I recommend it to anyone with an interest in ambient electronica, noise, or even industrial.\n\nIf you have seen the recent mini-series remake of the film, you should know that the original is a far superior film in every way.  It is one of those movies I believe everyone should watch, whether you have seen the remake or not, and whether you liked the remake or not.\n\nThank you.\n\nTrack list:\n1 Wildfire\n2 Hex\n3 Andromeda\n4 Desert Trip\n5 The Piedmont Elegy\n6 Op\n7 Xenogenesis\n8 Strobe Crystal Green","torrent":{"xt":"urn:btih:d3f322f188a96bfd9ded4a93c8c54848791299b5","amp;dn":"The+Andromeda+Strain+Soundtrack+by+Gil+Mell%C3%83%C2%A9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3f322f188a96bfd9ded4a93c8c54848791299b5","infoHashBuffer":{"type":"Buffer","data":[211,243,34,241,136,169,107,253,157,237,74,147,200,197,72,72,121,18,153,181]},"announce":[],"urlList":[]}}