{"title":"SST GENs B! - Free Ableton Live Pack 2 - Togeo Studios","uid":4390031,"size":112328518,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:d3faff3858c4a1635c7d2d04148d14b8abe5667a&amp;dn=SST+GENs+B%21+-+Free+Ableton+Live+Pack+2+-+Togeo+Studios&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GPete32352","files":6,"time":1221122507,"description":"\nSST GENs B1 For Ableton Live 7\n\nSST GENS B1 is a free Ableton Live pack available for download from Togeo Studios. This is the big one, with a whopping 500 new SST generators designed for Ableton Lives simpler instrument. \n\n\n\nSST GENs 8 Macro Controls\nThese tweakable sound scape and texture generators consist of four bandpassed simpler devices in a grouped instrument rack. Each of the four sound sources filter frequencies can be adjusted across the entire frequency range using four macro control knobs creating a unique new sound. There are also macros to control the devices overall pitch, volume, resonance and spread. \n\nThe 128 quality source samples which have been combined into the 500 instrument racks are each four measures long and provide a wide variety of uniquely layered sounds.\n\nThe instruments can be played across the entire keyboard range providing everything from deep slowly evolving soundscapes to rapid biting rythmic sequences.\n\nThe sounds produced by the SST GENs are especially usefull for artists and producers of electronic, ambient, glitchy techno and experimental idm genres of music. Tweak the knobs and experiment to your hearts desire, the only limitation is your imagination. \n\nThe entire SST GENs B1 live pack is a 107mb download which can be unpacked (204mb) and installed into your Ablton Live library. Get the Togeo Studios SST GENs B1 - Free Ableton Live Pack\n\nMore at TogeoStudios.com","torrent":{"xt":"urn:btih:d3faff3858c4a1635c7d2d04148d14b8abe5667a","amp;dn":"SST+GENs+B%21+-+Free+Ableton+Live+Pack+2+-+Togeo+Studios","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3faff3858c4a1635c7d2d04148d14b8abe5667a","infoHashBuffer":{"type":"Buffer","data":[211,250,255,56,88,196,161,99,92,125,45,4,20,141,20,184,171,229,102,122]},"announce":[],"urlList":[]}}