{"title":"Thomas Merton - Gandhi on Non-Violence (pdf)","uid":8183948,"size":965586,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d4b0c9af091193d068c917e9e916c2e5ba58130c&amp;dn=Thomas+Merton+-+Gandhi+on+Non-Violence+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"pharmakate","files":-1,"time":1361689199,"description":"Thomas Merton (preface by Mark Kurlansky) - Gandhi on Non-Violence (New Directions, 2007). 110 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\nThomas Merton's brief collection of aphoristic excerpts from Gandhi on the topic of nonviolence, preceded by Merton's introduction. For years this book was my personal vade mecum on the subject of power and politics.\n\nDescription:\n\nAn essential compendium for understanding Gandhi's profound legacy.\n\n&quot;One has to speak out and stand up for one's convictions. Inaction at a time of conflagration is inexcusable.&quot; - Mahatma Gandhi\n\nThe basic principles of Gandhi's philosophy of non-violence (Ahimsa) and non-violent action (Satyagraha) were chosen by Thomas Merton for this volume in 1965. In his challenging Introduction, &quot;Gandhi and the One-Eyed Giant,&quot; Merton emphasizes the importance of action rather than mere pacifism as a central component of non-violence, and illustrates how the foundations of Gandhi's universal truths are linked to traditional Hindu Dharma, the Greek philosophers, and the teachings of Christ and Thomas Aquinas.\n\nEducated as a Westerner in South Africa, it was Gandhi's desire to set aside the caste system as well as his political struggles in India which led him to discover the dynamic power of non-cooperation. But, non-violence for Gandhi &quot;was not simply a political tactic,&quot; as Merton observes: &quot;the spirit of non-violence sprang from an inner realization of spiritual unity in himself.&quot; Gandhi's politics of spiritual integrity have influenced generations of people around the world, as well as civil rights leaders from Martin Luther King, Jr. and Steve Biko to Vaclav Havel and Aung San Suu Kyi.\n\nMark Kurlansky has written an insightful preface for this edition that touches upon the history of non-violence and reflects the core of Gandhi's spiritual and ethical doctrine in the context of current global conflicts.\n\nAbout the Author\n\nThomas Merton (1915-1968) entered the Cistercian Abbey of Gethsemani in Kentucky, following his conversion to Catholicism and was ordained Father M. Louis in 1949. During the 1960s, he was increasingly drawn into a dialogue between Eastern and Western religions and domestic issues of war and racism. In 1968, the Dalai Lama praised Merton for having a more profound knowledge of Buddhism than any other Christian he had known. Thomas Merton is the author of the beloved classic The Seven Storey Mountain.\n","torrent":{"xt":"urn:btih:d4b0c9af091193d068c917e9e916c2e5ba58130c","amp;dn":"Thomas+Merton+-+Gandhi+on+Non-Violence+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4b0c9af091193d068c917e9e916c2e5ba58130c","infoHashBuffer":{"type":"Buffer","data":[212,176,201,175,9,17,147,208,104,201,23,233,233,22,194,229,186,88,19,12]},"announce":[],"urlList":[]}}