{"title":"Ms. Tree","uid":4342422,"size":1063073257,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:d6a7ef8a65a9d9f532b0ea231256acff20fe0057&amp;dn=Ms.+Tree&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DieSmurfDie","files":53,"time":1218678503,"description":"This is from a request made at the forum at ComicSearch.co.uk   The torrent contains the available issues starring the character Ms. Tree.  She is another character with a varied publishing history who deserved better from her publishers.\n\nMuch of Ms. Tree remains unscanned.  These are the books missing from the torrent:\n Eclipse Magazine 5,6\n Ms. Tree's Thrilling Detective 3\n Ms. Tree (Eclipse) 7\n Ms. Tree (Aardvark-Vanheim) 11-14\n Ms. Tree (Renegade Press) 16-21, 23-28, 36-39, 43, 48-50\n\nFrom Wikipedia:\n\nMs. Tree was the most well-known comic book creation of author Max Allan Collins prior to his graphic novel, Road to Perdition. Terry Beatty was the series' artist.\n\nThe title character is Michael Tree, a female private detective who takes over her husband's investigation business when he is murdered. In her first case, she captures the murderer and discovers his link to the Muerta organized crime family.\n\nMs. Tree's dead husband was named Michael Tree, the joke being that after the marriage they had the same name. Series creator/writer Max Allan Collins makes no secret of the fact that Ms. Tree was inspired by Velda, Mike Hammer's secretary, a stacked, gun carrying, six-foot tall brunette and Mike's lover, who was almost as tough as he was. The basic premise of Ms. Tree was, &quot;What if Velda and Mike Hammer eventually got married, and on their honeymoon he was murdered?&quot;\n\nThroughout the series, in addition to isolated cases, Ms. Tree's vendetta against the Muerta family is a major plot thread. Her methods often include deadly violence which she uses with little hesitation. In contrast to genre conventions, she faces serious consequences throughout the series for these violent actions including arrest, imprisonment, commitment to a mental hospital, and involuntary medication.\n\nIn another genre divergence, the male Michael Tree's son, Mike (of course), inadvertently falls in love with the daughter of the Muerta matron. The female Michael disapproves of this arrangement but respects her stepson's decision. To her shock, when their relationship grows enough to make marriage probable, the Muerta family decides Mike's stepmother is now family and initiates a reconciliation with her while going legit. &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Ms._Tree&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Ms._Tree&lt;/a&gt;\n\nThanks to Max Allan Collins and Terry Beatty for giving us such an interesting character.  And to all the scanners and uploaders who came before and made this compilation possible.","torrent":{"xt":"urn:btih:d6a7ef8a65a9d9f532b0ea231256acff20fe0057","amp;dn":"Ms.+Tree","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6a7ef8a65a9d9f532b0ea231256acff20fe0057","infoHashBuffer":{"type":"Buffer","data":[214,167,239,138,101,169,217,245,50,176,234,35,18,86,172,255,32,254,0,87]},"announce":[],"urlList":[]}}