{"title":"The Book of Floating - Exploring the Private Sea","uid":11386512,"size":2968703,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d70e0e8950459354d55eeec13b6b4f8885edc975&amp;dn=The+Book+of+Floating+-+Exploring+the+Private+Sea&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1415271397,"description":"Floatation offers a relatively stress-free environment in which to escape temporarily from stressful external stimuli and free your system from its chronic state of arousal. This makes it a useful and life enhancing tool. But if that were all it did, floatation would be essentially a passive tool, and entering a tank would be little different from sitting quietly in a dark room. While the absence of stress is desirable in itself, it doesn't necessarily bring about the presence of its opposite, relaxation.\n\nFloatation goes far beyond the passive. Scientists have now proven that floating activates a physiological response that is parallel to, and as powerful as, the stressful one of fight or flight. This response mobilizes the body's resources to bring about an active, alert, positive, and beneficial state of relaxation.\n\nThe idea of alleviating psychosomatic disorders by breaking the vicious cycle of stress and stress-reaction brings us to the floatation tank. While the stress relief of the tank works on a number of levels simultaneously, one obvious fact is that entering the floatation tank removes you from most stressors, both the primary stressor and secondary environmental stresses. In the tank there is no noise, no light, no other people, nothing to do, and nothing that needs to be or can be done. Like that time after the fight of the near accident, when you needed someplace just to sit and wind down, the tank is the perfect recovery-from-stress spot. There, with no possible threat from the outside world, your body slows down, the flood of chemicals that has jangled your nerves is eliminated, and your body chemistry returns to normal. And just as when, after some stressful moment, your heightened arousal gives way to a feeling of deep calmness, so in the tank the deepening relaxation of your body and brain is perceived as a delicious sensation of peace, well-being, exhilaration: I have survived and I am alive!\n\nWe all know what stress is. Though we might not be able to explain the physiological process, we're quite clear about our feelings. We talk about sweaty palms, chills down the spine, quivering like a leaf, getting cold feet, being tight-assed, having butterflies in the stomach, or receiving a shot of adrenaline. Many use these phrases with the belief that they're just figures of speech, apt cliches, not realizing that they are describing with poetic exactness very real physiological processes, all if which are part of an unconscious, reflective reaction to stress known as the flight-or-flight response.\n\nÂ© Michael Hutchinson &quot;The Book Of Floating&quot;","torrent":{"xt":"urn:btih:d70e0e8950459354d55eeec13b6b4f8885edc975","amp;dn":"The+Book+of+Floating+-+Exploring+the+Private+Sea","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d70e0e8950459354d55eeec13b6b4f8885edc975","infoHashBuffer":{"type":"Buffer","data":[215,14,14,137,80,69,147,84,213,94,238,193,59,107,79,136,133,237,201,117]},"announce":[],"urlList":[]}}