{"title":"Tarot: Witch of the Black Rose 71-76 (2011-2012) (Re-em-DCP)","uid":7872658,"size":182201443,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:d778bbdfeb549a8cdec7ee7efcf74c9f9c25d4d7&amp;dn=Tarot%3A+Witch+of+the+Black+Rose+71-76+%282011-2012%29+%28Re-em-DCP%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"blackcanary","files":-1,"time":1354253506,"description":"English | CBR | 6 Issues\n\nTarot: Witch of the Black Rose #71-76 (2011-2012)\nPublisher:  BroadSword Comics\nPublication Date:  November 30, 2011 - September 26, 2012\n\nWriter/Artist:  Jim Balent\n\nTarot: Witch of the Black Rose #71\nBeaten by the Warrior Mermaid, Tarot hangs half-submerged, chained to the walls of a hidden cave. Crabs, eels, and sharks close in to rip at her flesh and to bring a bloody end to the Witch of the Black Rose...\n\nTarot: Witch of the Black Rose #72\nThe TSA just deployed their new security system, a robot called P.A.T. (Passenger Assistance Technology ). Unfortunately the robots are performing too well and soon go on a rampage, judging everyone's body fluids to be over the 3.4 ounce liquid limit. The 3 Little Kittens spring into action and try to shut down the mechanical menaces before they cram all of humanity into a one quart size zip lock bag.\n\nTarot: Witch of the Black Rose #73\n'Kittens vs. Robots,' Part 2! It's bad enough that an army of TSA security robots have gone on a rampage in downtown Manhattan. But add the mysterious flying ring disks armed to the teeth to the mix and you have a deadly combination that even the 3 Little Kittens can't fight their way out of! Plus, an intimate date between Jon and Tarot takes an unexpected turn!\n\nTarot: Witch of the Black Rose #74\n'Kittens vs Robots,' Part 3: Robamatron. Flying Drones are shooting up Manhattan and security robots are disarming people by ripping off their arms! And now the President of the United States has a Flying Armored Battle suit! The Kittens have their paws full! Meanwhile, Tarot and Jon's date ends in a way neither of them expected!\n\nTarot: Witch of the Black Rose #75\n'The Dark Spiral,' Part 1: 'The Abandoned Witch Village.' An ill wind blows from the rooftops of an abandoned witch village. Evil fairies and a dark queen with wicked intent haunt Tarot as she begins a downward spiral. Issue #75 is the beginning of an epic journey that will change Tarot's life - as well as everyone she loves.\n\nTarot: Witch of the Black Rose #76\n'The Dark Spiral,' Part 2: 'Witchfork'. Tarot has fought many enemies in her time - dragons, goblins, dark elves - but none have been so formidable as the Dark Fairy from the Unseelie Court she faces now! Tarot's dark spiral continues as her battle for her freedom rages on. The trap has been sprung. Escape is hopeless.\n\nThanks goes to Re-em for this release.","torrent":{"xt":"urn:btih:d778bbdfeb549a8cdec7ee7efcf74c9f9c25d4d7","amp;dn":"Tarot%3A+Witch+of+the+Black+Rose+71-76+%282011-2012%29+%28Re-em-DCP%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d778bbdfeb549a8cdec7ee7efcf74c9f9c25d4d7","infoHashBuffer":{"type":"Buffer","data":[215,120,187,223,235,84,154,140,222,199,238,126,252,247,76,159,156,37,212,215]},"announce":[],"urlList":[]}}