{"title":"Coast to Coast AM January 28 2013","uid":8080273,"size":56459178,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:d849bab12552aa655bd584d01af1368c805649d6&amp;dn=Coast+to+Coast+AM+January+28+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1359481486,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t01-28-13\nHost: \tGeorge Noory\nGuests: \tDave Schrader, James Paris\n\nAuthor, lecturer, and paranormal researcher Dave Schrader discussed his lifelong immersion into the paranormal, including updates on &quot;thought form&quot; creatures such as Slender Man, Bloody Bones Man, and the Faceless. In pondering to what extent paranormal sightings are based on expectation, intention, and mental processes, he looked back at the famed Philip Experiment in Canada in 1970s, in which a ghost was deliberately conjured or created by a group. What they communicated with could be an invented form, or possibly a spirit that walked in and took the attention people were willing to give it, and this could pose certain dangers, he commented. The recent film, The Apparition (which Joshua P. Warren served as a consultant on), is based on the notion of creating a spirit using technology.\n\nSchrader described a strange collection of creatures that may fit the idea of thought forms that become hauntings. He's received an increased number of reports of the Bloody Bones Man or &quot;Raw Head&quot; who appears as a boogeyman-like creature whose skin is removed, and shows up in people's bedrooms at night. &quot;Is is because we put this out there, started to share it, and now it's in the minds of people, especially at bedtime?,&quot; he asked. Emerging from a website to create a paranormal image, a character called Slender Man has been described as a very tall thin man who wears a suit, has no eyes, no mouth, and no clearly defined facial features. Though he had fictitious roots and was featured in some games, now people are actually reporting seeing this being, and he's taken on a life of his own, Schrader detailed.\n\nSimilarly, he continued, people have described a faceless being, with a blank flat countenance that has sometimes been seen before a tragedy or accident strikes, in the way that Mothman sightings were said to be harbingers. Schrader also touched on Old Hag Syndrome, Ouija boards (including the ZOZO phenomenon in which numerous people are said to be in contact with the same entity), and some of the places he's investigated. These locales include the Stanley Hotel (related video), Rolling Hills Sanatorium in East Bethany, NY, and the Waverly Hills Sanatorium, where he encountered a Shadow Person, who walked right through him.\nPrayer &amp; Finances\n\nFirst hour guest, author James Paris discussed how to use prayer to improve finances. A millionaire by the age of 30, he was bankrupted by his fortieth birthday, after his accountant/brother embezzled his fortune. This turn of fate led him to discover a different approach to prayer-- instead of asking God for what he wanted to happen (which proved ineffective), he started asking God what he wanted him to do. &quot;When I realized prayer was a two-way conversation,&quot; he recounted, &quot;I would find myself on the beach with a yellow pad and a pen...and I would come back from these two and three hour prayer sessions with pages and pages of ideas, information, and direction that I would never come up with on my own.&quot;\n\nNews segment guests: Christian Wilde, Rhettman Mullis\nWebsite(s):\n\n    darknessradio.com\n    christianmoney.com\n\nBook(s):\n\n    The Other Side: A Teen's Guide to Ghost Hunting and the Paranormal\n    How To Pray For A Financial Miracle\n\n","torrent":{"xt":"urn:btih:d849bab12552aa655bd584d01af1368c805649d6","amp;dn":"Coast+to+Coast+AM+January+28+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d849bab12552aa655bd584d01af1368c805649d6","infoHashBuffer":{"type":"Buffer","data":[216,73,186,177,37,82,170,101,91,213,132,208,26,241,54,140,128,86,73,214]},"announce":[],"urlList":[]}}