{"title":"Suddenly, Last Summer (TV) [1993] Maggie Smith","uid":5824911,"size":734202895,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d8afc7ceb08159037708258f1b242793d904f16c&amp;dn=Suddenly%2C+Last+Summer+%28TV%29+%5B1993%5D+Maggie+Smith&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ThorntonWilde","files":-1,"time":1284220529,"description":" &lt;a href=&quot;http://bayimg.com/EaoinAACO&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/EaoinAACO&lt;/a&gt;\n\nSuddenly, Last Summer (1993) (TV) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0108247/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0108247/&lt;/a&gt;\n\nSuddenly, Last Summer is a one-act play by Tennessee Williams. It opened off Broadway on January 7, 1958, as part of a double bill with another of Williams' one-acts, Something Unspoken. The presentation of the two plays was given the overall title Garden District, but Suddenly, Last Summer is now more often performed alone. The play, basically consisting of two long monologues, is considered one of Williams' starkest and most poetic works.\n\n Maggie Smith ...  Violet Venable \n Rob Lowe ...  Doctor Cukrowicz \n Gillian Raine ...  Miss Foxhill \n Richard E. Grant ...  George Holly \n Moira Redmond ...  Mrs. Holly \n C.P. Wilson ...  Butler \n Natasha Richardson ...  Catharine Holly \n Rosaleen Linehan ...  Sister Felicity \n\nThe play was adapted for BBC television in 1993 under the direction of Royal National Theatre head Richard Eyre and starring Maggie Smith, Rob Lowe, Richard E. Grant, and Natasha Richardson. It later aired in America on PBS and was very faithful to the original stage version. Smith was nominated for an Emmy Award for Outstanding Actress in a Miniseries or TV Movie. Lowe revealed that his personal driver during the production of the telefilm was also the personal driver for Montgomery Clift on the 1959 version.\n\nThe play features Catharine Holly, a young woman who seems to go insane after her cousin Sebastian dies on a trip to Europe under mysterious circumstances. Sebastian's mother, Violet Venable, trying to cloud the truth about her son's homosexuality and death, threatens to lobotomize Catharine for her incoherent utterances relating to Sebastian's demise. Finally, under the influence of a truth serum, Catharine tells the gruesome story of Sebastian's death by cannibalism at the hand of local boys whose sexual favors he sought, using Catharine as a device to attract the young men (as he had earlier used his mother).\n\nAs with many Tennessee Williams plays, the play incorporates elements from the playwright's own life, along with elements from the life of his idol, poet Hart Crane. Williams' sister Rose was compelled to undergo a lobotomy at the instigation of their domineering mother. Williams had begun psychoanalysis shortly before writing the play. The language of the play contains many images and symbols of predation.\n\nSebastian's dismemberment and consumption by the objects of his sexual desire recalls the Dionysian acts of sparagmos and omophagia, as in Euripides' play The Bacchae.\n\n","torrent":{"xt":"urn:btih:d8afc7ceb08159037708258f1b242793d904f16c","amp;dn":"Suddenly%2C+Last+Summer+%28TV%29+%5B1993%5D+Maggie+Smith","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8afc7ceb08159037708258f1b242793d904f16c","infoHashBuffer":{"type":"Buffer","data":[216,175,199,206,176,129,89,3,119,8,37,143,27,36,39,147,217,4,241,108]},"announce":[],"urlList":[]}}