{"title":"The Staple Singers~Freedom Highway (Columbia) [FLAC] {MKOP}","uid":7557265,"size":272960589,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d8da249642a6ec91bd1096d170510cacba1f0a4f&amp;dn=The+Staple+Singers%7EFreedom+Highway+%28Columbia%29+%5BFLAC%5D+%7BMKOP%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mudmashers","files":18,"time":1345651787,"description":"The Staple Singers~Freedom Highway (Columbia) [FLAC] {MKOP}\n\nOriginally released on Epic in 1965 as a live in-church session, Legacy's 1991 reissue of Freedom Highway includes two of the original LP tracks supplemented by some truly spirited late-'60s Epic recordings. Despite the glaring omissions, Freedom Highway never feels like a hastily thrown-together compilation. Instead, it follows an arc that deftly mirrors the religious, political, and social fervor of the '60s as filtered through the warm vibrato of Pops Staples' amplifier and the golden throats of his brood. Gospel standards like &quot;Will the Circle Be Unbroken&quot; and &quot;Wade in the Water&quot; benefit from the full band arrangements, giving them a swift kick of rock &amp; roll that would eventually morph into the soul-funk sound of their popular '70s period. Pops, inspired by his meeting with Martin Luther King, Jr., contributes the wickedly infectious title cut -- one of the two live tracks from the original -- and the incendiary &quot;Why Am I Treated So Bad,&quot; a bluesy lament inspired by the hardships of the &quot;Little Rock 9.&quot; As always, the vocals and harmonies are nothing short of astounding, most notably on the Mavis Staples-led &quot;Move Along Train&quot; -- never has gospel sounded so sexy. Each song bristles with emotion and resonates deeper with every repeated listen, resulting in an experience that transcends scripture while remaining true to its alternately redemptive and fiery foundations. Freedom Highway captures a family approaching the cusp of catharsis, and its charms lie in the world-weary delivery of its message. Their devotion has been tested and their hands have been bloodied, but their faith has grown into an endless garden because of it, and by the time they reach the spookiest version of &quot;This Train&quot; ever put to tape, listeners will no doubt feel as empowered as the stoic passengers themselves.~James Christopher Monger (Allmusic)\n\n01. Will The Circle Be Unbroken\n02. Move Along Train\n03. Are You Sure\n04. Wade In The Water\n05. If I Could Hear My Mother Again\n06. Glory, Glory, Hallelujah!\n07. The Lord's Prayer\n08. Jacob's Ladder\n09. Why (Am I Treated So Bad)\n10. Praying Time\n11. For What It's Worth\n12. Hammer and Nails\n13. Freedom Highway\n14. What You Gonna Do\n15. Samson and Delilah\n16. Nobody's Fault But Mine\n17. Be Careful Of Stones That You Throw\n18. This Train\n\nMusic Keep On Playing*Thank You Seeders","torrent":{"xt":"urn:btih:d8da249642a6ec91bd1096d170510cacba1f0a4f","amp;dn":"The+Staple+Singers%7EFreedom+Highway+%28Columbia%29+%5BFLAC%5D+%7BMKOP%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8da249642a6ec91bd1096d170510cacba1f0a4f","infoHashBuffer":{"type":"Buffer","data":[216,218,36,150,66,166,236,145,189,16,150,209,112,81,12,172,186,31,10,79]},"announce":[],"urlList":[]}}