{"title":"FS2004_cloud9_All_Products CRACk reseed","uid":3912853,"size":422716,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d9c4fbad1c59bebfaafbce97c4c46862e004c251&amp;dn=FS2004_cloud9_All_Products+CRACk+reseed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fulcrum_21","files":1,"time":1196269652,"description":"THIS IS A RESEED OF MY FORMER TORRENT. HOPE IT WORKS NOW\n\nThe wait is over. This crack works with newest versions of all cloud9 FS9-products (as of november 2007). So it works with the F4 PHANTOM and BERGEN. It does not work with the FSX-scenerys of cloud9 and the Zurich-Scenery of FSDreamteam, which uses the same type of addon-manager. But there is hope, that there will be a solution very soon.\n\nThe crack works best with XP, but it works with Vista too.\n\nSome people say this crack was developed by some Russians, others presume it was leaked through some guys in the vicinity of Cloud9. As we all know, this company seems to go out of business or maybe they left opertional business already (remeber LAGO?). Their former affiliates publish through Aerosoft or FSDreamteam and there is no more information of Sangalli what is going on.\n\nBe careful: THIS IS THE REAL CRACK.\n\nDuring the last years the cloud9-guys published virus-infected pseudo-cracks everytime after a new crack was seeded. This is the first an real crack. You can check it with your virus-scanners. IT WORKS. \t\t","torrent":{"xt":"urn:btih:d9c4fbad1c59bebfaafbce97c4c46862e004c251","amp;dn":"FS2004_cloud9_All_Products+CRACk+reseed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9c4fbad1c59bebfaafbce97c4c46862e004c251","infoHashBuffer":{"type":"Buffer","data":[217,196,251,173,28,89,190,191,170,251,206,151,196,196,104,98,224,4,194,81]},"announce":[],"urlList":[]}}