{"title":"Rich Dad Poor Dad-Robert T. Kiyosaki Original eBook [GK]","uid":9939092,"size":11860715,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:db5bca05793c982077abbfa7380ab6f246bce34c&amp;dn=Rich+Dad+Poor+Dad-Robert+T.+Kiyosaki+Original+eBook+%5BGK%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":25,"uploader":"GKSL","files":1,"time":1397201986,"description":"Personal finance author and lecturer Robert Kiyosaki developed his unique economic perspective through exposure to a pair of disparate influences: his own highly educated, but fiscally unstable father, and the multimillionaire eighth-grade dropout father of his closest friend. The lifelong monetary problems experienced by his &quot;poor dad&quot; (whose weekly paychecks, while respectable, were never quite sufficient to meet family needs) pounded home the counterpoint communicated by his &quot;rich dad&quot; (that &quot;the poor and the middle class work for money,&quot; but &quot;the rich have money work for them&quot;). Taking that message to heart, Kiyosaki was able to retire at 47. Rich Dad Poor Dad, written with consultant and CPA Sharon L. Lechter, lays out his the philosophy behind his relationship with money. Although Kiyosaki can take a frustratingly long time to make his points, his book is nonetheless a compelling advocate for the type of &quot;financial literacy&quot; that's never taught in schools. Based on the principle that income-generating assets always provide healthier bottom-line results than even the best of traditional jobs, it explains how the former might be acquired so that the latter eventually can be shed. --Howard Rothman","torrent":{"xt":"urn:btih:db5bca05793c982077abbfa7380ab6f246bce34c","amp;dn":"Rich+Dad+Poor+Dad-Robert+T.+Kiyosaki+Original+eBook+%5BGK%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db5bca05793c982077abbfa7380ab6f246bce34c","infoHashBuffer":{"type":"Buffer","data":[219,91,202,5,121,60,152,32,119,171,191,167,56,10,182,242,70,188,227,76]},"announce":[],"urlList":[]}}