{"title":"Android Music Visualizers Apk's","uid":8699022,"size":14165985,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:dc0176f79e0da93d9d305f150139c7173513f6c4&amp;dn=Android+Music+Visualizers+Apk%27s&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"CollectorMan223","files":3,"time":1374019027,"description":"Android Music Visualizers Apk's\n\nThis torrent includes: Morphyre Music Visualizer, and ProjectM\n\n\n*Morphyre Music Visualizer version 1.64 build 164 Apk*\n\n\tDescription:\n\nOne of the best Music Visualizations for Mac and PC has just gone mobile!\n\nYou get the same amazing graphics and the same features as Morphyre Personal Extra - just with a smaller screen and\na smaller price tag!\n\nVisualize Music from a Microphone, whatever is playing on your Android device, or just have the graphics respond to\na simulated beat. Change the type of graphics displayed, and apply stunning after-effects such as\nStrobe, Radial Blur, or Kaleidoscope.\n\nPlease note:\n\nWhile Morphyre for Android should run on any GLES2-enabled device, you will need an Android device produced in the last\nyear in order to produce fluid, full-resolution graphics.\n\nPermissions:\n\nMorphyre requires permissions for internet and load on startup for the 'Device Mode', where it can display new graphics\nthat you design on our website. These are not used by default.\n\n* Some music players apply filters to the music they play, and so do not allow visualizations to react to the sounds\nthey produce. If you have one of these, you will have to disable filters (if you can), use one of the many other Music\nplayers available for Android, or set up Morphyre to use the Microphone for sound reactivity.\n\nSource Info Link: \n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.morphyre.android&amp;hl=en&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.morphyre.android&amp;hl=en&lt;/a&gt;\n\n\n*ProjectM version 3.31 build 31 Apk*\n\n Description\nprojectM is the most advanced music visualizer available on the Android Market. It has the smoothest graphics,\nthe most presets, and is the most responsive to music. It can be used as a Live Wallpaper or standalone app.\n\nprojectM will visualize any sound playing on your phone. If there is no audio playing, projectM will visualize your\nmicrophone input!\n\nprojectM is essentially a rewrite of MilkDrop with modern technologies. It is compatible with MilkDrop (.milk) presets.\n\nPowerAMP supports enhanced music player controls, such as fast forward/rewind, album art, music browsing inside projectM,\nand track notifications.\n\nFeatures:\n\n- Multi-Touch Interactive Visuals\n- Music Player Control (Google Music &amp; PowerAMP)\n- Preset Browser\n- Preset Search\n- Auto-detects sound from Microphone and Music Players\n- Live Wallpaper Mode\n- Standalone Application Mode\n- Honeycomb/ICS support\n- Configurable graphics quality\n- Low battery usage (very little CPU used)\n- x86 Support\n\nOn first start, projectM will download 275 presets. This is just to get you started. There are thousands of presets\navailable online to try out.\n\nTo increase quality or performance, adjust texture size under settings. Mesh size is also useful if texture size isn't\nenough.\n\nThis is the Official projectM for Android brought to you by the original projectM developers.\n\n***About Music Player Support***\nprojectM supports Google Music and PowerAMP because they have published specs for interacting with them.\nWe have received requests for Pandora, MixZing, Player Pro, MortPlayer, etc., but none have these have published\nan API that I am aware of. If/When they become available, we will implement support for them.\n\nSource Info Link: \n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.psperl.projectM&amp;hl=en&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.psperl.projectM&amp;hl=en&lt;/a&gt;","torrent":{"xt":"urn:btih:dc0176f79e0da93d9d305f150139c7173513f6c4","amp;dn":"Android+Music+Visualizers+Apk%27s","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc0176f79e0da93d9d305f150139c7173513f6c4","infoHashBuffer":{"type":"Buffer","data":[220,1,118,247,158,13,169,61,157,48,95,21,1,57,199,23,53,19,246,196]},"announce":[],"urlList":[]}}