{"title":"OTEP - Ghostflowers (2nafish)","uid":6040977,"size":168837124,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:dc1c4ff574c92b9f3f8a1b467d9a590427d3d0cb&amp;dn=OTEP+-+Ghostflowers+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1292387095,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\nThe Ascension (stylized as the_Ascension) is the title of the third studio album by Otep. The album was recorded at Piety Street Studios in New Orleans, LA and Balance Studios in Mandeville, LA. The original release date was set for March 20, 2007 through Capitol Records, however, the album was delayed indefinitely due to the recent Capitol/Virgin Records merger. As of April 2009 Otep is currently signed to Victory Records.\n\nThe album debuted at number 81 on the Billboard 200 with 10,200 copies sold.\n\nOtep (also written as OTEP or OT3P) is an American heavy metal band formed in 2000 in Los Angeles, California by Otep Shamaya.\n\nOtep is a four-piece metal band that began in Los Angeles, California in early 2000. They were invited to play Ozzfest before they had even signed to a label after Sharon Osbourne witnessed a brief part of their live performance. They have since played Ozzfest several times. They have labeled themselves a fusion band; this is most likely due to the fact that they use a mixture of poetry, spoken word, and nu-metal aspects. Their lyrics are often political or personal in nature.\n\nTo date the band has released four full length albums, and one EP. They have toured to support the release of all their full length releases; they are currently on the Rise, Rebel, Resist tour as of February 2010.\n\nOn April 6, 2009, it was announced that Otep is now signed to Victory Records. On April 7, 2009 Shamaya announced that the new album will also mark the band reuniting with former members Mark &quot;Moke&quot; Bistany on drums and Rob Patterson on guitar. Otep stated a song titled &quot;Rise, Rebel, Resist&quot; from the new album Smash the Control Machine released on August 18, 2009. However, &quot;Smash the Control Machine&quot; would be the first song heard off the new album, receiving air play in June 2009. The album featured Koichi Fukuda on piano, and Emilie Autumn on violin. The band appeared with 2Cents, Five Finger Death Punch &amp; Shadows Fall on the 'Shock &amp; Raw Tour' of North America in the fall of 2009. An article in the spring 2009 issue of Broken Records Magazine states that Otep delves beyond music to focus on important issues.\n\nIn November 2009, it was announced that their single &quot;Smash the Control Machine&quot; would be used for TNA Wrestling's Final Resolution 2009 PPV on December 20.\n\nOn August 8, 2010, Otep's song &quot;Head&quot; was featured prominently in the HBO True Blood series, at the end of the episode Night on the Sun.\n\nOn September 30, 2010 eVil Jay McGuire gracefully bowed out of Otep stating, &quot;Time for a change.&quot; The following was posted on his Facebook page:\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:dc1c4ff574c92b9f3f8a1b467d9a590427d3d0cb","amp;dn":"OTEP+-+Ghostflowers+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc1c4ff574c92b9f3f8a1b467d9a590427d3d0cb","infoHashBuffer":{"type":"Buffer","data":[220,28,79,245,116,201,43,159,63,138,27,70,125,154,89,4,39,211,208,203]},"announce":[],"urlList":[]}}