{"title":"Halo Reach","uid":5897877,"size":7572881444,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:dd15ea3a6369697d535ae1220a0fc04fb4c234e0&amp;dn=Halo+Reach&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Jamz2010","files":2,"time":1287560886,"description":"Another rip of Halo: Reach.   Region Free.\n\nHalo: Reach, developed exclusively for Xbox 360 by acclaimed developer Bungie, is the blockbuster prequel to the best-selling Xbox franchise of all time. It represents the culmination of Bungie's 10 years of experience crafting groundbreaking Halo games that have raised expectations for what can be achieved in a video game.\n\nExperience the fateful moments that forged the Halo legend. This is the story of Noble Team, a squad of heroic Spartan soldiers, and their final stand on planet Reach, humanity's last line of defense between the terrifying Covenant and Earth. This darker story is echoed by grittier visuals amid a backdrop of massive, awe-inspiring environments. Characters, enemies, and environments are rendered in amazing detail by an all-new engine designed to deliver epic-scale encounters against the cunning and ruthless Covenant.\n\nOnce the campaign is over, the battle continues online with an unparalleled multiplayer experience expanding on the award-winning suite of features that helped define the Xbox LIVE experience.","torrent":{"xt":"urn:btih:dd15ea3a6369697d535ae1220a0fc04fb4c234e0","amp;dn":"Halo+Reach","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd15ea3a6369697d535ae1220a0fc04fb4c234e0","infoHashBuffer":{"type":"Buffer","data":[221,21,234,58,99,105,105,125,83,90,225,34,10,15,192,79,180,194,52,224]},"announce":[],"urlList":[]}}