{"title":"The Retreat of Reason (2006) by Anthony Browne","uid":10705806,"size":349904,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dd6ba5408b54655992ecfb20b918e2dfae70eca1&amp;dn=The+Retreat+of+Reason+%282006%29+by+Anthony+Browne&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1407289649,"description":"The Retreat of Reason - Political Correctness and the Corruption of Public Debate in Modern Britain (2006) by Anthony Browne.pdf\n\nFor centuries Britain has been a beacon of liberty of thought, belief and speech, but now the freedom of its intellectual and political life is being subjected to a subtle form of 'censorship', according to a new study of political correctness published by the independent think-tank Civitas.\n\nAnthony Browne argues in The Retreat of Reason that political correctness, which classifies certain groups of people as victims in need of protection from criticism and allows no dissent to be expressed, is poisoning the wells of debate in modern Britain.\n\n'Members of the public, academics, journalists and politicians are afraid of thinking certain thoughts' (p.xii). Political correctness started in academia, but it now dominates schools, hospitals, local authorities, the civil service, the media, companies, the police and the army. Since 1997 Britain has been ruled by political correctness for the first time. 'The Labour government was the first UK government not to stand up to political correctness, but to try and enact its dictates when they are not too electorally unpopular or seriously mugged by reality, and even sometimes when they are' (p.34).\n\nAnthony Browne describes political correctness as a 'heresy of liberalism' (p.2) under which 'a reliance on reason has been replaced with a reliance on the emotional appeal of an argument' (p.6). Adopting certain positions makes the politically correct feel virtuous, even more so when they are preventing the expression of an opinion that conflicts with their own: 'political correctness is the dictatorship of virtue'.\n\nWhether an argument is true or not is a secondary consideration to whether it fits with the PC view of the world:\n\n'In the topsy-turvy politically correct world, truth comes in two forms: the politically correct, and the factually correct. The politically correct truth is publicly proclaimed correct by politicians, celebrities and the BBC even if it is wrong, while the factually correct truth is publicly condemned as wrong even when it is right. Factually correct truths suffer the disadvantage that they don't have to be shown to be wrong, merely stated that they are politically incorrect. To the politically correct, truth is no defence; to the politically incorrect, truth is the ultimate defence. (p.7)'\n\n108 pages\nPublisher: Civitas:Institute for the Study of Civil Society\nLanguage: English\nISBN-10: 1903386500\nISBN-13: 978-1903386507","torrent":{"xt":"urn:btih:dd6ba5408b54655992ecfb20b918e2dfae70eca1","amp;dn":"The+Retreat+of+Reason+%282006%29+by+Anthony+Browne","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd6ba5408b54655992ecfb20b918e2dfae70eca1","infoHashBuffer":{"type":"Buffer","data":[221,107,165,64,139,84,101,89,146,236,251,32,185,24,226,223,174,112,236,161]},"announce":[],"urlList":[]}}