{"title":"Playing It My Way - My Autobiography by Sachin Tendulkar - [pdf+","uid":11632789,"size":19901470,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dd9138d544bc2529e07690aab86eb6fc2b31cc4b&amp;dn=Playing+It+My+Way+-+My+Autobiography+by+Sachin+Tendulkar+-+%5Bpdf%2B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"headbangersam","files":4,"time":1417654305,"description":"Playing It My Way - My Autobiography by Sachin Tendulkar - [pdf+epub+mobi+azw3] - [HeadbangersFC]\n\n\nLanguage: English | Format: PDF, EPUB, MOBI, AZW3\nGenre: Biographies &amp; Memoirs\n\n\nBook Description:\n\nThe autobiography of the highest scoring batsman of all time.\n\nAbout the Author:\n\nBorn in Mumbai, Sachin Tendulkar made his Test debut in Pakistan at the age of 16 in 1989. One of the most gifted and entertaining batsmen to have played international cricket, he scored more runs and made more centuries than any other player in history - in both Tests and ODIs. He made his first Test century at the age of 17, at the age of 36 he became the first player to make a one-day double century and in 2012 he scored his 100th international hundred. With India he won the World Cup in 2011 and reached the top of the world Test rankings in the same year. In 2013, he retired from cricket after playing his 200th and final Test in front of his home crowd in Mumbai. The book is Sachin's own words as told to his Co-writer Boria Majumdar who worked closely with Sachin.\n\nWhen he was a young boy, Sachin Tendulkar's brother introduced him to a game which was to change his life and the lives of millions of Indian. The young boy was a natural cricketer, but practiced for hours on end, standing strong when others would have fallen. His coach egged him on, challenging him to up his game. And he did, becoming more than just a star in the cricketing firmament. He went on to become the youngest Indian player in international cricket, winning the hearts of millions of fans as he blazed his way to century after century, rewriting record after record.\n\nIn 2013, cricket fans around the world watched as the greatest player in the history of the game hung up his boots for good. With this book, his fans can now relive the story of the man they called the 'God of Cricket'. Never before was a cricketer so universally admired, loved and respected by team mates and opponents alike and never before has a sporting icon been raised so high by a grateful nation.\n\nIn this long-awaited autobiography, readers will be able to see glimpses into the life of this living legend; and of the man behind the sport, the husband, the father and an extraordinary human being-- quiet, calm and with a rare humility. This is the story of Sachin Tendulkar, the most celebrated cricketer of all time in his own words.\n\nSachin Tendulkar is an Indian sportsman and former professional cricketer. He has been playing the game since he was eleven years old and debuted in a Test match against Pakistan at the age of 16. He has represented Mumbai domestically and India at an International level for close to 24 years. Among several other notable achievements, he is the only player to have scored one hundred international centuries, to have completed more than 30,000 runs in international cricket and the first batsman to score a double century in an One Day International.\n\nTendulkar has been awarded the Bharat Ratna for his contribution towards Indian sports and is the youngest recipient and the first sportsperson to receive the award so far.\n\nThe book is in Sachin's own words as told to his co-writer Boria Majumdar, senior sports journalist and cricket historian who worked closely with Sachin.\n\n\nPLEASE SEED AND SHARE. THANK YOU","torrent":{"xt":"urn:btih:dd9138d544bc2529e07690aab86eb6fc2b31cc4b","amp;dn":"Playing+It+My+Way+-+My+Autobiography+by+Sachin+Tendulkar+-+%5Bpdf%2B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd9138d544bc2529e07690aab86eb6fc2b31cc4b","infoHashBuffer":{"type":"Buffer","data":[221,145,56,213,68,188,37,41,224,118,144,170,184,110,182,252,43,49,204,75]},"announce":[],"urlList":[]}}