{"title":"Sherlock.1x01.A_Study_In_Pink","uid":7336591,"size":734483408,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:dd924bbd661036e01c34c59e65e0b472bcf0af81&amp;dn=Sherlock.1x01.A_Study_In_Pink&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hgnbuddhika","files":2,"time":1339087724,"description":"Sherlock is a British television series that presents a contemporary update of Sir Arthur Conan Doyle's Sherlock Holmes detective stories. It was created by Steven Moffat and Mark Gatiss, and stars Benedict Cumberbatch as Sherlock Holmes and Martin Freeman as Doctor John Watson. After an unbroadcast pilot in 2009, the first series of three 90-minute episodes was transmitted on BBC One and BBC HD in July and August 2010, with a second series of three episodes first broadcast in January 2012. A third series has been commissioned and will reportedly air in 2013. The series has been sold to over 180 territories.\n\nHartswood Films produced the series for the BBC, and co-produced with WGBH Boston for its Masterpiece anthology series. Filming took place at various locations, including London, Merthyr Tydfil, Swansea, Dartmoor and Cardiff. Other cast members include Rupert Graves as DI Greg Lestrade, Andrew Scott as Jim Moriarty, Mark Gatiss as Mycroft Holmes, Una Stubbs as Mrs. Hudson, as well as Vinette Robinson and Louise Brealey playing recurring roles.\n\nCritical reception was overwhelmingly positive, and the first series won the 2011 BAFTA Television Award for Best Drama Series.[1] All six episodes have been released on DVD and Blu-ray Disc in the UK, alongside tie-in editions of some of Conan Doyle's original books. Soundtrack albums from each series have also been released.\n\n\n\n\n\ninfo:-wikipedia\n\nlog on to:-http://en.wikipedia.org/wiki/Sherlock_(TV_series)","torrent":{"xt":"urn:btih:dd924bbd661036e01c34c59e65e0b472bcf0af81","amp;dn":"Sherlock.1x01.A_Study_In_Pink","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd924bbd661036e01c34c59e65e0b472bcf0af81","infoHashBuffer":{"type":"Buffer","data":[221,146,75,189,102,16,54,224,28,52,197,158,101,224,180,114,188,240,175,129]},"announce":[],"urlList":[]}}