{"title":"Percy Jackson y el ladron del rayo[TS-HQ][Spanish].avi","uid":5379982,"size":1456922870,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:de387ece0d4080f2ef1b4c297f982f662d6779be&amp;dn=Percy+Jackson+y+el+ladron+del+rayo%5BTS-HQ%5D%5BSpanish%5D.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"webchella","files":1,"time":1266698302,"description":"TÃƒÂ­tulo: Percy Jackson y el LadrÃƒÂ³n del Rayo\nTÃƒÂ­tulo original: Percy Jackson &amp; The Olympians: The Lightning Thief\nPaÃƒÂ­s: USA, CanadÃƒÂ¡\nEstreno en USA: 12/02/2010\nEstreno en EspaÃƒÂ±a: 19/02/2010\nProductora: 20th Century Fox\nDirector: Chris Columbus\nGuiÃƒÂ³n: Craig Titley, Chris Columbus (Basado en el libro de Rick Riordan)\nReparto: Logan Lerman, Brandon T. Jackson, Alexandra Daddario, Sean Bean, Pierce Brosnan, Steve Coogan, Rosario Dawson, Catherine Keener, Kevin McKidd, Joe Pantoliano, Uma Thurman, Ray Winstone\nClasificaciÃƒÂ³n: Mayores de 7 aÃƒÂ±os\n\nSinopsis:\nPercy Jackson es un autÃƒÂ©ntico imÃƒÂ¡n para los desastres y tiene problemas en el instituto -pero ÃƒÂ©se es el menor de sus retos-. Estamos en el siglo XXI pero los dioses del Olimpo parecen haberse escapado de las pÃƒÂ¡ginas del libro de texto de Percy sobre mitologÃƒÂ­a griega para colarse en su vida. Percy se ha enterado de que su verdadero padre es PoseidÃƒÂ³n, dios del mar, lo que significa que Percy es un semidiÃƒÂ³s -mitad ser humano, mitad dios-. Al mismo tiempo, Zeus, el rey de todos los dioses, ha acusado a Percy de robarle su rayo... la versiÃƒÂ³n original de las armas de destrucciÃƒÂ³n masiva.\n\nAhora, Percy debe prepararse para la aventura de su vida, y lo que estÃƒÂ¡ en juego no puede ser mÃƒÂ¡s importante.\n\nCon unas nubes de tormenta de malÃƒÂ­simo agÃƒÂ¼ero oscureciendo el planeta y corriendo peligro su propia vida, Percy se encamina a un lugar especial llamado Campo HÃƒÂ­brido, donde se somete a un entrenamiento que le permita utilizar su reciÃƒÂ©n descubiertos poderes y evitar una devastadora guerra entre los dioses. AllÃƒÂ­, Percy conoce a otros colegas de semidivinidad -la guerrera Annabeth, que anda en busca de su madre, la diosa Atenea; y Grover, amigo de la infancia y protector de aquÃƒÂ©lla, que en realidad es un valeroso sÃƒÂ¡tiro que aÃƒÂºn no ha sido puesto a prueba-.\n\nA continuaciÃƒÂ³n, Grover y Annabeth emprenden junto a Percy una increÃƒÂ­ble odisea transcontinental que les lleva a una altura de seiscientos pisos sobre Nueva York (el portal del Monte Olimpo) y al icÃƒÂ³nico anuncio de Hollywood, bajo el cual arden los fuegos del Averno. Al final del viaje se encuentra el destino del mundo -y la vida de la madre de Percy, Sally, a la que Percy debe rescatar de las mismas entraÃƒÂ±as del infierno-.\n\nPercy Jackson: Mitad ser humano, mitad dios. Ã‚Â¡HÃƒÂ©roe completo!\n\nNotas:\nAdaptaciÃƒÂ³n de El LadrÃƒÂ³n del Rayo (2005), primer libro de la saga de aventuras Percy Jackson y Los Dioses Del Olimpo de Rick Riordan. ","torrent":{"xt":"urn:btih:de387ece0d4080f2ef1b4c297f982f662d6779be","amp;dn":"Percy+Jackson+y+el+ladron+del+rayo%5BTS-HQ%5D%5BSpanish%5D.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de387ece0d4080f2ef1b4c297f982f662d6779be","infoHashBuffer":{"type":"Buffer","data":[222,56,126,206,13,64,128,242,239,27,76,41,127,152,47,102,45,103,121,190]},"announce":[],"urlList":[]}}