{"title":"BootCamp, run Windows XP sp2 on your mac, The Official Way !","uid":3466899,"size":87315180,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:de6c7a229d6fdf3fb8b3beaadcf12c8b01cda004&amp;dn=BootCamp%2C+run+Windows+XP+sp2+on+your+mac%2C+The+Official+Way+%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"godzil","files":3,"time":1144256421,"description":"===================================================================================\nMore and more people are buying and loving Macs. To make this choice simply irresistible, Apple will include technology in the next major release of Mac OS X, Leopard, that lets you install and run the Windows XP operating system on your Mac. Called Boot Camp (for now), you can download a public beta today.\n\nAs elegant as it gets\nBoot Camp lets you install Windows XP without moving your Mac data, though you will need to bring your own copy to the table, as Apple Computer does not sell or support Microsoft Windows.(1) Boot Camp will burn a CD of all the required drivers for Windows so you don&amp;#039;t have to scrounge around the Internet looking for them.\n\n \nOptional alt. At startup, hold down the option key (alt) to choose between Mac OS X and Windows.\nRun XP natively\nOnce you?ve completed Boot Camp, simply hold down the option key at startup to choose between Mac OS X and Windows. (That?s the ?alt? key for you longtime Windows users.) After starting up, your Mac runs Windows completely natively. Simply restart to come back to Mac.\n\nWhat you?ll need\nMac OS X Tiger v10.4.6 (check Software Update) \nThe latest Firmware update (check Support Downloads) \n10GB free hard disk space \nAn Intel-based Mac \nA blank recordable CD \nA printer for the instructions (You?ll want to print them before installing Windows, really.) \nA bona fide installation disc for Microsoft Windows XP, Service Pack 2, Home or Professional (No multi-disc, upgrade or Media Center versions.) \nThe Boot Camp course\nBoot Camp Public Beta provides a straightforward means of letting your Mac run Windows. Here?s how it works:\n\n \nSpace maker. Meet the most elegant hard drive utility ever.\nFirst, you need to make sure your Intel-based Mac has the latest version of Mac OS X and the latest firmware update. These provide technologies that make Boot Camp possible. It?s also wise to print out the Installation &amp; Setup Guide. \nThe Boot Camp burns a CD with the drivers Windows needs to recognize Mac-specific hardware. It is very important to do this before starting the Windows installation. \nThe software also helps you set aside hard drive space for the Windows installation, without moving any of your Mac files around. Just drag the intuitive slider to choose the size that?s right for you. Boot Camp also helps you remove the Windows partition, should you so desire. \nNext, insert your Windows installation disc, restart and follow the Windows installation process. The only tricky part is selecting the C: drive manually. Be sure to get this right, or you could erase your Mac files accidentally. Remember, Apple Computer does not sell or support Microsoft Windows. \nAfter the installation process is complete and your Mac has booted Windows, you?ll need the Macintosh Drivers CD you burned previously. When you insert the CD, it will automatically install the drivers. Follow the instructions in the Installation &amp; Setup Guide for helpful hints. \nDon?t forget to follow best practices for updating and protecting your Windows system (see ?Word to the wise? to right). \n===================================================================================\n\nMore info at : http://www.apple.com//macosx/bootcamp/\n","torrent":{"xt":"urn:btih:de6c7a229d6fdf3fb8b3beaadcf12c8b01cda004","amp;dn":"BootCamp%2C+run+Windows+XP+sp2+on+your+mac%2C+The+Official+Way+%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de6c7a229d6fdf3fb8b3beaadcf12c8b01cda004","infoHashBuffer":{"type":"Buffer","data":[222,108,122,34,157,111,223,63,184,179,190,170,220,241,44,139,1,205,160,4]},"announce":[],"urlList":[]}}