{"title":"Bell X1 - Flock [2005][EAC/FLAC]","uid":11707283,"size":395363889,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:de7ce1c167352fc33c0ffffd07461966cfa668c2&amp;dn=Bell+X1+-+Flock+%5B2005%5D%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":16,"time":1424181585,"description":"FLAC / Lossless \nLabel/Cat#:Island #CID 8161\nCountry: IRE\nYear: 2005\nGenre: folk,americana\nFormat:WEB\n\n01. Rocky Took a Lover\n02. Flame\n03. Eve, The Apple of My Eye\n04. My First Born for a Song\n05. Bigger than Me\n06. Bad Skin Day\n07. Natalie\n08. Reacharound\n09. Just Like Mr. Ben\n10. He Said, She Said\n11. Trampoline\n12. Lamposts\n\n\n\n\nIn its earlier incarnation as Juniper, the band that would become known as Bell X1 (then featuring singer Damien Rice) was universally accepted as Ireland's brightest musical prospect. Before their 1998 collapse, they were compared favorably with hometown heroes U2 and the Frames, and with the release of their third and most successful album to date, Flock, the same comparisons have begun to be heard again. With Flock, Bell X1 have stepped out of the shadow of their more illustrious former cohort; for the first time, Rice doesn't have a single writing credit, and the music has taken on more of a unique, identifiable sound from the post-Radiohead rock that typified their first two efforts. Flock opens with a bang, as the energetic pairing of &quot;Reacharound&quot; and single &quot;Flame&quot; clamor for attention with angular art rock riffs and smooth funk rhythms, respectively. That frontman Paul Noonan doubles as the band's studio drummer adds an interesting dimension to Bell X1's compositions, as demonstrated on &quot;Bad Skin Day,&quot; where percussion turns the tables and becomes the lead instrument, relegating the soft acoustic guitar sequences to mere accompaniment. Flock's greatest accomplishment, however, is another of its singles. &quot;Rocky Took a Lover,&quot; which forced its way onto radio long before it was officially considered as a single, and it's easy to see why: achingly simple in composition, &quot;Rocky&quot; imagines a conversation between a homeless couple: &quot;[She said], 'You're such an asshole when you're drunk'/He said, 'At least I'm OK in the morning.'&quot; Bell X1 don't fit comfortably into any of the pigeonholes of modern indie rock: more down to earth than Radiohead; more fun-loving than Coldplay; and too sophisticated to be lumped in with Franz Ferdinand. Bell X1 occupy a niche all of their own, and long may it continue","torrent":{"xt":"urn:btih:de7ce1c167352fc33c0ffffd07461966cfa668c2","amp;dn":"Bell+X1+-+Flock+%5B2005%5D%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de7ce1c167352fc33c0ffffd07461966cfa668c2","infoHashBuffer":{"type":"Buffer","data":[222,124,225,193,103,53,47,195,60,15,255,253,7,70,25,102,207,166,104,194]},"announce":[],"urlList":[]}}