{"title":"Pachinko Allahs - Blood Cult Bake Sale (Tony Arnold)","uid":8986515,"size":83651071,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:df2b977b1dcd9eeb16c3d3d3ad83d9b4915b1ee3&amp;dn=Pachinko+Allahs+-+Blood+Cult+Bake+Sale+%28Tony+Arnold%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Noshock","files":-1,"time":1380680091,"description":"This release from 2008 features 74 minutes of alternative rock music.\n\nJoining Tony Arnold on this release is Tess Brunet on vocals and autoharp.\n\nAn assortment of sultry tuneage utilizing conventional instruments (guitar, bass, keyboards, drums and vocals).\n\nDespite the diversity of instruments, it's the guitar that carries the burden of the music's appeal. Arnold coaxes an inventive plethora of sounds from his guitar, from gutsy to delicate to sinuous to snarling.\n\nHosts of electronics contribute ouches that serve to cement everything into luscious tapestries of alluring tuneage.\n\nThe percussion is agile but often understated, providing rhythms that are submerged in the flow.\n\nHorns appear in this music, (albeit probably synthesized) lending a certain regal touch.\n\nA lot of these tunes feature lyrical vocals, but there are still a number of tracks which explore a purely instrumental venue.\n\nThe compositions on this release provide an excellent sampling of material from both styles, vocal and instrumental. Once filtered through Arnold's talents, the result is rock music with a vivid progressive inclination.\n","torrent":{"xt":"urn:btih:df2b977b1dcd9eeb16c3d3d3ad83d9b4915b1ee3","amp;dn":"Pachinko+Allahs+-+Blood+Cult+Bake+Sale+%28Tony+Arnold%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df2b977b1dcd9eeb16c3d3d3ad83d9b4915b1ee3","infoHashBuffer":{"type":"Buffer","data":[223,43,151,123,29,205,158,235,22,195,211,211,173,131,217,180,145,91,30,227]},"announce":[],"urlList":[]}}