{"title":"Charles Dickens - A Life  (BBC 2012)","uid":7137169,"size":66124322,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:df595d64e97234f48e25d9d83261730e0b812d2d&amp;dn=Charles+Dickens+-+A+Life++%28BBC+2012%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Lucybabe","files":7,"time":1332886741,"description":"Taken from the Book of the Week information\n\nClaire Tomalin's acclaimed new biography of Britain's great novelist paints a portrait of an extraordinarily complex man. Today's theme is Dickens' troubled childhood.\n\nAs part of Dickens on the BBC Radio 4 broadcasts extracts from Claire Tomalin's acclaimed new biography of the novelist who called himself the &quot;inimitable&quot;. He was the writer &quot;so charged with imaginative energy that he rendered nineteenth century England crackling, full of truth and life, with his laughter, horror and indignation - and sentimentality.&quot; The Artful Dodger, Mr Pickwick, Pip and David Copperfield are just a handful of the characters he created and who continue to endure. He was also a hard-working journalist, a philanthropist, a supporter of liberal social causes, and father of ten, and yet his genius also had a dark side which emerged with the break down of his marriage.\n\nClaire Tomalin was literary editor of the The New Statesman and then the Sunday Times before becoming a full time writer. Her biographies are award winning. The Life and Death of Mary Wollstonecraft, won the Whitbread First Book Award, and Samuel Pepys: The Unequalled Self was Whitbread Book of the Year in 2002.\n\nRead by Penelope Wilton Abridged by Richard Hamilton Produced by Elizabeth Allard.\n\nBroadcast Dec 2011\n\nEpisode 1\nA troubled childhood\n\nEpisode 2\nEarly successes\n\nEpisode 3\nThe novelist is well received in America\n\nEpisode 4\nA theatrical performance changes the course of his life\n\nEpisode 5\nExploring the themes of adulation and farewells\n\nDownloaded using Get iPlayer Automator\nRe-encoded using Audacity\nBit rate 128 kbps\nSample rate 48000 kHz\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:df595d64e97234f48e25d9d83261730e0b812d2d","amp;dn":"Charles+Dickens+-+A+Life++%28BBC+2012%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df595d64e97234f48e25d9d83261730e0b812d2d","infoHashBuffer":{"type":"Buffer","data":[223,89,93,100,233,114,52,244,142,37,217,216,50,97,115,14,11,129,45,45]},"announce":[],"urlList":[]}}