{"title":"Authentic Rare Bluegrass-Independent Label Sides 1951-54 (4CD-JS","uid":7309456,"size":519511566,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:dfd035c34e35cd0c8df341aeff682e64ace645f6&amp;dn=Authentic+Rare+Bluegrass-Independent+Label+Sides+1951-54+%284CD-JS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mudmashers","files":105,"time":1338302807,"description":"Authentic Rare Bluegrass: Independent Label Sides 1951-1954 [JSP] (4CD256kb)\n\n\nThe casual record buyer in the 1950s might have been aware of bluegrass but probably only through its better-known artists. The first bluegrass performer (arguably its inventor) was Bill Monroe whose radio shows, records and Opry appearances ensured him national fame. Also well-known were the Stanley Brothers and Flatt &amp; Scruggs. The latter were probably best known later for contributing the \ntheme tune to The Beverly Hillbillies, and for the inclusion of their music in several film scores.\n\nThe big names recorded for Columbia, Decca and Mercury, to name three, but there were many small labels serving local markets. This 100-track collection includes artists who recorded for those small companies - Mutual, Blue Ridge Rich-R-Tone among many others. These records are sometimes dismissed as being second division. Virtually every track here refutes that view.\n\nDisc A: Blue Ridge Recordings: Based in North Wilkesboro, North Carolina the Blue Ridge company, founded in 1950, sold its first masters to the Rich-R-Tone label. In 1953 they decided to release their own product. They soon had several sizeable hits. Disc B: Kentucky Label Recordings: The Kentucky label was Cincinnati based, probably starting sometime in 1952. There was also a companion label, Gateway which issued original material. Kentucky was for 'cover' versions of established hits. Disc C: Folk Star, Mutual, Twin City. Disc D: Colonial, Mutual, Excellent, Blue Ridge labels. (Amazon)","torrent":{"xt":"urn:btih:dfd035c34e35cd0c8df341aeff682e64ace645f6","amp;dn":"Authentic+Rare+Bluegrass-Independent+Label+Sides+1951-54+%284CD-JS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfd035c34e35cd0c8df341aeff682e64ace645f6","infoHashBuffer":{"type":"Buffer","data":[223,208,53,195,78,53,205,12,141,243,65,174,255,104,46,100,172,230,69,246]},"announce":[],"urlList":[]}}