{"title":"War Elephants","uid":11734677,"size":27667707,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dfd15694190c25338b5c254c3a8cbe5e1883f8de&amp;dn=War+Elephants&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1425514220,"description":"Elephants have been deployed as weapons for centuries, particularly in South and South-East Asia, where war elephants constituted the bulk of most armies in the region from antiquity right up to the 19th century. This book offers an insight into the incredible history of these &quot;living tanks,&quot; focusing on the design of the equipment and armament that made them so terrifying, particularly the development and structure of the fighting tower.\n\nThe author, Konstantin S. Nossov goes on to trace the battle history of war elephants, from their deployment against Alexander the Great's army at the battle of Gaugamela, through to their use in the 19th century by the myriad armies of South-East Asia, all the time analyzing the battle formation and tactics of war elephants in action and how these tactics changed over time. He then goes on to examine the most famous action that war elephants took part in, Hannibal's dramatic march over the Alps and his subsequent invasion of Italy. Supported by rare illustrations and full-color original artwork, this book is a vivid account of the development and operation of one of history's most unusual &quot;machines of warfare.&quot;","torrent":{"xt":"urn:btih:dfd15694190c25338b5c254c3a8cbe5e1883f8de","amp;dn":"War+Elephants","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfd15694190c25338b5c254c3a8cbe5e1883f8de","infoHashBuffer":{"type":"Buffer","data":[223,209,86,148,25,12,37,51,139,92,37,76,58,140,190,94,24,131,248,222]},"announce":[],"urlList":[]}}