{"title":"El incidente [dvdrip][spanish]","uid":6833040,"size":733882368,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e011318e89e4f2101ff3c74c1aa3e18dba5e1327&amp;dn=El+incidente+%5Bdvdrip%5D%5Bspanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Black1000","files":-1,"time":1321931128,"description":"El Incidente\n\nAÃƒÂ±o: 2008\n\nDuraciÃƒÂ³n: 90 min.\n\nReparto: Mark Wahlberg, Zooey Deschanel, John Leguizamo, Ashlyn Sanchez, Betty Buckley, Spencer Breslin, Robert Bailey Jr., Jeremy Strong, M. Night Shyamalan\n\nGÃƒÂ©nero:Drama, thriller\n\nSinopsis\n\nTodo comienza sin previo aviso. Parece surgir de la nada. En cuestiÃƒÂ³n de minutos, se producen casos de extraÃƒÂ±as y escalofriantes muertes en las principales ciudades de NorteamÃƒÂ©rica que desafÃƒÂ­an cualquier explicaciÃƒÂ³n. Ã‚Â¿QuÃƒÂ© estÃƒÂ¡ causando este repentino y total colapso del comportamiento humano?, Ã‚Â¿Es algÃƒÂºn nuevo tipo de ataque terrorista, un experimento fallido, una diabÃƒÂ³lica arma tÃƒÂ³xica, un virus fuera de control?, Ã‚Â¿Se transmite por el aire, a travÃƒÂ©s del agua... cÃƒÂ³mo? Para el profesor de ciencias en un instituto de Filadelfia Elliot Moore (Mark Wahlberg), lo mÃƒÂ¡s importante de todo es encontrar el modo de escapar de este misterioso y letal fenÃƒÂ³meno. Aunque ÃƒÂ©l y su mujer Alma (Zooey Deschanel) estÃƒÂ¡n atravesando una crisis en su matrimonio, se ponen en camino, primero en tren, luego en coche, con Julian (John Leguizamo), amigo de Elliot y profesor de matemÃƒÂ¡ticas, y Jess (Ashlyn Sanchez), la hija de ocho aÃƒÂ±os de edad de ÃƒÂ©ste, hacia Pennsylvania, donde esperan estar a salvo de los horribles y cada vez mÃƒÂ¡s frecuentes ataques. Aunque muy pronto queda claro que nadie estÃƒÂ¡ seguro en ninguna parte. Este aterrador e invisible asesino no puede ser evitado. Es ÃƒÂºnicamente cuando Elliot empieza a entender la verdadera naturaleza de lo que estÃƒÂ¡ acechando ahÃƒÂ­ fuera (y lo que ha desatado esa fuerza que amenaza el futuro de la humanidad), cuando descubre un atisbo de esperanza creyendo que su familia quizÃƒÂ¡s pueda librarse de lo que estÃƒÂ¡ ocurriendo.","torrent":{"xt":"urn:btih:e011318e89e4f2101ff3c74c1aa3e18dba5e1327","amp;dn":"El+incidente+%5Bdvdrip%5D%5Bspanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e011318e89e4f2101ff3c74c1aa3e18dba5e1327","infoHashBuffer":{"type":"Buffer","data":[224,17,49,142,137,228,242,16,31,243,199,76,26,163,225,141,186,94,19,39]},"announce":[],"urlList":[]}}