{"title":"Southern Culture on the Skids - Liquored Up and Lacquered Down (","uid":4557201,"size":315802622,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e05b943038fbaf6729f99d06c48192bc93b20001&amp;dn=Southern+Culture+on+the+Skids+-+Liquored+Up+and+Lacquered+Down+%28&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"storoa","files":16,"time":1228528841,"description":"Review    by Liana Jonas\n\nThose who like their music on the humorous side will more than enjoy the \nraucous seventh release from Southern Culture on the Skids. To label this \nNorth Carolina-based quartet under the category of Southern rock would be \nlimiting. On Liquored Up and Lacquered Down, Southern Culture on the Skids \nmelds different styles into its core Southern rock sound and breaks many \ntraditional rules of the genre. One of the talents of Southern Culture on the \nSkids lies in its ability to musically venture way out there -- industrial-like \nprocessed vocals, high-reverb surf guitar, Spanish-style horn parts, and \nother un-Southern rock-like treatments -- and bring the songs back home. It&amp;#039;s \nthe kind of cohesiveness found among groups who&amp;#039;ve developed a synergy \nfrom years of playing together. Liquored Up and Lacquered Down is an \nexample of true ensemble playing, where the parts all effortlessly work \ntogether, no matter how far out the musicians take them. &quot;Pass the Hatchet&quot; \ncombines &amp;#039;60s-style shag music, psychedelic rhythm lines, and a shuffling \nsnare drum inherent to rockabilly. This is a party song that can easily fit in on \na movie soundtrack, ÃŽÂ± la Austin Powers. The collection does take a turn to \nthe minimalist side in &quot;Over It,&quot; which features mostly bone-dry parts, with \nperhaps a bit of reverb on the vocals and guitars. It&amp;#039;s a real tribute to &amp;#039;50s \nrock &amp; roll. On the set&amp;#039;s choicest number, &quot;I Learned to Dance in Mississippi,&quot; \nindustrial-style distorted guitars and vocals meet rollicking country music; \nanother example of the band&amp;#039;s adventurous and eclectic nature. It&amp;#039;s no \ncoincidence that a group named Southern Culture on the Skids writes songs \nabout drinking, drinking, and more drinking, in a variety of milieus. But it all \ncomes off as harmless banter thanks to the honky tonk party music. Co-lead \nsingers Rick Miller (guitar) and Mary Huff (bass) resemble the Big Bopper and \nGrace Slick, respectively, on some songs, and rival the vocal antics of Fred \nSchneider and Kate Pierson of the B-52&amp;#039;s. There are no radio hits here, but \nthat&amp;#039;s only because there really aren&amp;#039;t many stations that support this kind of \noffbeat, genre-straddling Southern rock music. However, Liquored Up and \nLacquered Down would be right at home in bars, Karaoke clubs, jukeboxes, \nand the CD collections of those who like off-the-beaten-path Southern rock \nparty music. ","torrent":{"xt":"urn:btih:e05b943038fbaf6729f99d06c48192bc93b20001","amp;dn":"Southern+Culture+on+the+Skids+-+Liquored+Up+and+Lacquered+Down+%28","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e05b943038fbaf6729f99d06c48192bc93b20001","infoHashBuffer":{"type":"Buffer","data":[224,91,148,48,56,251,175,103,41,249,157,6,196,129,146,188,147,178,0,1]},"announce":[],"urlList":[]}}