{"title":"Total DC Comics for 7-16-2014 (darkhomr) [ALL]","uid":10593680,"size":619489835,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:e1fd5f849b2301741ea9fcafb2b1b578bfb34c3b&amp;dn=Total+DC+Comics+for+7-16-2014+%28darkhomr%29+%5BALL%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dadrkhomr","files":-1,"time":1405833090,"description":"This is the 20th week of a Total DC pack.  Similar to my Total Marvel pack, this gathering of comics will include both DC Universe and non-universe titles.  What will be in here will be Vertigo comics, non-DC Universe titles, and any digital titles released by Friday morning.  This release has 9 DC Universe comics 1 non-Universe titles and 6 digital titles.  \n\nMy release packs are as follows: \n\n \nDC Universe 52 (Wednesdays based on scanners release times, but not later than Friday morning)\nMarvel NOW! (Marvel Comics in the NOW! universe will be released Wednesdays, based on scanners release times)\nTotal Marvel (All Marvel Universe comics, released on Friday, based on scanners release times)\nIndependent Comics (Non-DC Universe and Major Independent comics, released between Sunday and Monday morning) \nTotal DC (all DC comics released for the current week.  Released by Saturday each week.  Does not include digital only releases)\nDC Monthly (all DC Universe comics for the month, released the first Friday after the end of the month)\nTotal Marvel Monthly (all Marvel Universe comics, released the first Tuesday after the end of the month)\n\n\n\n\nBatman '66 Meets The Green Hornet #5 (CBR 7/16/2014)\n\nThe Green Hornet--in the Bat cave? With their partners Robin and Kato held prisoner, Batman and the Green Hornet are forced to put aside differences and plan their next move together. \n\nBatman Eternal #15 (CBR 7/16/2014)\n\nWho is behind the hell beneath Arkham Asylum? Can Batwing and Jim Corrigan hope to stop it before it breaks out and consumes all of Gotham City? \n\nBatwoman #33 (CBR 7/16/2014)\n\nNocturna is out of Arkham, but is she really fit to return to society? Batwoman's investigations will send her spinning into the deadly clutches of Night-Thief! \n\nFables #142 (CBR 7/16/2014)\n\nAs the denizens of Fabletown choose sides, Snow White and Rose Red prepare for the battle of their lives. Part two of the epic 'Happily Ever After' storyline continues here, featuring a backup story of Sinbad: The Last Story Ever Told, by Oz artist extraordinaire Eric Shanower. \n\nGreen Lantern New Guardians #33 (CBR 7/16/2014)\n\nThe Psions have done the unthinkable: captured and incapacitated the Guardians themselves! Can Carol and Kyle get to them in time? Or will the Psions discover the secret of ultimate power locked inside the Guardians' very DNA?\n\nHarley Quinn Invades Comic Con Intl San Diego #1 (CBR 7/16/2014)\n\nThe title says it all! Our favorite little troublemaker, Harley Quinn, takes on Comic-Con International: San Diego in this over the top issue! She'll have to battle long lines, crazy crowds and the dread con crud, all in the quest to get her own comic book published! \n\nInfinite Crisis: Fight for the Multiverse #9 (CBR 7/16/2014)\n\nHeld prisoner by Atomic-Two Face, Batman and his team must find a way to escape the Atomic Universe. \n\nInjustice: Gods Among Us: Year Two #15 (CBR 7/16/2014)\n\nTime jumps ahead seven months and the regime of Superman remains in place. New life begins at the same time that a new potential menace hurtles towards the Earth\n\nNew 52 Futures End #11 (CBR 7/16/2014)\n\nThe Justice League demands Firestorm answer for Green Arrow's death. \n\nRobin Rises Omega #1 (CBR 7/16/2014)\n\nThe hunt for Robin is over, and the battle joined! But Batman's family feud with Ra's al Ghul is about to erupt into something bigger when it's interrupted by the forces of Apokolips! This epic story continues in this month's BATMAN AND ROBIN #33!\n\nScribblenauts Unmasked: A Crisis of Imagination #16 (CBR 7/16/2014)\n\nMaxwell has done the unthinkable--he's asked his ultimate nemesis, Doppelganger, for help against the Anti-Monitor's forces. But will Doppelganger answer the call? Don't count on it! \n\nSmallville: Chaos #7 (CBR 7/16/2014)\n\nClark has been released from his crystal prison, but he and Lois are no closer to home than before. That is, until the strange situation makes for even stranger bedfellows! \n\nSupergirl #33 (CBR 7/16/2014)\n\nRed Daughter of Krypton' - the finale! Faced with a threat from Worldkiller-1 and staggering allegations about her past, Supergirl is forced to question her role as a Red Lantern - and as a hero! Don't miss the thrilling conclusion to this epic adventure - and its shocking final pages! \n\nTeen Titans #1 (CBR 7/16/2014)\n\nRed Robin, Wonder Girl, Raven, Bunker and Beast Boy step out of the shadows of the adult heroes of the DC Universe to offer bold, exciting and sometime dangerous ideas on how to protect a world full of superpowered teenagers - any one of whom could be the next heroic figure or major villain! \n\nThe Vampire Diaries #34 (CBR 7/16/2014)\n\n&quot;&quot;&quot;Loyal Dogs&quot;&quot; part 1 of 3! Tyler Lockwood left Mystic Falls after his mother's murder, and is hiding with a werewolf pack in the Appalachians. But Katherine Pierce's arrival ends his peaceful plans for the summer!&quot; \n","torrent":{"xt":"urn:btih:e1fd5f849b2301741ea9fcafb2b1b578bfb34c3b","amp;dn":"Total+DC+Comics+for+7-16-2014+%28darkhomr%29+%5BALL%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1fd5f849b2301741ea9fcafb2b1b578bfb34c3b","infoHashBuffer":{"type":"Buffer","data":[225,253,95,132,155,35,1,116,30,169,252,175,178,177,181,120,191,179,76,59]},"announce":[],"urlList":[]}}