{"title":"William Shatner's Star Trek Memories","uid":4592017,"size":720111491,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e220de16792a156a8e3b6923437484dd1b2c92b8&amp;dn=William+Shatner%5C%27s+Star+Trek+Memories&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Welshguy","files":-1,"time":1229872176,"description":"William Shatner's Star Trek Memories\n\nReleased in 1996, this straight-to-video effort focuses almost entirely on the classic Star Trek series, as told by the principal actors of Star Trek: Leonard Nimoy, DeForest Kelley, James Doohan, Nichelle Nichols, George Takei, and Walter Koenig. Shatner, of course, gets center stage, telling anecdotes about the way each of the roles was cast and why each actor was uniquely suited for his or her role. A great deal is also made (and rightly so) about what a breakthrough the show represented in its multicultural casting. Shatner, who also serves as host, repeats many of the same stories he used in his book, Star Trek Memories, as do his old cast mates. Indeed, this is one of several Star Trek retrospective tapes in which Nichols or someone else tells the story about her encounter with Martin Luther King Jr., at a point when she was considering quitting the show because her part seemed so inconsequential\n\n\nAs James T. Kirk, the intrepid captain of the Starship Enterprise, William Shatner was at the forefront of the world's most popular sci-fi series. Now, for the first time, Shatner shares his personal remembrances of the original TV series and the Star Trek phenomenon. Joining him are original crew members Leonard Nimoy, Deforest Kelly, James Doonhan, George Takei, Nichell Nichols and Walter Koenig. You'll hear never-before-told stories behind Star Trek. How the fans rallied to save the show after it was canceled. How Chekov's look was styled after The Monkee's Davy Jones. Why the ship's chief engineer was Scottish, the origin of the Vulcan hand-salute, and much more. William Shatner's Star Trek Memories is the behind-the-scenes story of a classic series that lived long and prospered, hosted by the man who captained its amazing journey. \n\n\nAm sure there are are many Star Trek fans out there who would love an inside look at why Star Treck was so popular and who better to ask than William Shatner (Kirk) himself!\n\nPlease seed this as much as you can so others can enjoy it as well!\n\nEnjoy!\n","torrent":{"xt":"urn:btih:e220de16792a156a8e3b6923437484dd1b2c92b8","amp;dn":"William+Shatner%5C%27s+Star+Trek+Memories","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e220de16792a156a8e3b6923437484dd1b2c92b8","infoHashBuffer":{"type":"Buffer","data":[226,32,222,22,121,42,21,106,142,59,105,35,67,116,132,221,27,44,146,184]},"announce":[],"urlList":[]}}