{"title":"Never Again Series, 6 books + Supplement - R. J. Rummel","uid":7506060,"size":6498567,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e290753350da98efd5eb23c11e0f8aa55f1b0835&amp;dn=Never+Again+Series%2C+6+books+%2B+Supplement+-+R.+J.+Rummel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Djofullinn","files":7,"time":1344178205,"description":"It's as though President George Bush was sent back in time. The mission of these lovers in these novels in the Never Again Series is the same as that of Bush's foreign policy -- to promote freedom and end democide and war. But, starting in 1906 and not 2001. To read these novels and their supplement, therefore, is not only to be entertained, but also to get a better understanding of American foreign policy The six novels in this series are a what-if, alternative history. Foremost, these novels are character driven entertainment, filled with strong action, humor, pathos, high emotion, sex, conflict, and maybe even tears. There are a large number of docudramas in the books that provide background or context for the action and conflicts, such as Pol Pot's killing fields, the Chinese Cultural Revolution, the Holocaust, Stalin's starvation of the Ukraine, Turkey's genocide of the Armenians, Rwanda's genocide of the Tutu, the Russian abortive 1905 communist uprising, the Battle of the Somme in World War I, the Vietnam War and defeat of the South and resulting communist transformation of the country, an\n\nd finally the Boat People. These docudramas, with description of events and characterization of the victims. are true to the facts, as published in refugee and autobiographical materials.\n\nAbove all, these books are a story about love versus power -- the love of dedicated warriors for each other and for humanity and who risk their lives in their struggle against power, unaware that:\n\nUnseen, loves dark foe Power, like a deadly plague, Infests, corrupts, kills.\n &lt;a href=&quot;\nhttp://www.amazon.com/Democide-Never-Again-Series-Book/dp/1595263012/ref=sr_1_1?ie=UTF8&amp;qid=1344170596&amp;sr=8-1&amp;keywords=never+again+rummel&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Democide-Never-Again-Series-Book/dp/1595263012/ref=sr_1_1?ie=UTF8&amp;qid=1344170596&amp;sr=8-1&amp;keywords=never+again+rummel&lt;/a&gt;","torrent":{"xt":"urn:btih:e290753350da98efd5eb23c11e0f8aa55f1b0835","amp;dn":"Never+Again+Series%2C+6+books+%2B+Supplement+-+R.+J.+Rummel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e290753350da98efd5eb23c11e0f8aa55f1b0835","infoHashBuffer":{"type":"Buffer","data":[226,144,117,51,80,218,152,239,213,235,35,193,30,15,138,165,95,27,8,53]},"announce":[],"urlList":[]}}