{"title":"Bob.Marley.Heartland.Reggae.DvdRip.Xvid.avi","uid":6759061,"size":875025892,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e356b1e6b66bd657cb5bfe2df363d43fbbd7607a&amp;dn=Bob.Marley.Heartland.Reggae.DvdRip.Xvid.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jostahola","files":1,"time":1319141168,"description":"Bob Marley &amp; The Wailers - Heartland Reggae (1977)\nRas Lee Morris (Actor), Jacob Miller (Actor), James P. Lewis (Director)\n\n1. Jamaica 2. Dennis Brown 3. The Prophet 4. Trenchtown Rock 5. Stand Up 6. Inspiration 7. Jacob Miller 8. Unity Movie Description Reggae documentary of the One Love Peace Concert held in Kingston, Jamaica in 1978. In addition to the music, this film features the return to Jamaica of Bob Marley after a 16-month hiatus following an attempt on his life. Late, great reggae legend Bob Marley is joined by his acclaimed contemporary Peter Tosh and a dozen other reggae stars--including Jacob Miller, Dennis Brown, and Junior Tucker--in one of his finest concert performances. Filmed live in Marley's homeland, Jamaica, in 1977 and 1978, HEARTLAND REGGAE is one of the most renowned reggae concert films that exists. Also included are several sequences in which the Rastafarian lifestyle and philosophy are discussed. Synopsis The film centers around Marley's historic &quot;One Love Peace Concert,&quot; and captures Marley and other reggae stars Jacob Miller and Peter Tosh at the height of their careers. Shot entirely on location in Jamaica between 1977 and 1978, it is considered to be the definitive reggae film.\n\nRastafarian Bob Marley and his Wailers are the highlight of this documentary of the One Love Peace Concert held in Jamaica and featuring many of the other singers who had performed with Marley in Europe, Africa, and America. Just coming out of a series of successful songs and international recognition, Marley is in top shape, though his reggae music, even in 1980, had yet to really catch on in the U.S. Performers include the I-Threes, Peter Tosh, Althea &amp; Donna, and several others. Unfortunately, the technical quality of the documentary is poor, though Marley manages to outshine any such difficulties. Marley's cancer at this time was kept under wraps and is not mentioned in the documentary. He would die the following year in Miami, at the age of 36.\n\nFeaturing: Peter Tosh, The I-Threes, Judy Mowatt, U-Roy, Dennis Brown and More.\n\n\nSeed'N'Joy!\n;-)","torrent":{"xt":"urn:btih:e356b1e6b66bd657cb5bfe2df363d43fbbd7607a","amp;dn":"Bob.Marley.Heartland.Reggae.DvdRip.Xvid.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e356b1e6b66bd657cb5bfe2df363d43fbbd7607a","infoHashBuffer":{"type":"Buffer","data":[227,86,177,230,182,107,214,87,203,91,254,45,243,99,212,63,187,215,96,122]},"announce":[],"urlList":[]}}