{"title":"Curse of Chucky2013hAarabicsub(hd)","uid":9289875,"size":1130094944,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:e385889ef26d058e1375731fe766b8c40bc1cd7f&amp;dn=Curse+of+Chucky2013hAarabicsub%28hd%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1386070800,"description":"Twenty-five years after the first Child's Play film, a Chucky doll (voiced by Brad Dourif), arrives in the mail of the family home of paraplegic Nica (Fiona Dourif) and her mother, Sarah. That night Sarah is found dead from a stab wound and her death proclaimed a suicide.\n\nThe next day Nica's older sister Barb (Danielle Bisutti) arrives, accompanied by her husband, Ian; daughter, Alice; live-in nanny, Jill; and Father Frank, a priest. Alice finds Chucky and keeps him. Nica and Alice cook chili for dinner, and Chucky secretly pours rat poison into one of the bowls. Father Frank eats the poison, and after leaving the house, is fatally involved in a car crash.\n\nAfter everyone else has gone to their rooms to sleep, Nica attempts to track down the origins of the Chucky doll. She looks up &quot;Chucky Doll Evidence&quot; on the internet, where she finds news articles of the unsolved Chucky murders and the doll's link to dead serial killer Charles Lee Ray. Chucky sneaks out of Alice's bed and kills Jill by kicking a bucket of rain water over onto the floor's power outlets. Jill is electrocuted to death, which also causes a blackout. Barb gets up to check on Alice, and finds Chucky sitting on the stairs that lead to the attic. Thinking that Alice is in the attic, Barb goes up to look for her, but she is killed by Chucky with a kitchen knife. With the elevator unusable due to the blackout, Nica crawls up the stairs to the first floor. Barb is already dead by the time she gets there, and Chucky reveals himself to Nica. Nica wakes up Ian, who takes Nica to the garage before going back into the house to find Alice.\n\nChucky enters the garage and starts the car, trying to kill Nica with carbon monoxide poisoning. Ian returns to the garage and, believing that Nica is responsible for the murders, disarms her. There is a hidden camera on Chucky, which Ian had planted to get evidence of Barb's affair with Jill. Ian reviews the footage, which shows that Alice is locked in a closet and Chucky is alive. Before Ian can act, Chucky uses Nica's wheelchair to run Ian over, and kills him with a hatchet. Nica manages to break out of her restraints and decapitates Chucky with the hatchet, though he is still alive and reattaches his head.\n\nChucky pushes Nica over the balcony and she falls to the ground floor. Nica asks why Chucky is doing this and through flashbacks, Chucky explains that he was a friend of the family and in love with Sarah. Chucky killed Nica's father and kidnapped Sarah while she was heavily pregnant. When Chucky realized Sarah betrayed him by calling the police, he stabbed her in the stomach, which caused Nica to be born paraplegic, and fled. Chucky's flight from the police lead to his death as a human, setting off the events of the franchise, which is why he came back to Sarah for revenge. A police officer arrives at the house, but when he enters he only sees Barb's body upstairs and Nica holding the bloody knife. Chucky watches, unmoving, from a nearby chair.\n\nSome time later, Nica is found guilty of the murders and sent to an asylum. The arresting officer takes Chucky away in a plastic bag to be delivered to an unknown person. While in his car, Tiffany (Jennifer Tilly) pops up in the backseat and slits his throat. Tiffany then mails Chucky to his next target. Alice, now living with her grandmother, comes home from school to find Chucky waiting for her. Chucky persuades Alice to play &quot;Hide The Soul&quot;, starting a chant that is supposed to transfer his soul to Alice's body. Chucky had informed Alice that her grandmother was in the cellar. While saying the chant, the grandmother pops up outside the cellar door with a plastic bag over her face, revealing Chucky had tried to suffocate her.\n\nIn a post-credits scene, Chucky is delivered to the now adult Andy Barclay (Alex Vincent). When Andy turns his back to answer a phone call from his mother, Chucky cuts his way out of the package. Andy, having anticipated Chucky coming after him, holds a shotgun to Chucky's head and says, &quot;Play with this&quot;, before pulling the trigger.","torrent":{"xt":"urn:btih:e385889ef26d058e1375731fe766b8c40bc1cd7f","amp;dn":"Curse+of+Chucky2013hAarabicsub%28hd%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e385889ef26d058e1375731fe766b8c40bc1cd7f","infoHashBuffer":{"type":"Buffer","data":[227,133,136,158,242,109,5,142,19,117,115,31,231,102,184,196,11,193,205,127]},"announce":[],"urlList":[]}}