{"title":"Jackson Browne Solo Acoustic 2 - 2008","uid":4067981,"size":87033958,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e4d14558bf786ec92e438a3735e6ddbd591a245e&amp;dn=Jackson+Browne+Solo+Acoustic+2+-+2008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"crashray","files":23,"time":1204902392,"description":"A sequel to the 2005 Grammy nominated Vol. I. Twelve songs culled from Browne&amp;#039;s extensive and critically acclaimed solo acoustic concerts around the world over the past few years. Like its predecessor, it captures both spirited and humorous exchanges between Jackson and his audiences, making for a truly intimate listening experience. It reaches back to his debut album and spans his entire career with highlights such as &quot;Never Stop&quot;, The Night Inside Me&quot; and &quot;In The Shape Of A Heart&quot;.\n\n\n\n\nJackson Browne gave listeners the first volume of his solo acoustic live performances in 2005. It was steeped in the gems from his rich catalog, presented with spoken word introductions to many of his best-known songs with a smattering of newer ones. The commentary got tiring in the CD format, but the music was impeccable and illustrated just how valuable he&amp;#039;s been to American music as a songwriter. This second volume, while it does the same thing, is -- in a manner -- a mirror image of the first. The songs here are primarily from his later years. What&amp;#039;s really interesting is that it doesn&amp;#039;t matter. Browne&amp;#039;s later songs communicate so directly that, presented in this manner, with only an acoustic guitar or a piano as accompaniment, we can find ourselves wandering around in reverie, or re-glimpsing the traces of emotion and time&amp;#039;s passage as signposts to the way we live now. While there are a few &quot;classic&quot; tracks -- &quot;Redneck Friend,&quot; &quot;Something Fine,&quot; and &quot;Somebody&amp;#039;s Baby&quot; (from the Fast Times at Ridgemont High soundtrack) -- most of the material here comes from records after Hold Out. There are three tunes from his last studio offering, the generally ignored and underrated Naked Ride Home, which stack up seamlessly with his &amp;#039;70s material. Those tunes, &quot;The Night Inside Me,&quot; &quot;Casino Nation,&quot; and &quot;My Stunning Mystery Companion,&quot; grace the beginning, middle, and end of this offering. In other words, no matter where else Browne goes (and he goes all the way back to &quot;Something Fine&quot;), he returns to the present tense, where he now exists as a songwriter. The performances of these tracks, and those from albums such as Looking East, I&amp;#039;m Alive, World in Motion, and Lives in the Balance, offer listeners an opportunity to hear Browne at his most elemental. His songs began this way, with a lone instrumental backing, as a melody dictating itself to words or vice versa, and were hammered out or came in the flush of white-heat creativity, but they were shorn of any adornment -- just as they are here. The spoken introductions to several numbers are overly long and may have been fine for a sitting audience, but don&amp;#039;t necessarily translate well to CD. That&amp;#039;s a small complaint, however, as these 12 songs are quietly powerful, full of a particular craft and enigmatic gifts -- no matter when they were written or recorded. Browne has never lost it as a songwriter; this is the proof. If you went to the trouble to purchase the first volume, this is an essential counterpart.","torrent":{"xt":"urn:btih:e4d14558bf786ec92e438a3735e6ddbd591a245e","amp;dn":"Jackson+Browne+Solo+Acoustic+2+-+2008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4d14558bf786ec92e438a3735e6ddbd591a245e","infoHashBuffer":{"type":"Buffer","data":[228,209,69,88,191,120,110,201,46,67,138,55,53,230,221,189,89,26,36,94]},"announce":[],"urlList":[]}}