{"title":"MARVEL FANFARE (1982-1997 Complete) v1 01-60, v2 01-06 REQUESTED","uid":8332438,"size":935401447,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:e62b6da4a06b174cb639ee35f0509e07f56dddcf&amp;dn=MARVEL+FANFARE+%281982-1997+Complete%29+v1+01-60%2C+v2+01-06+REQUESTED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":6,"uploader":"STFmaryville","files":-1,"time":1364913810,"description":"This fills a request by binderguy1. At least I think it was binderguy1 -- the comments function isn't working right now, and I can't go back and find who asked for this series. Oh well, does it really matter? Great anthology title, although after 1988 or so, it went downhill in quality. And don't even mention volume 2, it's only here for completion's sake!\n\nInterestingly, I find those old Jim Shooter full-page essays to be pretty good! Read the one about black heroes.\n\nAll credit to the original scanners, including Youngstar and Gird.\n\nPlease seed and share, so no one ever has to track down Marvel Fanfare volume 2, #5-6 from 1997 again...\n\n------\n\nFrom Wikipedia:\n\nMarvel Fanfare is the title of two comic book series published by Marvel Comics. Both versions of Marvel Fanfare were anthology, showcase titles featuring a variety of characters.\n\nMarvel Fanfare featured characters and settings from throughout the Marvel Universe, and included stories of varying lengths by a vast array of different creators. The title was published every two months from March 1982 to December 1991 and ran for 60 issues. It was edited throughout its run by Al Milgrom, who also wrote and drew an illustrated column in most issues, entitled &quot;Editori-Al&quot;. \n\nThe series began with a Spider-Man/Angel team-up story by Chris Claremont and Michael Golden. Other Spider-Man appearances in the title included team-ups with the Scarlet Witch in issue #6 and the Hulk in issue #47. A Silver Surfer story by Steve Englehart and John Buscema that was originally intended for the character's own series appeared in Marvel Fanfare #51.\n\nMarvel Fanfare was envisioned as a showcase of the comics industry's best talent. Each issue featured 36 pages of material with no advertisements and it was printed on magazine-style slick paper. it was more than twice as expensive as standard comic books ($1.25 in 1982 when most titles were 60 cents and $2.25 in 1992 when most were $1).\n\nMarvel Fanfare Volume Two was published monthly for 6 issues between 1996 and 1997. This version of the title was edited by James Felder. The title is notable for featuring the early work of writer Joe Kelly and penciller Scott Kolins.\n\nLike the first volume the title featured different creative teams in each issue and starred different characters from around the Marvel universe. However, the talent were mostly newcomers, the paper was cheap and it cost half the price of most other comics (99 cents when most comics cost $1.95).","torrent":{"xt":"urn:btih:e62b6da4a06b174cb639ee35f0509e07f56dddcf","amp;dn":"MARVEL+FANFARE+%281982-1997+Complete%29+v1+01-60%2C+v2+01-06+REQUESTED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e62b6da4a06b174cb639ee35f0509e07f56dddcf","infoHashBuffer":{"type":"Buffer","data":[230,43,109,164,160,107,23,76,182,57,238,53,240,80,158,7,245,109,221,207]},"announce":[],"urlList":[]}}