{"title":"The Cure - Wish 1992 (Custom Optimization, 2007) FLAC","uid":3908240,"size":478838685,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e66b80904c6347645ef267f7e6714a4b6d52c247&amp;dn=The+Cure+-+Wish+1992+%28Custom+Optimization%2C+2007%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Tech-Noir","files":14,"time":1195975640,"description":"The Cure - Wish 1992 (Custom Optimization, 2007) FLAC\n\n\n------------------\nTechnical Info\n------------------\n\n\n-Source material:\nFLAC Lossless\n\n\n-New Encoding:\nFLAC\n\n\n-Total Size:\n456 MB\n\n\n-Total Play Time:\n1:06:16\n\n\n-Tracklist:\n1. 01-the cure - open optimized-2007-air (6:51)\n2. 02-the cure - high optimized-2007-air (3:37)\n3. 03-the cure - apart optimized-2007-air (6:38)\n4. 04-the cure - from the edge of the green deep sea optimized-2007-air (7:44)\n5. 05-the cure - wendy time optimized-2007-air (5:13)\n6. 06-the cure - doing the unstuck optimized-2007-air (4:24)\n7. 07-the cure - friday im in love optimized-2007-air (3:38)\n8. 08-the cure - trust optimized-2007-air (5:33)\n9. 09-the cure - a letter to elise optimized-2007-air (5:14)\n10. 10-the cure - cut optimized-2007-air (5:55)\n11. 11-the cure - to wish impossible things optimized-2007-air (4:43)\n12. 12-the cure - end optimized-2007-air (6:46)\n\n\n\n-------------------\nGeneral Info\n-------------------\n\n\nI only fixed this one up a little. Mostly I tried to add some more &quot;life&quot; to it. Originally it could be considered quite &quot;flat&quot;, or slightly lacking in the dynamics department. It lacked some punchiness, but it also was quite uncompressed which might make the songs feel a little dull and &quot;transparent&quot; and lacking that edge it could have.\n\nSo I have basically done some dynamics processing (reversed compression) to bring some life back into the drums and such. The benefit is that this also sparks up the general audio, since this makes certain elements like the drums affect other elements aswell, which generaslly leads to a more cohesive and interesting sound. Having a kick drum slightly affect the volume of guitars or vocals gives a feeling of all the elements being connected, and even subtle amounts can have great effects. Not always needed, but in most cases it is appropriate it seems. It seems to depend somewhat on how the original recording is. If it is mixed well and such it seems it might not need this kind of treatment, but for some reason most types of tracks I&amp;#039;ve come across seem to respond well to it.\n\nAlso EQed a bit to bring some life back into the bass, which helped in giving the tracks back some warmth. Other than that just some slight EQing across the tracks to make them similar in character. A few tracks seem to have been recorded differently, since they generally are &quot;duller&quot; in their sound, and EQing them proved slightly difficult since trying to bring back the high-end showed that the vocals suffered alot from sharp &quot;s&quot;-ing that none of the other tracks seemed to have. So I have had to compromise between the overall track and the individual elements, as is usually the case. :)\n\nI&amp;#039;m not a pro, I just do this because I find it interesting to see what you can do. I&amp;#039;ve so far tried my hand at only maybe 10-20 albums, and I am learning from every one of them. I have nowhere near the precision of the guys who do this kind of stuff for a living. I usually have somewhat of an idea of what needs to be done, but when it comes to Equalizing and such, it takes years and years of training to learn to judge it properly and consistently. I personally consider myself to be somewhat in the general ballpark, but that is all. :)","torrent":{"xt":"urn:btih:e66b80904c6347645ef267f7e6714a4b6d52c247","amp;dn":"The+Cure+-+Wish+1992+%28Custom+Optimization%2C+2007%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e66b80904c6347645ef267f7e6714a4b6d52c247","infoHashBuffer":{"type":"Buffer","data":[230,107,128,144,76,99,71,100,94,242,103,247,230,113,74,75,109,82,194,71]},"announce":[],"urlList":[]}}