{"title":"The Queen of Spades - Alexander Pushkin   (BBC 1997)","uid":8726926,"size":39986892,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e6d990bc4ebd9b5f5013c42b6e8ebe8e95c44da4&amp;dn=The+Queen+of+Spades+-+Alexander+Pushkin+++%28BBC+1997%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Robin1966","files":2,"time":1374525839,"description":"The Queen of Spades by Alexander Pushkin\n\nDramatised by Michelin Mundo from a short story by Alexander Pushkin about human avarice.\n\nPushkin wrote the story in autumn 1833 in Boldino and it was first published in the literary magazine Biblioteka dlya chteniya in March 1834.\n\nThe story was the basis of the operas The Queen of Spades (1890) by Pyotr Ilyich Tchaikovsky, La dame de pique (1850) by Fromental Halvy and Pique Dame (1865) by Franz von Suppe. It has been filmed various times, the most notable version being a 1949 film by the same name directed by Thorold Dickinson.\n\nPlot (Wiki):\nHermann, an ethnic German, is an officer of the engineers in the Imperial Russian Army. He constantly watches the other officers gamble, but never plays himself. One night, Tomsky tells a story about his grandmother, an elderly countess. Many years ago, in France, she lost a fortune at cards, and then won it back with the secret of the three winning cards, which she learned from the notorious Count of St. Germain. Hermann becomes obsessed with obtaining the secret.\n\nThe countess (who is now 87 years old) has a young ward, Lizavyeta Ivanovna. Hermann sends love letters to Lizavyeta, and persuades her to let him into the house. There Hermann accosts the countess, demanding the secret. She first tells him that story was a joke, but Hermann refuses to believe her. He repeats his demands, but she does not speak. He draws a pistol and threatens her, and the old lady dies of fright. Hermann then flees to the apartment of Lizavyeta in the same building. There he confesses to have killed the countess by fright with his pistol. He defends himself by saying that the pistol was not loaded. He escapes from the house with the aid of Lizavyeta, who is disgusted to learn that his professions of love were a mask for greed.\n\nHermann attends the funeral of the countess, and is terrified to see the countess open her eyes in the coffin and look at him. Later that night, the ghost of the countess appears. The ghost names the secret three cards (three, seven, ace), tells him he must play just once each night and then orders him to marry Lizavyeta. Hermann takes his entire savings to Tchekalinsky's salon, where wealthy men gamble for high stakes. On the first night, he bets it all on the three and wins. On the second night, he wins on the seven. On the third night, he bets on the ace - but when cards are shown, he finds he has bet on the Queen of Spades, rather than the ace, and loses everything. When the Queen appears to wink at him, he flees in terror.\n\nHermann goes mad and is committed to an asylum. He is installed in Room 17 at the Obukhov hospital; he answers no questions, but merely mutters with unusual rapidity: &quot;Three, seven, ace! Three, seven, queen!&quot;.\n\nCast:\nGreg Wise - Gherman (or Herman), an army engineer\nMoira Lister - The Countess, called the Queen of Spades\nAmanda Root - Lisa, the Countess' grandaughter\n\n------------------------------------------------------------------------------File Information---------------------------------------------------------------------------\nFirst broadcast: BBC R4 - Saturday Night Theatre 29 March 1997\nType: MPEG 1.0 Layer 3 - 64 kbps mp3 - 44 khz - Stereo\nDuration: 1 hour 24 minutes\nWebrip, thanks to the original uploader - Unknown\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:e6d990bc4ebd9b5f5013c42b6e8ebe8e95c44da4","amp;dn":"The+Queen+of+Spades+-+Alexander+Pushkin+++%28BBC+1997%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6d990bc4ebd9b5f5013c42b6e8ebe8e95c44da4","infoHashBuffer":{"type":"Buffer","data":[230,217,144,188,78,189,155,95,80,19,196,43,110,142,190,142,149,196,77,164]},"announce":[],"urlList":[]}}