{"title":"Hard Bitten - Chloe Neill.epub","uid":9141650,"size":293218,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e6e04a09bd69cacbe0b8e5103db76774ff901684&amp;dn=Hard+Bitten+-+Chloe+Neill.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":1,"time":1383519955,"description":"A fun cast of quirky character and smokin'-hot sexual tension... a stunning combination' Tate Hallaway Times are hard for newly minted vampire Merit. Ever since shapeshifters announced their presence to the world, humans have been rallying against supernaturals - and they're camping outside Cadogan House with protest signs that could turn to pitchforks at any moment. Behind its doors, things between Merit and her Master, green-eyed heartbreaker Ethan Sullivan are... tense, to say the least. But they have to work together when the mayor of Chicago calls Merit and Ethan to a clandestine meeting: there's been a violent vampire attack which has left three women missing. The mayor's message is simple: get your House in order. Or else. Merit needs to get to the bottom of this crime, but it's not easy when she can't tell who's on her side. So she goes outside Cadogan House, secretly calling in a favour from someone who's tall, dark, and part of an underground vamp group which might be able to shed some light on the attack. It's not long before Merit finds herself in the dark, heady heart of Chicago's supernatural society - which seems to be full of vampires ready to fulfill the human's worst fears. She's about to learn that you can't be a vampire without getting a little blood on your hands...\nGenre: Romance/Paranormal","torrent":{"xt":"urn:btih:e6e04a09bd69cacbe0b8e5103db76774ff901684","amp;dn":"Hard+Bitten+-+Chloe+Neill.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6e04a09bd69cacbe0b8e5103db76774ff901684","infoHashBuffer":{"type":"Buffer","data":[230,224,74,9,189,105,202,203,224,184,229,16,61,183,103,116,255,144,22,132]},"announce":[],"urlList":[]}}