{"title":"Sri Lanka's Killing Fields - War Crimes Unpunished.avi","uid":9209998,"size":506631486,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e878175636486d994c631e01ad4ff315b1d985ce&amp;dn=Sri+Lanka%27s+Killing+Fields+-+War+Crimes+Unpunished.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1384763716,"description":" &lt;a href=&quot;http://www.channel4.com/programmes/sri-lankas-killing-fields&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.channel4.com/programmes/sri-lankas-killing-fields&lt;/a&gt;\n\n\nSri Lanka's Killing Fields was an investigatory documentary about the final weeks of the Sri Lankan Civil War broadcast by the British TV station Channel 4 on 14 June 2011.[1] Described as one of the most graphic documentaries in British TV history, the documentary featured amateur video from the conflict zone filmed by civilians and Sri Lankan soldiers which depicted &quot;horrific war crimes&quot;.[1] The video filmed by civilians included harrowing scenes during and after intense shelling of civilian targets, including hospitals, by the Sri Lankan military. The &quot;trophy video&quot; filmed by Sri Lankan soldiers showed disturbing scenes of blindfolded victims being executed and dead bodies of naked women being dragged onto trucks by soldiers as they made lewd remarks about the victims. The documentary also included interviews with civilians who managed to survive the conflict, United Nations staff based in Sri Lanka during the conflict, human rights organisations and an international law expert. The documentary was made by ITN Productions and presented by Jon Snow, the main anchor on Channel 4 News.\nThe Sri Lankan government has denounced the documentary as a fake[2] and the Defence Ministry produced a documentary named Lies Agreed Upon, countering allegations made in the Sri Lanka's Killing Fields.\nSri Lanka's Killing Fields elicited reactions from foreign governments, international human rights groups and various public figures. The film was nominated for a BAFTA TV Award for Best Current Affairs documentary and won the Current Affairs - International category of the Royal Television Society's Television Journalism Awards 2010/2011. Furthermore, the documentary won two One World Media Awards in 2012 in the categories &quot;Television&quot; and &quot;Documentary&quot;. In November 2011 Channel 4 announced that it had commissioned a follow-up film Sri Lanka's Killing Fields: War Crimes Unpunished from ITN Productions with new evidence concerning the final days of the conflict, broadcast in March 2012.","torrent":{"xt":"urn:btih:e878175636486d994c631e01ad4ff315b1d985ce","amp;dn":"Sri+Lanka%27s+Killing+Fields+-+War+Crimes+Unpunished.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e878175636486d994c631e01ad4ff315b1d985ce","infoHashBuffer":{"type":"Buffer","data":[232,120,23,86,54,72,109,153,76,99,30,1,173,79,243,21,177,217,133,206]},"announce":[],"urlList":[]}}