{"title":"PequeXP 1.2 SP3 Spanish","uid":4174997,"size":276571503,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e8980914c9f8526dd2bdc9c4a5c01a44d8469d6f&amp;dn=PequeXP+1.2+SP3+Spanish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"kapaka","files":2,"time":1210079290,"description":"PequeXP 1.2 con SP3\n\nPequeXP ha sido creado para ser una instalacion peque??a y rapida. He eliminado muchas funciones y accesorios de windows para optimizar el sistema.\nMuchos programas microsoft tienen muchas funciones que no son necesarias para todos. Esta instalacion es para aquellos que prefieren usar otros programas mas concretos para cada necesidad. Tambien aquellos con ordenadores antiguos y poco potentes se benefician con esta instalacion. Y siempre queda el recurso de volver a instalar programas de windows con el CD original de instalacion de windows XP.\n\nEsta version de Windows XP esta basada en la version inglesa de tinyXP de eXPerience.\n\nLa version de XP es la 5.1.2600 con el Service Pack 3 v.5512 \n\nLa instalacion es completamente silenciosa. Desde el momento que empieza a formatear la particion donde se instala ya no solicita ninguna informacion.\n\nNo esta Windows Media Player ni Internet Explorer de microsoft pero si esta el nucleo de los programas. Puedes actualizarlos con el ultimo IE y WMP.\n\nLos drivers no estan integrados en la instalacion, han de ser instalados manualmente en Administracion de Dispositivos.\nLos unicos drivers integrados son los de SCSI, SATA y los SATA RAID tanto los chipset intel como los micron.\n\nTiene algunos tweaks de servicios y registro para agillizar el uso de windows.\n\nLa instalacion ya esta activada y con WGA.\n\nDentro del CD, en la carpeta PequeXP, hay un documento con los detalles para la instalacion y el uso de esta distribucion.\n\nVersion de Windows XP realizada con nLite  v1.4.5 beta2 &lt;a href=&quot; http://www.nliteos.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.nliteos.com/&lt;/a&gt;\nEl archivo Ultima Sesi??n.ini contiene los parametros de esta version\n\nel archivo de texto PequeXP 1.2 contiene mas detalles de la distribucion\n\nA ver si ahora va bien :)\n","torrent":{"xt":"urn:btih:e8980914c9f8526dd2bdc9c4a5c01a44d8469d6f","amp;dn":"PequeXP+1.2+SP3+Spanish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8980914c9f8526dd2bdc9c4a5c01a44d8469d6f","infoHashBuffer":{"type":"Buffer","data":[232,152,9,20,201,248,82,109,210,189,201,196,165,192,26,68,216,70,157,111]},"announce":[],"urlList":[]}}