{"title":"Wilkie Collins - The Woman in White (BBC)","uid":6517904,"size":219202039,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e8e3c43eca25810fc97b3efce5dcfb69456ee20b&amp;dn=Wilkie+Collins+-+The+Woman+in+White+%28BBC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fakeplastictrousers2","files":-1,"time":1309891841,"description":"From BBC Radio 4 Extra. Written by Wilkie Collins; Full-cast dramatisation starring Toby Stephens, Walter Hartright, Juliet Aubrey, Emily Bruni and Jeremy Clyde; Dramatised by Martyn Wade.\n\nA lonely stretch of road on Hampstead Heath is the venue for Walter Hartright's midnight first encounter with a mysteriously distressed figure in white. As he helps the woman to escape from unnamed pursuers, he has little understanding of the way she will affect his future.\n\nWalter's new work as a drawing master takes him to Limmeridge House, in Cumberland. There he meets and falls in love with Laura, who strangely resembles the woman in white. She, however, is soon to marry the financially embarrassed Sir Percival Glyde. Events at Limmeridge take a surprising turn when Anne Catherick arrives, and Walter recognises her as the mystery figure. It appears that her recent incarceration in a mental asylum was at the behest of Sir Percival, who is all too aware of the secret she holds.\n\nSir Percival's machinations to gain control of his new bride's wealth put both Laura and Anne in danger, and more than one life will be lost before Walter's mystery of the woman in white can be fully explained. ","torrent":{"xt":"urn:btih:e8e3c43eca25810fc97b3efce5dcfb69456ee20b","amp;dn":"Wilkie+Collins+-+The+Woman+in+White+%28BBC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8e3c43eca25810fc97b3efce5dcfb69456ee20b","infoHashBuffer":{"type":"Buffer","data":[232,227,196,62,202,37,129,15,201,123,62,252,229,220,251,105,69,110,226,11]},"announce":[],"urlList":[]}}