{"title":"Lighthouse Inn Mystery Series (1 - 7) By Tim Myers","uid":8805521,"size":3547494,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e8e4f32270840cd929ddd82be5e721ad450ccc5a&amp;dn=Lighthouse+Inn+Mystery+Series+%281+-+7%29+By+Tim+Myers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"maxdesolate","files":21,"time":1376319665,"description":"Lighthouse Inn Mystery series by Tim Myers (Books 1-7)\n\nInnkeeping with Murder #1\nTucked away in the foothills of the Blue Ridge Mountains is the Hatteras West Inn and Lighthouse. Innkeeper Alex Winston watches over the cozy getaway, and guests count on him to take care of everything from basic repairs to breakfast. But he also has to take care of the occasional murder case, too.When a visitor is found dead at the top of the lighthouse, Alex must solve the mystery and capture the culprit before the next guest checks out.\n\nReservations for Murder #2\nIn this second Lighthouse Inn Mystery, innkeeper Alex Winston discovers a new attraction at the county fair: a corpse.\n\nMurder Checks Inn #3\nHatteras West Inn owner Alex Winston hosts an inn full of suspects, when his uncle is murdered right before a scandalous will reading.\n\nRoom for Murder #4\nThe Agatha Award-nominated series continues-featuring Alex Winston and his inland lighthouse getaway. When two of Alex's friends announce that they're finally tying the knot, Alex will have to tie up a few loose ends after the bride-to-be'sex shows up dead on the inn's property.\n\nBooked for Murder #5\nThe Agatha Award-nominated series continues--featuring Alex Winston and his inland lighthouse getaway. When a cursed gem disappears--and dead bodies appear--Alex must stop a killer and save his beloved inn before the next life claimed is his.\n\nKey to Murder #6\nNew from 10 time IMBA National Bestselling Author and Agatha Award Nominee Tim Myers! Agatha Award Nominated Series! Alex and Elise swap lighthouse inns and go the Outer Banks to run the Cape Kidd lighthouse inn. While they are there, murder pays a visit, and as the innkeepers and guests are isolated from the rest of the world by a storm, they must solve the murder, or be the next victims. Includes a special afterword on how the Lighthouse Inn books came to be!\n\nRing for Murder #7\nAgatha Award Nominated Series!\nThe Last Lighthouse Inn Mystery! 30,000 word novella!\nAlex and Elise are finally getting married! At least they think so. But when a body of one of their guests is found murdered on the day of their wedding, they must find the killer before they can say I do!\n\n\nEPUB AND MOBI.\n\nTHANKS AND CREDIT GO TO UPLOADER OSCAR FOR UPLOADING THIS ON ANOTHER SITE. ","torrent":{"xt":"urn:btih:e8e4f32270840cd929ddd82be5e721ad450ccc5a","amp;dn":"Lighthouse+Inn+Mystery+Series+%281+-+7%29+By+Tim+Myers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8e4f32270840cd929ddd82be5e721ad450ccc5a","infoHashBuffer":{"type":"Buffer","data":[232,228,243,34,112,132,12,217,41,221,216,43,229,231,33,173,69,12,204,90]},"announce":[],"urlList":[]}}