{"title":"Arctic Sleep - Passage Of Gaia  mp3 (2014)","uid":11189646,"size":132586433,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e909e76ab8cc0ed76986b03a1187594aadb57124&amp;dn=Arctic+Sleep+-+Passage+Of+Gaia++mp3+%282014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"analogkid6103","files":9,"time":1412973501,"description":"Quote:\nArctic Sleep is a Milwaukee based band that incorporates elements of space-rock, doom, and drone into songs driven by a unique combination of massively atmospheric heaviness and bittersweet melody accompanied by calm &amp; ghostly vocals delivering lyrics containing recurring themes of nature, space, sorrow, and detatchment.  \n\nThe band was started in 2005 by multi-instrumentalist Keith D and amplifier-obsessed guitarist Mike Gussis.  They recorded their first full-length album &quot;Mare Vaporum&quot; as a duo in 2006, a simply-produced yet powerful set of songs recorded in a friend's basement digital studio.  The opening track, &quot;Over The Antifreeze Rainbow,&quot; a dynamic &amp; emotional seventeen-minute epic about the narrator's final contemplative moments while exiled in an abandoned spacecraft, set the stage for what would be Arctic Sleep's sound and imagery... slow-paced, melodic, spacious soundscapes that dramatically drift between quiet, beautiful stargazing and infinite, hypnotic loudness. Ghostly, whisky-soaked vocals and dreamlike lyrics that lurk above a swamp of slow-motion drumming and down-tuned riffing, creating an almost psychedelic atmosphere designed to drift the listener far away from reality... imagery of nature and the cosmos... songs about light and shadow, life and death, beauty and sadness.  \n\nAfter forming a full band and doing a handful of live appearances over the next year, the group disbanded while members persued other interests.  During this time, Keith wrote and produced the second long-playing Arctic Sleep record completely solo, 2009's &quot;Abysmal Lullabies&quot; which was met with critical acclaim.  Recorded with esteemed audio engineer Joel Wanasek, the album was of high production value and more freedom in the studio allowed D the addition of more drone, acoustic guitars, and cello.  Following the album's release, D began to search for musicians to form a live band and was soon joined by drummer Nick Smalkowski (Sally, Builder/Destroyer).  Keith subsequently asked co-founder Gussis to return and share in the songwriting and guitar duties for new material, to which he obliged.  After a successful live performance with the newly-reformed Arctic Sleep in early 2010, Keith and Gussis began to collaborate on material for what would become the band's third album.  \n\nThe third album, entitled &quot;Earth To Earth&quot; was released in November 2010 to critical acclaim and earned Arctic Sleep a small but very\ndevoted core of fans spanning the globe.  It was around this time that frontman/founder Keith D moved to Milwaukee but continued to keep the band fully active.  \n\nArctic Sleep's cult fanbase continues to grow, not only appealing to music enthusiasts in the United States but all over the world.\n\nRelying on a successful presale funded by loyal hardcore fans, in which the fans received the album before public release, the band was able to return to the studio in the summer of 2012 to forge their heaviest, most epic, and most approachable album yet, &quot;Arbors,&quot; set for release October 2nd of 2012.\n\nYear:\n2014\n\nGenre:\nProgressive/Atmospheric Doom Metal\n\nOrigin:\nUSA\n\n\nArctic Sleep - Passage Of Gaia (2014)\n\n\n\nTracklist:\n1.The Staircase\n2.Terra Vindicta\n3.Green Dragon\n4.Hyperion\n5.Antipode\n6.Passage Of Gaia\n7.Solar Lament\n8.Destroy The Urn\n\n\n\n\nEnjoy and support the Artist..!\nPeace..\nGenre:\tDoom\nSubgenre:\tProgressive / Atmospheric Doom Metal\nBitrate:\t320 k\nSize:\t126.44 MB\nShow/Hide Files: \t\n9 files","torrent":{"xt":"urn:btih:e909e76ab8cc0ed76986b03a1187594aadb57124","amp;dn":"Arctic+Sleep+-+Passage+Of+Gaia++mp3+%282014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e909e76ab8cc0ed76986b03a1187594aadb57124","infoHashBuffer":{"type":"Buffer","data":[233,9,231,106,184,204,14,215,105,134,176,58,17,135,89,74,173,181,113,36]},"announce":[],"urlList":[]}}