{"title":"Strings (Hard Rock Harlots #1.0) - Grey Kendall - EPUB","uid":9777808,"size":717744,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eb11b68e7bde29adb8f1c301f985eca92d07f4c9&amp;dn=Strings+%28Hard+Rock+Harlots+%231.0%29+-+Grey+Kendall+-+EPUB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AtomTPB","files":1,"time":1395065743,"description":"Print Length: 230 pages\nPublisher: Howling Mad Press (February 25, 2014)\nLanguage: English\nASIN: B00CGC6CP2\nFormat: EPUB\n\n\nBook 1 in the Hard Rock Harlots Series\n\nWARNING: STRINGS is not suitable for slut shamers, uptight stone throwers, Holier-Than-Thou prudes, humorless virgins, persons with chronic neck or back pain, pearl-clutching bitties, those who disparage crude humor or vulgarity in their many forms, closed-minded people with sticks up their asses, or anyone under the age of 18. The vile, base language and shocking, unholy sexual acts contained herein are not condoned by anyone with a lick of sense and should certainly not be reproduced without proper training and protection. The potty-mouthed and perpetually horny &quot;heroine&quot; (the term is used loosely) of this book does not resemble a normal, well-adjusted, or remotely believable person in any way, shape, or form. The author acknowledges that the characters in this book are shallow and two-dimensional; the plot is both ridiculous and insipid. She makes no apologies for any of it.\n\n* Readers are strongly advised to wear latex gloves whilst reading to minimize contamination risks.\n\nFree-spirited musician Letty Dillinger adheres to a strict, &quot;no strings attached&quot; policy when it comes to men. After a wild night of unabashed sex in a fancy hotel room, she never expects to see the adventurous stud she dubs &quot;Shades&quot; again. When her all-girl rock trio books a tour at the last minute as the opening act for their archenemies, Letty's shocked to discover she knows the competition's new lead singer. Intimately. Shades is no longer a one-night stand. Now he's the guy she has to one-up on stage every night for the sake of her career.\n\nSharing close quarters on a bus with her sexy nemesis and his bad-boy buddies puts Letty's Golden Rule to the test. On this tour, guitar strings aren't the only things being played. And when heartstrings are pulled too hard, they're bound to snap sooner or later.","torrent":{"xt":"urn:btih:eb11b68e7bde29adb8f1c301f985eca92d07f4c9","amp;dn":"Strings+%28Hard+Rock+Harlots+%231.0%29+-+Grey+Kendall+-+EPUB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb11b68e7bde29adb8f1c301f985eca92d07f4c9","infoHashBuffer":{"type":"Buffer","data":[235,17,182,142,123,222,41,173,184,241,195,1,249,133,236,169,45,7,244,201]},"announce":[],"urlList":[]}}