{"title":"Paul Guest - One More Theory About Happiness- A Memoir (retail).","uid":10739085,"size":569668,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eb30def335368649d70e17b656f2fff14c83ad1f&amp;dn=Paul+Guest+-+One+More+Theory+About+Happiness-+A+Memoir+%28retail%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gratefuldawg77","files":1,"time":1407727107,"description":"Paul Guest was a normal 12-year-old, fascinated with the old firecrackers his grandfather kept in a jar. He'd break them up and set fire to the rupture, creating showers of sparks. The day after he graduated from grade school, he borrowed a bicycle, lost control, and flipped it. Lying on the ground, unable to feel his body below his neck, what he thought was blood running from his nose was, in fact, spinal fluid.\n\nGuest would never again have the use of his arms or legs. Even so, he says he was lucky: &quot;If I couldn't lift my arms I could breathe. I could feel... I no longer had to be, or even could be, who I once was. What I once was. I was broken. And new.\n\nOne More Theory About Happiness is among the rarest of books: humbling, heartbreaking, and suffused with joy. Guest must learn to navigate the rest of his life in a wheelchair. An immobilizing halo is screwed into his skull. There are diapers and suctions; basic bodily functions are no longer private; the simplest daily tasks require help. Yet every agony is met with hope, each humiliation with dignity, moments of despair banished by an extraordinary capacity for gratitude. \n\nIf you've never laughed and cried at the same time, Guest's book will change that. His language is pure poetry, and his simple, amazing grace redefines that world-weary word, &quot;hero&quot;.","torrent":{"xt":"urn:btih:eb30def335368649d70e17b656f2fff14c83ad1f","amp;dn":"Paul+Guest+-+One+More+Theory+About+Happiness-+A+Memoir+%28retail%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb30def335368649d70e17b656f2fff14c83ad1f","infoHashBuffer":{"type":"Buffer","data":[235,48,222,243,53,54,134,73,215,14,23,182,86,242,255,241,76,131,173,31]},"announce":[],"urlList":[]}}