{"title":"The Manitou (1978)","uid":7040653,"size":4899352576,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:eb8f464f89bb9ada044b84729d604e3ad258fd0f&amp;dn=The+Manitou+%281978%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Odin1066","files":-1,"time":1329526039,"description":"&quot;Evil does not die... it waits... to be reborn&quot;.   Possession marked The Exorcist,...Demonic Pregnancy bore Rosemary's Baby,...Warnings followed The Omen,...well The Manitou has all those things combined! \n\nA woman named Karen (Susan Strasberg), who is suffering from a growing tumor on her neck, enters a hospital in San Francisco. After a series of X-rays, the doctors begin to think it's a living creature, a fetus being born inside the tumor. Eerie and grisly occurrences begin when the tumorous growth perceives himself to be under attack as a result of the X-rays used to ascertain its nature starting to stunt and malform its development. The growth is actually an old Indian shaman reincarnating himself through the young woman to exact his revenge on white men who invaded North America and exterminated its native peoples. A Native American shaman is contacted and hired to help fight the reincarnating medicine man, but the kind of spirits he can summon and control appear to be too weak to match his opponent. \nThe Manitou is based on a 1975 book by Graham Masterton which was inspired by the old legend about the Native American spirit-concept Manitou. \n\nDirected by William Girdler \nProduced by Herman Weist, Melvin Simon, William Girdler &amp; Jon Cedar \nWritten by Graham Masterton(novel), Jon Cedar, Thomas Pope &amp; William Girdler \n\nStarring: Tony Curtis, Susan Strasberg, Stella Stevens, Jon Cedar, Ann Sothern, Burgess Meredith, Michael Ansara,Paul Mantee &amp; Jeanette Nolan \nMusic by Lalo Schifrin \nCinematography Michel Hugo \nEditing by Bub Asman \nDistributed by Avco Embassy Pictures \nRelease date(s) 1978 \nRunning time 104 minutes \nCountry Canada / U.S.A. \n \nThe Manitou has been given countless scathing reviews over the years thanks to many thinking the story is meant to be taken seriously. But is it? It was made after The Exorcist, The Omen, Rosemary's Baby, Poltergeist, The Sentinel, etc had all been seen. I think The Manitou is clearly having fun with such human folly and deserves not to be forgotten for doing so. Unfortunately this is a pan &amp; scan version where you only see the theatrical aspect ratio with the opening &amp; closing credits but it's still quite entertaining....and that despite the hideous fashion, home decor, music, etc of late 1970's Western Civilization which it also preserves for posterity. I made some adjustments to the picture and soundtrack with Sony Vegas Movie Studio as I made this mpeg2 file.\n\n\nVideo:  4.56GB 720x480.mpg, NTSC 29 fps\nAudio:  2 channel Stereo 49kHz","torrent":{"xt":"urn:btih:eb8f464f89bb9ada044b84729d604e3ad258fd0f","amp;dn":"The+Manitou+%281978%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb8f464f89bb9ada044b84729d604e3ad258fd0f","infoHashBuffer":{"type":"Buffer","data":[235,143,70,79,137,187,154,218,4,75,132,114,157,96,78,58,210,88,253,15]},"announce":[],"urlList":[]}}