{"title":"The Unsinkable Titanic  (Channel 4 - 2008)","uid":6572437,"size":733963355,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:eba993cb7869b8f004a523cdc87c8131bd52d402&amp;dn=The+Unsinkable+Titanic++%28Channel+4+-+2008%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"neil1966hardy","files":-1,"time":1311987195,"description":"Everyone knows that an iceberg sank 'The Unsinkable Titanic' , leaving more than 1500 people to perish in what is now known to be one of the greatest maritime disasters in history.\n\nBut this documentary argues that it was actually a long chain of events that sealed the fate of the largest liner of its day, her passengers and crew. Had just one link in that chain been missing, this historic disaster may have been averted.\n\nThe documentary draws on the latest research as well as eyewitness testimonies to reconstruct the story from the point of view of those involved, and de-bunk the many myths that have built up surrounding the ill-fated vessel.\n\nWith the benefit of materials from the wreckage, examining forensic evidence and piecing together historical records and Government transcripts, the contributory factors behind the disaster are mapped out.\n\nFeaturing interviews with a forensic scientist who analysed materials from Titanic, leading historians, and the last remaining survivor, this documentary drama charts the complicated story of a whole chain of events, each one contributing to the demise of a ship thought to be unsinkable.\n\nSince the making of this film, Millvina Dean, the last surviving passenger of the Titanic has died.\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:eba993cb7869b8f004a523cdc87c8131bd52d402","amp;dn":"The+Unsinkable+Titanic++%28Channel+4+-+2008%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eba993cb7869b8f004a523cdc87c8131bd52d402","infoHashBuffer":{"type":"Buffer","data":[235,169,147,203,120,105,184,240,4,165,35,205,200,124,129,49,189,82,212,2]},"announce":[],"urlList":[]}}