{"title":"DJ_Starscream-The_New_Leader-2006-DELTA","uid":3932045,"size":47893912,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ef642cd885327b338f1aae800adae8fa48177f97&amp;dn=DJ_Starscream-The_New_Leader-2006-DELTA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"plutonium87","files":16,"time":1197542034,"description":"ARTIST: DJ Starscream\nTITLE: The New Leader\nLABEL: N20\nGENRE: Drum &amp; Bass\nBITRATE: 143kbps avg\nPLAYTIME: 0h  44min total\nRELEASE DATE: 2006-08-29\nRIP DATE: 2006-08-29\n\nTRACK LIST\n\n1. Introducing The New Leader      1:09\n2. Deadman Remix                   3:11\n3. Step To These                   3:42\n4. Sword Sharpening Remix          4:22\n5. FFwd Rew                        2:20\n6. Rough This Year                 6:07\n7. Kyukyoku &quot;Fight&quot; Remix          4:56\n8. Riot In New York Remix          4:10\n9. Twinpusher                      4:31\n10.Come On Remix                   3:48\n11.Swaying Vio-lyn                 2:30\n12.LA Head Space                   3:25\n\nRELEASE NOTES\n\nBorn Sid Wilson, 27 year old turntable virtuoso DJ Starscream traces his love of\nmusic and the DJ trade all the way back to his first heartbeats. His vast\nknowledge and appreciation of all music is attributed to his family, his own\ncuriosity of the technical aspects of his first love, and how various parts of\ndifferent music and songs could blend together. DJ Starscream listens to and\nexperiments with all varieties of music ranging from classical to metal.\n\nPunk rock was DJ Starscreams first passion to perform, playing bass and\nsaxophone in various upstart punk bands, and that passion and attitude is\nevident today in every project that he is involved with. In the studio, DJ\nStarscream is a perfectionist in every sense of the word. He is constantly\npushing himself and his music to extreme limits. Onstage, his performances are\nentrancing, not only musically but also in his own intense energy and\naggressiveness.\n\nDJ Starscream made his major public debut in 1994 with Sound Proof Coalition, a\nDJ crew based out of Des Moines, Iowa. Playing shows on the local scene as well\nas across the Midwest and U.S., DJ Starscream and the S.P.C. were, and continue\nto be major innovators in the DJ world. This 4 man crew celebrates its 10 year\nanniversary in 2004, and is still constantly working on various projects\ntogether and independently, developing new music and ideas to bring all genres\nof music together.\n\nDuring the late 90s DJ Starscream became associated with another group of\nmusicians based out of Des Moines. After checking out a few shows and practices,\nDJ Starscream assumed another identity known as #(0), of the music group\nSlipknot - a 9 man group that would go on to redefine ?metal? and be named one\nof the best live, and most intricate bands in the world. Featured on the cover\nof Rolling Stone magazine, other accomplishments include 3 Grammy nominations,\ngold and platinum record sales, as well as best selling merchandise and videos.\nDJ Starscream and Slipknot continue to recreate and expand their musical\nabilities with the much anticipated release of their third album, as well as\nmajor touring dates during the summer of 2004.\n\nDJ Starscream continues to break musical barriers with his membership in the\nnewly formed music group AMPT. Featuring eastcoast hardcore DJ Rob Gee on vocals\nand members of Biohazard, AMPT will redefine music in its own right with an\ninnovative combination of metal, hip-hop and electronica. With this musical\ncombination and background, AMPT will definitely be a force to be reckoned with,\nnow and in the future.\n\nIn addition to all of these collaborations and others, DJ Starscream continues\nto record solo projects and perform solo DJ dates at venues around the world.\n &lt;a href=&quot;\nhttp://www.djstarscream.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.djstarscream.com/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:ef642cd885327b338f1aae800adae8fa48177f97","amp;dn":"DJ_Starscream-The_New_Leader-2006-DELTA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef642cd885327b338f1aae800adae8fa48177f97","infoHashBuffer":{"type":"Buffer","data":[239,100,44,216,133,50,123,51,143,26,174,128,10,218,232,250,72,23,127,151]},"announce":[],"urlList":[]}}