{"title":"A Song Called Youth (Complete) by John Shirley (retail MOBI, EPU","uid":10782101,"size":5502383,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ef81540246dc948ca3fee4ba6e451bc77b62eb0c&amp;dn=A+Song+Called+Youth+%28Complete%29+by+John+Shirley+%28retail+MOBI%2C+EPU&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gratefuldawg77","files":5,"time":1408178493,"description":"In a near-future dystopia, a limited nuclear strike has destroyed portions of Europe, bringing the remaining nation-cities under control of the Second Alliance, a frighteningly fundamentalist international security corporation with designs on world domination. The only defense against the Alliance's creeping totalitarianism is the New Resistance, a polyglot team of rebels that includes Rick Rickenharp, a retro-rocker whose artistic and political sensibilities intertwine, and John Swenson, a mole who has infiltrated the Alliance. As the fight continues and years progress, so does the technology and brutality of the Alliance... but ordinary people like the damaged visionary Smoke, Claire Rimpler on FirStep, and Dance Torrence and his fellow urban warriors on Earth are bound together by the truth and a single purpose: to keep the darkness from becoming humankind's Total Eclipse - or die trying John Shirley was cyberpunk's patient zero, first locus of the virus, certifiably virulent.&quot;-William Gibson. An omnibus of all three novels-revised by the author-of the prophetic, still frighteningly relevant cyberpunk masterpieces: Eclipse, Eclipse Penumbra, and Eclipse Corona. With an introduction by Richard Kadrey and biographical note by Bruce Sterling.","torrent":{"xt":"urn:btih:ef81540246dc948ca3fee4ba6e451bc77b62eb0c","amp;dn":"A+Song+Called+Youth+%28Complete%29+by+John+Shirley+%28retail+MOBI%2C+EPU","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef81540246dc948ca3fee4ba6e451bc77b62eb0c","infoHashBuffer":{"type":"Buffer","data":[239,129,84,2,70,220,148,140,163,254,228,186,110,69,27,199,123,98,235,12]},"announce":[],"urlList":[]}}