{"title":"Problem Solving and Program Design in C (5th Edition)","uid":5868176,"size":33260440,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ef96d6f28722dbbdbfa07b2147a603824758d141&amp;dn=Problem+Solving+and+Program+Design+in+C+%285th+Edition%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"Aquamonkey","files":1,"time":1286238696,"description":"Problem Solving and Program Design in C is one of the best-selling introductory programming textbook using the C programming language for beginning programmers. It embraces a balanced approach to program development and an introduction to ANSI C. and provides a gradual introduction to pointers and covers programming with functions early in the text. In later chapters, students learn to implement fundamental data structures such as lists, stacks, queues, and trees in a language that fosters their understanding of stack- and heap-dynamic memory allocation and programmer-controlled pointers. To enhance students learning experience it offers the right amount of pedagogical features that include end-of-section and chapter exercises, examples and case studies, syntax and program style display boxes, error discussions and end-of-chapter projects. The fifth edition has been updated to reflect current developments in the C programming language and includes a new chapter on Multiprocessing using processes and threads.","torrent":{"xt":"urn:btih:ef96d6f28722dbbdbfa07b2147a603824758d141","amp;dn":"Problem+Solving+and+Program+Design+in+C+%285th+Edition%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef96d6f28722dbbdbfa07b2147a603824758d141","infoHashBuffer":{"type":"Buffer","data":[239,150,214,242,135,34,219,189,191,160,123,33,71,166,3,130,71,88,209,65]},"announce":[],"urlList":[]}}