{"title":"R. L. Burnside - Burnside on Burnside WAV","uid":4702609,"size":560396070,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f06f5aff35e9249483ac11b55ef5f339ffc6c87d&amp;dn=R.+L.+Burnside+-+Burnside+on+Burnside+WAV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":13,"time":1233766381,"description":"BURNSIDE ON BURNSIDE was nominated for the 2003 Grammy Awards for Best Traditional Blues Album.\n\nMississippi blues guitarist/singer R.L. Burnside is simply a force of nature. His raw, driving style seems as effortless as it is infectious. ...    Full DescriptionHere, he's captured in his most effective format--live performance. Accompanied only by grandson Cedric Burnside on drums and disciple Kenny Brown on second guitar, R.L. tears the house down with his stomping, literally and figuratively electric sound. The band's M.O. is to set up a minimal, hypnotic groove, whether fast and furious or insinuatingly slow, and gloriously pound out variations on it until the audience is whipped up into a frenzy. While completely avoiding flash, the trio wrings so much life and energy out of the tunes that it's hard to believe there aren't at least twice as many people on stage. Even R.L.'s two-song solo spot, punctuated by one of his famous shaggy-dog stories, is full of intensity. What could be a better way to hear quite possibly the greatest bluesman of his era than in a live concert?\n\nRecorded live at Crystal Ballroom, Portland, Oregon and Great American Music Hall, San Francisco, California on January 21 &amp; 24, 2001.","torrent":{"xt":"urn:btih:f06f5aff35e9249483ac11b55ef5f339ffc6c87d","amp;dn":"R.+L.+Burnside+-+Burnside+on+Burnside+WAV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f06f5aff35e9249483ac11b55ef5f339ffc6c87d","infoHashBuffer":{"type":"Buffer","data":[240,111,90,255,53,233,36,148,131,172,17,181,94,245,243,57,255,198,200,125]},"announce":[],"urlList":[]}}