{"title":"[FemaleAgent] Barra Brass &amp; Jayden (f1290 / 02.24.2015)","uid":11719566,"size":670952131,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:f07863840a7e7ca353f047f28bbfae52813d521d&amp;dn=%5BFemaleAgent%5D+Barra+Brass+%26amp%3B+Jayden+%28f1290+%2F+02.24.2015%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"chkm8te","files":1,"time":1424764336,"description":"[FemaleAgent] Barra Brass &amp; Jayden (f1290 / 02.24.2015)\n\nJayden (30 mins). Now this was certainly a casting that I won't forget in a hurry and neither will this sexy stud. When he first arrived I noticed how handsome and sexy he looked and he had a very nice accent that made my pussy moisten. Then he gave me a gift of chocolates as it was Valentines day recently. This guy was fast ensuring that I would have his cock down my throat within minutes, I'd never been given a gift during a casting interview before. Then he told me a very sad tale of how he used to be a professional football player, but a woman broke his heart and he no longer had the passion for his job so he turned to looking for modelling work instead. Such a sad tale made my heart melt and I was determined to make this stud happy before he left my office. I went over and sat on his lap and told him I could offer him some underwear modelling work which seemed to cheer him up. Then I took him over to the couch and told him how I knew exactly what would make him happy. His eyes lit up as I slowly stripped down to my sexy underwear as he realised exactly how I was going to cure his blues. I pulled his cock out and slowly drew it into my mouth. He moaned with pleasure as I worked my mouth around his cock, before he put me on my back and began to lick my pussy. Things got very steamy and passionate as we explored each others bodies with horny hands and mouths, it was fast approaching the moment where I needed this studs cock inside my tight pussy. I was hoping for a good fuck and he certainly didn't disappoint as he fucked me to orgasm in a variety of positions. His cock felt amazing as it stretched my pussy out and after I had cum several times I wanted to see this studs cum fly out of his cock. I began to wank him off, my hand beating his cock like I was whisking some eggs. It was all too much for the stud and he took over wanking his dick until he shot his load. Now I have seen some cumshots in my time here as female agent, but this one didn't seem to end. He kept firing ropes and ropes of man jam all over my couch and face and I began to think we would be here all day as his orgasm seemed to go on forever. But his balls eventually drained and I sent him off to the shower, felling very satisfied and happy to have turned his frown upside down.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=65b5sakxz82lal8mkgh2.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=65b5sakxz82lal8mkgh2.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=9sdxz9ok6h98b3h5inxi.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=9sdxz9ok6h98b3h5inxi.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:f07863840a7e7ca353f047f28bbfae52813d521d","amp;dn":"%5BFemaleAgent%5D+Barra+Brass+%26amp%3B+Jayden+%28f1290+%2F+02.24.2015%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f07863840a7e7ca353f047f28bbfae52813d521d","infoHashBuffer":{"type":"Buffer","data":[240,120,99,132,10,126,124,163,83,240,71,242,139,191,174,82,129,61,82,29]},"announce":[],"urlList":[]}}