{"title":"Sting - If on a Winter's Night...","uid":6050194,"size":332289463,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f09dc30b1421bd367c4b83e49d71df11d5f884c1&amp;dn=Sting+-+If+on+a+Winter%5C%27s+Night...&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ddawg","files":-1,"time":1292697114,"description":" &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/511%2Bc6Olt2L.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/511%2Bc6Olt2L.jpg&lt;/a&gt;\n\n\nTitle: If on a Winter's Night...\nArtist: Sting\nAudio CD (October 26, 2009) \nOriginal Release Date: 2009 \nNumber of Discs: 1 \nGenre: Christmas\nFormat: Free Lossless Audio Codec\n\n\nTrack Listing:\n\n01. Gabriel's Message\n02. Soul Cake\n03. There is No Rose of Such Virtue\n04. The Snow it Melts the Soonest\n05. Christmas at Sea\n06. Lo How a Rose E'er Blooming\n07. Cold Song\n08. The Burning Babe\n09. Now Winter Comes Slowly\n10. The Hounds of Winter\n11. Balulalow\n12. Cherry Tree Carol\n13. Lullaby for an Anxious Child\n14. Hurdy Gurdy Man\n15. You Only Cross My Mind in Winter\n\n\nAmazon Description:\nIf on a Winter's Night presents an arc of songs that conjure the season of spirits, the eerie silences of the snow; days of solitude and reflection for some, a time of re--birth and celebration for many. With traditional music of the British Isles as their starting point, Sting and his guest musicians draw the listener in through a collection of songs, carols, and lullabies spanning the centuries -- such as The Snow it Melts the Soonest (traditional Newcastle ballad), Soul Cake (traditional English &quot;begging&quot; song) Gabriel's Message (14th century carol), as well as two of Sting's own compositions -- Lullaby for an Anxious Child and The Hounds of Winter. Also featured on the album is Hurdy Gurdy Man -- a musical reworking and English translation (by Sting) of Der Leiermann from Schubert's classic winter song--cycle Winterreise. For this exploration of the themes and emotions of winter Sting is joined by friend and long time colleague, guitarist Dominic Miller -- and an ensemble of three remarkable musicians from Northern England and Scotland: Kathryn Tickell (fiddle and Northumbrian pipes) Julian Sutton (melodian) and Mary MacMaster (metal string Scottish harp). Additional guest artists include Vincent SÃƒÂ©gal (cello), Daniel Hope (violin), Chris Botti (trumpet), Ibrahim Maalouf (trumpet), Stile Antico (vocal ensemble), Cyro Baptista (percussion), Bijan Chemirani (percussion) and the Webb Sisters (vocals). Together they've created an album with a wonderful, warm, and unique ensemble sound -- an acoustic meditation on winter. \n\nAllmusic Review:\nIt's no secret that Sting is a serious man, so it's only logical that his holiday album -- his first new music since the Police reunion, not that it really matters -- is a serious endeavor, thank you. No niceties for him, no comforts of carols; he favors formal over familiar, writing madrigals, not ditties. It is music made by someone who lives in a castle, which isn't necessarily such a bad thing: the austerity is genuine, not affected, and the cerebral nature of the album is fascinating, albeit mildly so, as this is as sleepy as it is thoughtful. And it's that thoughtfulness that does distinguish If on a Winter's Night...; no other Christmas album exists in the head like this. It's a holiday album for people who have never wanted to hear a holiday album, let alone own one. \n \n","torrent":{"xt":"urn:btih:f09dc30b1421bd367c4b83e49d71df11d5f884c1","amp;dn":"Sting+-+If+on+a+Winter%5C%27s+Night...","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f09dc30b1421bd367c4b83e49d71df11d5f884c1","infoHashBuffer":{"type":"Buffer","data":[240,157,195,11,20,33,189,54,124,75,131,228,157,113,223,17,213,248,132,193]},"announce":[],"urlList":[]}}