{"title":"Joomla!: Visual QuickStart Guide","uid":6547605,"size":13903701,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f134d6500fc7e78f083c82ad8be7622642a42809&amp;dn=Joomla%21%3A+Visual+QuickStart+Guide&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TheBookie","files":-1,"time":1310934488,"description":"Joomla!: Visual QuickStart Guide\n\nBuilding on the first edition of Joomla!: Visual QuickStart Guide, this task-based guide is the perfect tool for those just starting with Joomla, as well as, seasoned professionals who want to know how to use the latest version of the software to its fullest. It shows how to create, customize, and maintain a dynamic Joomla 1.6 website starting with fundamental concepts for using Joomla and then walks the user through every function of the system. It details the requirements for operating a secure and efficient Joomla website, including server configuration and website planning.\n\nThe reader learns not only the functions of Joomla, such as adding content and structure, creating menus, using components, modules, plug-ins, and templates, but also how each function integrates as a whole. Each chapter ends with increasingly advanced topics, such as installation and configuration of the administrative back end, using 3rd-party extensions to create a portfolio, a blog, an e-commerce site, magazine, or news portal, as well as, how to use content construction kits, create custom templates, and integrate social media.\n\nNew features covered in this edition include: how to use the redesigned admin interface; new menu systems, including advanced functions for developers; how to use the category-article structure of content; the ability for users to create their own groups and assign access control levels; and control and customization of templates.\n\n","torrent":{"xt":"urn:btih:f134d6500fc7e78f083c82ad8be7622642a42809","amp;dn":"Joomla%21%3A+Visual+QuickStart+Guide","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f134d6500fc7e78f083c82ad8be7622642a42809","infoHashBuffer":{"type":"Buffer","data":[241,52,214,80,15,199,231,143,8,60,130,173,139,231,98,38,66,164,40,9]},"announce":[],"urlList":[]}}