{"title":"Encyclopdia of Mongolia and the Mongol Empire -Atwood- PDF [Slen","uid":9068950,"size":7742583,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f14b55d91e1c26a6a32d046f049f46bfbab4e875&amp;dn=Encyclopdia+of+Mongolia+and+the+Mongol+Empire+-Atwood-+PDF+%5BSlen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"K-Slender","files":3,"time":1382156922,"description":"Publisher: Facts on File (July 1, 2004)\nLanguage: English\nISBN-10: 0816046719\nISBN-13: 978-0816046713\n\n&quot;While most students of world history know of the Mongol Empire created by Chinggis (Genghis) Khan, Mongolia, a country with a long and complex history, remains a bit of a cipher. This detailed account of Mongolian history from 209 B.C.E. to 2003 C.E. does much to fill in the lacuna. Though there is special emphasis on the thirteenth and fourteenth centuries, the time of the expansion of the Mongol Empire, coverage is good for all time periods, and the encyclopedia as a whole makes a sound case for the enormous influence of Mongolian civilization on the history of the Far East, the Indian subcontinent, and Eastern Europe.\n\nThe introduction includes a guide to pronunciation, a real necessity. The approximately 1,800 alphabetically arranged entries are well weighted, with longer articles, for example, that on Chinggis Khan, extending for over five pages and shorter entries (e.g., Falconry) rating less than a column. Seventeen maps and 78 black-and-white illustrations are well placed and serve to extend and clarify the text. Suggestions for further reading are given at the end of entries for which important works exist. Most entries have see also lists appended as well. The volume ends with a list of rulers and leaders of Mongolia and the Mongol Empire; a detailed chronology of events from 209 B.C.E. to 2003 C.E.; a general bibliography; and a comprehensive, accurate index.\n\nAuthor Atwood, a professor of Mongolian history at Indiana University, clearly knows his material. Communicating it all accessibly is challenging, however, and many entries will be best understood by those with significant background in the culture and social structure. Given this, the encyclopedia is best suited for general university and college collections where it will find use by students of world history.&quot; ","torrent":{"xt":"urn:btih:f14b55d91e1c26a6a32d046f049f46bfbab4e875","amp;dn":"Encyclopdia+of+Mongolia+and+the+Mongol+Empire+-Atwood-+PDF+%5BSlen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f14b55d91e1c26a6a32d046f049f46bfbab4e875","infoHashBuffer":{"type":"Buffer","data":[241,75,85,217,30,28,38,166,163,45,4,111,4,159,70,191,186,180,232,117]},"announce":[],"urlList":[]}}