{"title":"Led Zeppelin - Travelling Riverside Blues [1969].mpg","uid":5444241,"size":104808452,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f175c3e028f4c39b9454e08ef222a22897761a95&amp;dn=Led+Zeppelin+-+Travelling+Riverside+Blues+%5B1969%5D.mpg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"claudeq","files":-1,"time":1268967430,"description":"English rock band Led Zeppelin's version of this song was recorded at the BBC studios in Aeolian Hall on June 24, 1969, by engineer John Waters, which took place during the band's UK Tour of Summer 1969. Jimmy Page dubbed extra guitar tracks onto the track, and it was broadcast four days later on John Peel's Top Gear show under the title &quot;Travelling Riverside Blues '69&quot;, and repeated on January 11, 1970.\n\nIt is quite different from the original, and it is more a tribute to Robert Johnson than a straight cover. The song showcases a riff by Page (also in open G tuning), and in the lyrics Robert Plant quotes many Robert Johnson songs, such as &quot;She studies evil all the time&quot;, from &quot;Kind Hearted Woman Blues&quot;, and &quot;Why don't you come on in my kitchen&quot;, from &quot;Come on in My Kitchen&quot; (which is heard during the song's solo). Conversely, parts of Johnson's &quot;Travelling Riverside Blues&quot; are used as lyrics in Led Zeppelin's &quot;The Lemon Song&quot;, namely the &quot;squeeze my lemon&quot; sequence. It is likely that Johnson borrowed this himself, from a song recorded in the same year (1937) called &quot;She Squeezed My Lemon&quot;, by Roosevelt Sykes.[2] The line &quot;she got a mortgage on my body, got a lien on my soul&quot; and reference to &quot;front teeth lined with gold&quot; at the end of the song are also from Johnson's original.\n\n&quot;Travelling Riverside Blues&quot; can be found on the Led Zeppelin BBC Sessions album, on disc 1 of the Led Zeppelin Box Set, and on the expanded Coda album from The Complete Studio Recordings box set. It was interest from US radio interviewers and fans during Page's Outrider tour that originally led him to negotiate with BBC Enterprises for the song's release. A promotional video clip was also released in 1990, with outtake footage from the band's 1976 concert film, The Song Remains the Same inter-spliced with other footage from the band's archive. The clip also features a railroad montage, and underwater shots of the Mississippi River. The song reached number seven on the Billboard Top Rock Tracks Top 50 chart in November 1990, culled from national album rock radio airplay reports.","torrent":{"xt":"urn:btih:f175c3e028f4c39b9454e08ef222a22897761a95","amp;dn":"Led+Zeppelin+-+Travelling+Riverside+Blues+%5B1969%5D.mpg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f175c3e028f4c39b9454e08ef222a22897761a95","infoHashBuffer":{"type":"Buffer","data":[241,117,195,224,40,244,195,155,148,84,224,142,242,34,162,40,151,118,26,149]},"announce":[],"urlList":[]}}