{"title":"Staying Alive - Real Poems for Unreal Times (Neil Astley, ed.)(p","uid":8291980,"size":3622010,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f19f7b7d64bc4fb3df8617584247413ad5c6ba95&amp;dn=Staying+Alive+-+Real+Poems+for+Unreal+Times+%28Neil+Astley%2C+ed.%29%28p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmakate","files":-1,"time":1364065973,"description":"Staying Alive: Real Poems for Unreal Times (Neil Astley, ed.)(BloodAxe Books, 2002). 496 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\nNot your usual poetry anthology! This is a very special book - give it a try.\n\ndescription:\n\nStaying Alive is an international anthology of 500 life-affirming poems fired by belief in the human and the spiritual at a time when much in the world feels unreal, inhuman and hollow. These are poems of great personal force connecting our aspirations with our humanity, helping us stay alive to the world and stay true to ourselves. Many people turn to poetry only at unreal times, whether for consolation in loss or affirmation in love, or when facing other extremes and anxieties. Staying Alive includes many of the great modern love poems and elegies, but it also shows the power of poetry in celebrating the ordinary miracle, taking you on a journey around many of the different aspects of everyday life explored in poems. A strong poem is not just for crisis. Such a poem is there for all times, helping us face or embrace daily change and disruption. It will also speak to us when nothing seems to be happening, when the poem's importance is in helping us stay alive to the world and stay true to ourselves. Staying Alive has reached a wider readership than any other anthology of contemporary poetry. It is a landmark in the history of literary publishing. A sequel, Being Alive (2004), and a companion anthology, Being Human (2011), complete this poetry &quot;trilogy&quot;.","torrent":{"xt":"urn:btih:f19f7b7d64bc4fb3df8617584247413ad5c6ba95","amp;dn":"Staying+Alive+-+Real+Poems+for+Unreal+Times+%28Neil+Astley%2C+ed.%29%28p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f19f7b7d64bc4fb3df8617584247413ad5c6ba95","infoHashBuffer":{"type":"Buffer","data":[241,159,123,125,100,188,79,179,223,134,23,88,66,71,65,58,213,198,186,149]},"announce":[],"urlList":[]}}