{"title":"Lester Young - 1956 - In Washington D. C. FLAC","uid":9236883,"size":903755746,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f1f9b828aa42e751b7c2f34857fcb9eaff6b26fa&amp;dn=Lester+Young+-+1956+-+In+Washington+D.+C.+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eika256","files":-1,"time":1385192969,"description":"Lester Young - in Washington, D.C., 1956, Vol. 1-5\n\nVol. 1 - One of the great myths of jazz history is that by the final decade of his life, Lester Young was a burnout case, too drunk to stand up and play his horn, much less attain the creative flights of fancy that marked his groundbreaking work with Count Basie in the late '30s. But when these live recordings of Young playing with the Bill Potts Trio in Washington, D.C., were first released on LP in 1980, the jazz world had to re-evaluate its thinking. These privately recorded tapes revealed that not only was Prez far from being a broken shadow of his former self, he was blowing his heart out, obviously inspired by the playing of the trio behind him and the relaxed setting of the date itself. Kicking off with an uptempo take on &quot;A Foggy Day,&quot; Young shows he's in full command of his chops, and the trio backs him buoyantly. Of the seven selections on this disc, Young contributes two blues of his own derivation, along with great readings of &quot;When You're Smiling&quot; and &quot;Tea for Two,&quot; as well as a version of &quot;I Can't Get Started with You&quot; that rivals the live version cut as a member of the Jazz at the Philharmonic troupe in 1946. Those who dismiss his later work as uninspired will find this disc a revelation and a wonderful addition to his legacy. \nVol. 2 - The second installment of four projected volumes, this once again captures latter-day Lester Young in top form, relaxed and playing with impeccable phrasing and swing. Ably backed by the Bill Potts Trio during his week-long stand at Olivia's Patio Lounge in Washington, these live tapes put the lie to the longstanding jazz myth that Young was well past his prime in the final decade of his life.\nIf anything, this second volume captures even more adventurous playing by Prez, with fast paced takes on his &quot;Jumpin' With Symphony Sid&quot; and &quot;Lester Leaps In.&quot; But, as always, Young positively shines on midtempo and ballad material like &quot;Three Little Words,&quot; &quot;I'm Confessin' (That I Love You),&quot; &quot;These Foolish Things&quot; and &quot;Almost Like Being In Love.&quot; Lester shares much of the soloing space with all three members of the trio, and his swapping of four-bar phrases with drummer Jim Lucht can get a little wearing on repeated listens, but the group provides such a comfortable cushion for him to relax and stretch out that it's a minor niggle at best. This also includes Young's only known full-length treatment of &quot;Lullaby of Birdland,&quot; almost worth the price of admission alone. Nobody could swing like Lester Young, and given the right setting and circumstances like he was on these dates, he was evidently swinging right to the end.\nVol. 3 - This third volume furthers explores the marvelous cache of tapes that have surfaced from Lester Young's 1956 engagement at Olivia's Patio Lounge in Washington, D.C. With the swinging but unobtrusive Bill Potts Trio, he provides the same empathetic support heard on the other volumes in this set, always playing the right changes without overt bop embellishments just for the sake of embroidery. Potts soloing is always in the pocket and his comping behind drummer Jim Lucht and bassist Norman Williams is equally fine and telling in what it leaves out. By laying down a simple beat with simple chord changes, you can actually hear Prez loosen up with each chorus, digging in and finding fresh ideas even in tunes that he had played hundreds of times over. This volume features swinging, finger-snapping versions of &quot;Just You, Just Me,&quot; &quot;Sometimes I'm Happy,&quot; and the bluesy &quot;G's, If You Please,&quot; which sports the same intro as &quot;Up 'n' Adam&quot; until Lester comes in and starts taking it into new territory. A blazingly fast take of &quot;Indiana&quot; rounds out this excellent package. \nVol. 4 - The final volume of this four-volume chronicling of Prez' stand at Olivia's Patio Lounge in 1956 is no less fine than its preceding three volumes. Everything here is stretched out to a comfortable length, everybody is taking their time, giving the music plenty of room to breathe and most importantly, giving Young all the time he needs to get deep inside the music itself. Nice readings of the ballad &quot;I Cover the Waterfront,&quot; &quot;Talk of the Town&quot; and a swinging &quot;Pennies from Heaven&quot; are the big tickets here, imbued with an economy from Bill Potts' Trio that perfectly frames Young's flights of fancy. Fine alternate performances of &quot;I'm Confessin' That I Love You,&quot; &quot;Almost Like Being In Love,&quot; &quot;G's, If You Please&quot; and &quot;D.B. Blues&quot; (Lester's blues with a bridge that King Pleasure put words to) complete the set, a series that every jazz fan should have in their collection and one that no Lester Young fan can afford to be without. \nVol. 5 - While many critics have written off Lester Young's recordings from his last years leading up to his death in 1959, this previously unissued collection of material recorded at Olivia's Patio Lounge in Washington, D.C. in December, 1956 proves that he was still very much in command. Joined by a local rhythm section consisting of pianist Bill Potts, bassist Norman Williams and drummer Jim Lucht, the tenor saxophonist is still swinging mightily and in full control of his chops. There aren't really any surprises among the selections, which draw from Young's favorite standards and a few of his most requested compositions. Trombonist Earl Swope, a sideman with Woody Herman, is an added guest on the last four selections, providing an excellent foil for Young. Potts' foresight in recording this extended gig, in spite of Young's exclusive contract with Norman Granz's Verve label, was validated when Granz eventually issued the material on his Pablo label. But even though the fourth volume was supposedly the last (according to Granz's reproduced liner notes), evidently this final collection of material was uncovered after he sold Pablo to Fantasy and it saw the light of day for the first time in 1998. (AllMusic)\n\nTrack list:\nVol. 1 (1993):\n01 - A Foggy Day\n02 - When You're Smiling\n03 - I Can't Get Started\n04 - Fast B-Flat Blues\n05 - D.B. Blues\n06 - Tea For Two\n07 - Jeepers Creepers\nVol. 2 (1996):\n01 - Lester Leaps In\n02 - These Foolish Things (Remind Me Of You)\n03 - I'm Confessin' (That I Love You)\n04 - Three Little Words\n05 - Jumpin' With Symphony Sid\n06 - Almost Like Being In Love\n07 - Lullabye of Birdland\nVol. 3 (1996):\n01 - Just You, Just Me\n02 - Sometimes I'm Happy\n03 - Indiana (Back Home Again In)\n04 - Up'n Adam\n05 - There Will Never Be Another You\n06 - G's, If You Please\nVol. 4 (1998):\n01 - Talke Of The Town\n02 - I Cover The Waterfront\n03 - Pennies From Heaven\n04 - G'S, If You Please\n05 - Almost Like Being In Love\n06 - I'M Confessin' That I Love\n07 - D.B. Blues\nVol. 5 (1998):\n01 - D.B. Blues\n02 - Three Little Words\n03 - Pennies From Heaven\n04 - When You're Smiling (The Whole World Smiles With You)\n05 - Oh Lady, Be Good\n06 - Up 'n' Adam\n07 - Jumpin' With Symphony Sid\n08 - Lullaby of Birdland\n\nEnjoy and share!","torrent":{"xt":"urn:btih:f1f9b828aa42e751b7c2f34857fcb9eaff6b26fa","amp;dn":"Lester+Young+-+1956+-+In+Washington+D.+C.+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1f9b828aa42e751b7c2f34857fcb9eaff6b26fa","infoHashBuffer":{"type":"Buffer","data":[241,249,184,40,170,66,231,81,183,194,243,72,87,252,185,234,255,107,38,250]},"announce":[],"urlList":[]}}