{"title":"Gods Collection - Paul Oakenfold","uid":8394901,"size":830983372,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f227f902ba700bd77c1cd656f6f15797bcf10299&amp;dn=Gods+Collection+-+Paul+Oakenfold&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Fluffeh","files":6,"time":1366540975,"description":"This is part of my Gods Collection, basically a set of files that are from superstars of the Trance, Techno and generally Rave scene. The names that really get people to fork out for the tickets. Putting together collections of old or rare sets from around the world. While one of two of these are already on the site, I really think putting them together by artist like this will make for some torrents that hang around for a long time. The bitrate shown in the header is probably an average, these are from many sources over many years. (The Full Moon Goa I have managed to track down in 320 though - well worth it).\n\nPaul Oakenfold. Let me say that again. Paul Oakenfold. By now, you have probably licked your lips or swallowed indicating a heightened level of excitement, quite possibly let out a little gleeful YUS! or found that your mouse moved too quickly with excitement. If you haven't done any of those, and aren't sure who Paul Oakenfold is you have two options. Hand in your Dance/Rave/Trance badge and walk away in shame, or blag this pack, sit back and be utterly amazed. The sweet, tranquil yet uplifting sounds of Oakenfold await your sensory pleasures.\n\nFirst off, let me start with the fact that Paul started DJ'ing in 1979. That's probably before you were born. He actually started playing music before that, but major bigtime dance recognition came with Perfecto Records. If you haven't heard of Fluoro (it's 1996, I can sympathize if you haven't) then do yourself a treat - it still plays just as good today as it did the day it was released. While there are many other great albums and releases, I think it wise to change it up a bit and list some of the other things he has worked on: Film music for Californication, The Heavy, Fever, The Bourne Identity, and Speed Racer. He has toured with Madonna opening her two hour show with a one and a half hour set of his own!\n\nYou should also check out the amazing, fantastic, I can't believe it's not butter Urban Soundtracks (http://thepiratebay.se/torrent/8332121/) which is about 60 hours of listening bliss. BLISS!\n\nEnough said, lets get to the (almost) nine hours of fine goodies.\n\nPaul Oakenfold - Live @ Full Moon Goa Party - 19941218.mp3\nPaul Oakenfold - Live @ Godskitchen Galaxy - 20020727.mp3\nPaul Oakenfold - Live @ Godskitchen New Years Eve - 20011231.mp3\nPaul Oakenfold - Live @ Home In London - 19991031.mp3\nPaul Oakenfold - Live @ Shadow Lounge in Miami.mp3","torrent":{"xt":"urn:btih:f227f902ba700bd77c1cd656f6f15797bcf10299","amp;dn":"Gods+Collection+-+Paul+Oakenfold","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f227f902ba700bd77c1cd656f6f15797bcf10299","infoHashBuffer":{"type":"Buffer","data":[242,39,249,2,186,112,11,215,124,28,214,86,246,241,87,151,188,241,2,153]},"announce":[],"urlList":[]}}