{"title":"Alex Jones Show - 2012 June 17 SU [sebaygo1]","uid":7361932,"size":44383200,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:f37998db77e955a7cb52e145c7d5c72162b91fb5&amp;dn=Alex+Jones+Show+-+2012+June+17+SU+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sebaygo1","files":5,"time":1339991350,"description":".\n\t\t\t\t\t\t\t\nThe Alex Jones Show\nSunday, 17 June 2012\n\n\n[sebaygo1]\n\n\nThe 2 hour Sunday show is typically a review of the past week's news and a look forward to the coming week's events. The Infowars web site describes today's broadcast as follows.\n\nOn this Sunday, June 17 Father's Day Special edition of the Alex Jones Show, Alex talks with Ron Paul's congressional chief of staff, Lew Rockwell, about Rand Paul's endorsement of Mitt Romney. He also talks with the former Governor of Minnesota and host of the TruTV show Conspiracy Theory, Jesse Ventura, about his new book and the move toward war waged against Syria. Alex talks about the nuclear reactor beneath the LBJ Library on the University of Texas campus and nuclear waste that is said to be dumped and sealed in limestone caves located in what was once the outskirts of Austin, according to an inside source. Finally, Alex features his video covering the Global Future 2045 International Congress and the transhumanist singularity agenda. \n\nToday's broadcast consists of previously aired material.\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n..........\n\nfolder.jpg courtesy of commenter &quot;Nighted&quot; at the sebaygo1 blog\n..........\n","torrent":{"xt":"urn:btih:f37998db77e955a7cb52e145c7d5c72162b91fb5","amp;dn":"Alex+Jones+Show+-+2012+June+17+SU+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f37998db77e955a7cb52e145c7d5c72162b91fb5","infoHashBuffer":{"type":"Buffer","data":[243,121,152,219,119,233,85,167,203,82,225,69,199,213,199,33,98,185,31,181]},"announce":[],"urlList":[]}}