{"title":"HISTORY OF POP AND ROCK MUSIC - part 478","uid":8229774,"size":1209537523,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f38f37c7111744571e5867bbedde2024a0232e6a&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+478&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zlatkopupovac","files":-1,"time":1362699280,"description":"    \n\n\n                    PART 478\n\n\n            NIRVANA  -  Sliver  (1990)\n            NIRVANA  -  In Bloom (Sub-Pop Version) (1991)\n            NIRVANA  -  In Bloom  (1992)\n            NIRVANA  -  Lithium  (1992)   \n            NIRVANA  -  Come As You Are  (1992)\n            NIRVANA  -  Heart Shaped Box  (1993)\n\n     \n       &quot;Sliver&quot; was released as a single in 1990 making the top 100 in the UK. Retail singles were not re-released for &quot;Incesticide&quot;, however the song was released in the US for radio airplay and charted on the Modern Rock Tracks chart. &quot;Sliver&quot; re-charted in the UK in 1992 at number 77 on the UK singles chart at the time of its inclusion on the &quot;Incesticide&quot; compilation album. &quot;Sliver&quot; also charted in Ireland two years after release, shortly after the success of the Nevermind album in 1992 .A music video was made for &quot;Sliver&quot; as promotion for &quot;Incesticide&quot; in March 1993. Directed by Kevin Kerslake, the video starts with Kurt Cobain's daughter Frances Bean Cobain (who was an infant at the time) dancing to the opening bassline and the band in a small, cramped, junk room playing their instruments. Kurt sings to the camera and his movements change with the music, with Krist Novoselic and Dave Grohl. \n \n       Written by frontman Kurt Cobain, the song &quot;In Bloom&quot; addresses people outside of the underground music community who did not understand the band's message.  Nirvana first made a music video for &quot;In Bloom&quot; in 1990 for the Sub Pop Video Network Program VHS compilation (1991). The Sub Pop video features the band walking around various parts of lower Manhattan including the South Street Seaport, the Lower East Side, and Wall Street. While filming the video, Novoselic shaved his head as penance for a bad performance the band gave in New York City. This caused discontinuity in the final cut; shots of the band feature the bassist with and without hair throughout the video.  The second video, created to accompany the 1992 single release, was directed by Kevin Kerslake, who had previously directed the band's videos for &quot;Come as You Are&quot; and &quot;Lithium&quot;. Cobain's original concept for the video told the story of a young girl born into a Ku Klux Klan who one day realizes how evil they are. His concept was too ambitious, so Cobain instead decided to parody musical performances by bands on early 1960s variety shows, such as The Ed Sullivan Show. The humorous tone of the video was a result of Cobain being &quot;so tired for the last year of people taking us so seriously . . . I wanted to fuck off and show them that we have a humorous side to us&quot;. Kerslake filmed the video on old Kinescope cameras, and the band improvised its performance. The video begins with an unnamed variety show host (played by Doug Llewelyn, former host of The People's Court) introducing Nirvana to an in-studio crowd of screaming teenagers; their non-stop screaming is heard throughout the duration of the song. The band members, whom the host refers to as &quot;thoroughly all right and decent fellas&quot;, perform dressed in Beach Boys-style outfits; Cobain wears glasses that blurred his vision, while Novoselic cut his hair short and liked it so much he kept it that way afterwards. As the video progresses, the band destroys the set and its instruments. In 2004 Rolling Stone magazine ranked the song number 407 on its list of the &quot;500 Greatest Songs of All Time&quot;.\n\n      &quot;Lithium&quot; is a song written by Kurt Cobain. Veering between quiet verses and loud choruses, &quot;Lithium&quot; is about a man who turns to religion amid thoughts of suicide. Nirvana first recorded &quot;Lithium&quot; in 1990 with producer Butch Vig, then re-recorded the song with Vig the following year for the group's second album Nevermind (1991). Released in July 1992, &quot;Lithium&quot; peaked at number 64 on the US Billboard Hot 100 and number 11 on the UK Singles Chart. The accompanying music video, directed by Kevin Kerslake, is a montage of concert footage.\n\n     &quot;Come as You Are&quot; is a song by the American grunge band Nirvana, written by frontman Kurt Cobain and released as the second single from the band's second studio album Nevermind in 1992. It was the band's second American Top 40 hit, and second UK top 10 hit, reaching number 32 on the Billboard Hot 100, and number nine on the UK Singles Chart. The music video for &quot;Come as You Are&quot; was directed by Kevin Kerslake, who drew inspiration for it from the cover artwork of Nevermind.\n                \n   &quot;Heart-Shaped Box&quot; is a song written by vocalist and guitarist Kurt Cobain. The song was released as the first single from the group's third and final studio album, &quot;In Utero&quot;, in 1993. While Nirvana's label DGC Records did not release a physical single for sale in the United States, &quot;Heart-Shaped Box&quot; received much American radio airplay, reaching number one on the Billboard Modern Rock Tracks chart. The international release of the single reached number five on the UK Singles Chart. The song's music video, directed by Anton Corbijn, garnered critical plaudits.","torrent":{"xt":"urn:btih:f38f37c7111744571e5867bbedde2024a0232e6a","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+478","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f38f37c7111744571e5867bbedde2024a0232e6a","infoHashBuffer":{"type":"Buffer","data":[243,143,55,199,17,23,68,87,30,88,103,187,237,222,32,36,160,35,46,106]},"announce":[],"urlList":[]}}