{"title":"Isis - Oceanic [24 bit FLAC] vinyl","uid":8107916,"size":1440531924,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f3ee2f87ad1828eb06056b7c860b92ea4d0b2d8b&amp;dn=Isis+-+Oceanic+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"24.96","files":-1,"time":1360116955,"description":"Oceanic is the next logical step for Isis after the ugly, grandiose Celestial, the Aaron Turner-led outfit's second full-length looking simultaneously inward and outward, reaching into the nether regions of outer space while still keeping its feet firmly earthbound. Yes, it's an ambitious record, one that isn't immediately consumed and digested -- rather, it consumes and digests the listener with grand and hypnotic waves of sound. Songs blur together as aggressive, post-hardcore guitar riffery trades with lengthy, meditative bouts of electronic exploration, a technique that would result in plodding, pretentious mush in less capable hands. Instead, Oceanic successfully mirrors the dense, unimaginable power of its namesake, combining the minimalist metallic art of Godflesh with the bipolar mood swings and Black Sabbath muscle of West Coast brethren Neurosis. Turner's deathcore growl-shouts serve to puncture the instrumental tension that balloons slowly and painstakingly inflates throughout the album's 63 minutes, with ex-Dirt Merchants singer Maria Christopher occasionally drifting hazily into the arrangements. &quot;Weight,&quot; at nearly 11 minutes, doesn't necessarily move as much as it evolves toward its goal, starting with lazy, but purposeful, melodic whale songs before logically concluding with Christopher's repetitive dub vocal and a droning organ suggesting spiritual rebirth. Only Isis could get away with writing hardcore hymns about the inevitability of elemental forces and pull it off with such conviction and attention to detail. The album may initially seem to exist in hazy head space, but clarity comes with further submergence, assuming you're willing to lay back and float, letting the water take you into both conscious and subconscious realms. Oceanic is a masterfully complex symphony of majestic noise and melody, an all-consuming trip into the earth and mind that defies genre and, often, description -- simply put, a triumph.","torrent":{"xt":"urn:btih:f3ee2f87ad1828eb06056b7c860b92ea4d0b2d8b","amp;dn":"Isis+-+Oceanic+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3ee2f87ad1828eb06056b7c860b92ea4d0b2d8b","infoHashBuffer":{"type":"Buffer","data":[243,238,47,135,173,24,40,235,6,5,107,124,134,11,146,234,77,11,45,139]},"announce":[],"urlList":[]}}