{"title":"FantasyMassage - Kimmy Granger (Just Relax, Sir) NEW 21 Septembe","uid":15872399,"size":424974067,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:f429f4c4699997e6147ce47d387a9494949317c1&amp;dn=FantasyMassage+-+Kimmy+Granger+%28Just+Relax%2C+Sir%29+NEW+21+Septembe&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"xxxlavalxxx","files":2,"time":1474451151,"description":"First Timer, Tyler Nixon finds himself overthinking his reasoning for coming by the Spa today. Just as he's about to leave, the gorgeous, Kimmy Granger arrives introducing herself as his masseuse. She assures him, his first time with her, will definitely be a memorable experience.This doesn't seem to settle his nerves, however he decides to undress and let Kimmy do what she does best. Once Tyler is naked and wrapped in a towel, Kimmy gets to work, rubbing the oil in between her hands getting them nice and wet, as she gently glides them up and down Tyler's body. Kimmy seems to struggle with the massage, once Tyler flips over, as his boxers keep getting in the way of her eager hands. After a few moments of apprehension, Tyler removes them and no sooner has Kimmy climbed up onto the massage table does she begin stroking his hard, cock. As he lathers it with oil, Kimmy slowly, strips off her red, silk robe to reveal a matching set of red lingerie. Suddenly Tyler's nerves have subsided as he traces kisses up and down Kimmy's tight body. Stopping to suck on her tits while stroking her pussy. Kimmy quickly learns throughout the massage how skilled Tyler is as she rides him from behind while he eats her pussy, cumming into his mouth as she moans with pleasure. Leading her to believe, that sometimes the quietest clients are the ones who pleasure the best....\r\nCategories Oil, Pussy Licking, FaceSitting, Brunette, Body Massage, Handjob, Blowjob, 69, Cum in Mouth, Hardcore, Natural Tits, Ball Licking, Massage, Ass, College, Cunilingus, HD Porn, Big Dick, Lingerie, Member Fantasy\r\n \nhttp://imgdone.com/viewer.php?file=18135561461506208295.jpg\r\n \nhttp://imgdone.com/viewer.php?file=66068795786625597984.jpg","torrent":{"xt":"urn:btih:f429f4c4699997e6147ce47d387a9494949317c1","amp;dn":"FantasyMassage+-+Kimmy+Granger+%28Just+Relax%2C+Sir%29+NEW+21+Septembe","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f429f4c4699997e6147ce47d387a9494949317c1","infoHashBuffer":{"type":"Buffer","data":[244,41,244,196,105,153,151,230,20,124,228,125,56,122,148,148,148,147,23,193]},"announce":[],"urlList":[]}}