{"title":"Electric Boys - FreewheelinÂ´ (1994) @256kbps","uid":3521678,"size":87553475,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f46868ff20c39aec5c2c67d9f7553177a0311510&amp;dn=Electric+Boys+-+Freewheelin%C2%B4+%281994%29+%40256kbps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"graywolf","files":16,"time":1157838432,"description":"The Electric Boys are a funk metal band founded in Sweden in 1988, which enjoyed a cult status in Europe at the end of the decade.\n\nThey were formed by Conny Bloom (real surname Blomqvist) (guitar/vocals) and Andy Christell (bass). Originally a duo, they signed for Polygram and scored a local Swedish hit with single ALL LIPS N HIPS then added second guitarist Franco Santunione and drummer Nicholas Sigevall.\n\nIn 1989 debut album Funk-O-Metal Carpet Ride was a success in Europe, and they picked up a strong following in Britain, where as well as headlining small clubs they supported Thunder. However follow-up album Groovus Maximus did not emerge until 1992, by which time grunge had swept all before it and the album was overall inferior to the debut. By the end of an American tour to promote it supporting Mr. Big, the band had lost Santunione and Sigevall and both North American and European record deals. Outgoing members were replaced by Thomas Bromann (drums) and Martin Thomander (2nd guitar) and this lineup released the band&amp;#039;s third album, Freewheelin&amp;#039; on the Music For Nations label in Britain. The album attracted little interest and the band dissolved. In 2005, founders Bloom and Christell had joined Hanoi Rocks.","torrent":{"xt":"urn:btih:f46868ff20c39aec5c2c67d9f7553177a0311510","amp;dn":"Electric+Boys+-+Freewheelin%C2%B4+%281994%29+%40256kbps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f46868ff20c39aec5c2c67d9f7553177a0311510","infoHashBuffer":{"type":"Buffer","data":[244,104,104,255,32,195,154,236,92,44,103,217,247,85,49,119,160,49,21,16]},"announce":[],"urlList":[]}}