{"title":"Waco Brothers - Freedom and Weep [2005] [FLAC]","uid":11675539,"size":313482723,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f47c231f469aed91b6ae321f0af09c110dccbd8d&amp;dn=Waco+Brothers+-+Freedom+and+Weep+%5B2005%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":16,"time":1422845776,"description":"FLAC / Lossless / Log (100%) / Cue\nLabel/Cat#:Bloodshot #BS 119\nCountry: USA\nYear: August 16, 2005\nGenre: americana\nFormat:CD\n\n1. Nothing At All \n2. Chosen One \n3. Come a Long Long Way \n4. Secrets \n5. How Fast the Time \n6. Lincoln Town Car \n7. It's Amazing \n8. On the Sly \n9. Drinkin' &amp; Cheatin' &amp; Death \n10. Fantasy \n11. Missing Link \n12. Rest of the World \n13. Join the Club\n\nRemember back in 1995, when the Waco Brothers told us &quot;Bad Times (Are Comin' Round Again)&quot; on their first album? Who ever knew they would be so right? Maybe we all thought things looked grim under the rule of &quot;Bill the Cowboy&quot; back in the day, but six years of &quot;Dubya&quot; can go a long way towards changing someone's perspective, and kicking up your heels isn't as easy as it used to be. Jon Langford and his fellow Waco Brothers seem to know it, and Freedom and Weep, the group's seventh album, is a bit less twangy and a bit less rambunctious than the band's best work, though if you think that means the band is losing sight of their rage, you'd be wrong. Freedom and Weep is a full-bodied but bitter chronicle of living in an America that more than ever resembles Phil Ochs' description of a nation that's become &quot;two Mack trucks colliding on a superhighway because all the drivers are on amphetamines.&quot; With tougher rock, tighter performances, and a bit less mournful steel than one might expect (don't worry, it hasn't gone away, it's just less prominent), Freedom and Weep rants against working class poverty (&quot;Nothing at All&quot;), ugly Americanism (&quot;Rest of the World&quot;), conspicuous consumption (&quot;Lincoln Town Car&quot;), and the president of the United States (&quot;Chosen One&quot;), while the less polemical numbers still speak of a time and place where confusion reigns and desperation is just as real as the beer in your refrigerator. Freedom and Weep isn't quite a top-shelf Waco Brothers album, but it's an appropriate one for America in the year 2005, and if there's a good share of bitter futility in these songs, there's also a liberating rage, and if this once-great land is at the point of collapse, the Waco Brothers are here to, at the very least, see that the folks who still care go down swinging","torrent":{"xt":"urn:btih:f47c231f469aed91b6ae321f0af09c110dccbd8d","amp;dn":"Waco+Brothers+-+Freedom+and+Weep+%5B2005%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f47c231f469aed91b6ae321f0af09c110dccbd8d","infoHashBuffer":{"type":"Buffer","data":[244,124,35,31,70,154,237,145,182,174,50,31,10,240,156,17,13,204,189,141]},"announce":[],"urlList":[]}}