{"title":"Presunto Innocente [DvD5 ita][Tntvillage]","uid":5242252,"size":4030310400,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f48e61bee7cb95b610a7af9fff8655760c07d027&amp;dn=Presunto+Innocente+%5BDvD5+ita%5D%5BTntvillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"maxmalu6601","files":8,"time":1261825444,"description":"[font=Geneva]PRESUNTO INNOCENTE[/font]\n\n Visit this link: http://www.shareimmage.com/fx_images/maxmalu6601_Immagine.JPG\n\n.::.Trama del Film.::.\n\nRusty Sabich, vice procuratore capo della Contea di Kindie, viene incaricato di condurre le indagini sull'assassinio di Caroline Polhemus, sua affascinante collega, con la quale ha avuto un'appassionata relazione extraconiugale. Durante le indagini, la posizione di Sabich si fa sempre piÃƒÂ¹ precaria: Raymond Horgan, procuratore distrettuale e suo superiore, lo crede colpevole, Barbara, sua moglie, ÃƒÂ¨ assai sconvolta; il suo avvocato difensore, Alejandro Sandy Stern, nutre dubbi riguardo al caso, che viene esaminato dal giudice di colore Larren Lyttle; il suo accanito accusatore ÃƒÂ¨ un collaboratore di Horgan, il cinico Nico Della Guardia. Approfittando della sparizione di un bicchiere con le impronte digitali di Rusty e della scoperta dell'investigatore Lipranzer, dell'avvenuta corruttibilitÃƒÂ  del giudice Lyttle in un precedente processo, Stern riesce a far prosciogliere Sabich. Ormai innocente, al rientro a casa, durante l'assenza di Barbara, Rusty scopre in cantina un ascia macchiata di sangue: l'omicida ÃƒÂ¨ lei e lo confessa al marito narrandogli della propria gelosia.\nVisit the IMDB link: http://www.Imdb.com/title/tttt01004\n\nVisit thelink:\n\n\n[font=Optima]La critica[/font]\n di Giovanni Grazzini\n\nSe in Italia la giustizia funziona come funziona, non che negli Stati Uniti funzioni meglio, nÃƒÂ© c'ÃƒÂ¨ da supporre che almeno soddisfi in qualche altro paese del mondo. Ammesso si sappia cosa ÃƒÂ¨ la giustizia, sono gli uomini ad amministrarla, e gli uomini, ovunque, sono bacati. La prova piÃƒÂ¹ recente d'una lunga serie ÃƒÂ¨ data dal romanzo di Scott Turow Presunto innocente che il regista Alan J. Pakula porta sullo schermo, sceneggiato col provetto Frank Pierson. Dove si tratta, come giÃƒÂ  sanno i molti lettori di Turow, d'un vice-procuratore distrettuale (su per giÃƒÂ¹ il nostro pubblico ministero), l'avvocato Rusty Sabich, buon padre di famiglia e salvo prova contraria onest'uomo, che si trova in un grave pasticcio. Qualcuno ha ucciso una sua giovane collega, Carolyn Polhemus, e il capo dell'ufficio ha affidato a lui il caso, oltretutto da risolvere in fretta perchÃƒÂ© il capo stesso ÃƒÂ¨ in corsa per essere rieletto.\nPerchÃƒÂ© Sabich si trova nei pasticci? PerchÃƒÂ© ÃƒÂ¨ stato uno dei molti amanti di Carolyn, una carrierista senza scrupoli, e perchÃƒÂ© s'avvede presto d'essere stretto in una morsa di sospetti. Noi non sappiamo se Sabich ÃƒÂ¨ l'assassino, ma certi indizi sono inequivocabili, e il turbamento da cui ÃƒÂ¨ colto quando vede vecchie fotografie della donna o ripensa ai loro incontri segreti non depone a suo favore. La moglie Barbara, benchÃƒÂ© abbia qualche motivo per essere insoddisfatta e abbia accolto con sconforto la confessione del tradimento, ÃƒÂ¨ rimasta vicina a Sabich, e sembra disposta a credere con lui che il colpevole sia uno dell'ambiente, ma nemmeno l'avvocato difensore ÃƒÂ¨ sicuro della sua innocenza. Ormai in manette, l'uomo perde anche la fiducia del suo capo, che in aula testimonia contro di lui: tutto lascia credere che sarÃƒÂ  il capro espiatorio d'un groviglio di intrighi e di rancori dal quale egli stesso non ha la forza di districarsi. Fortuna vuole che un detective suo amico scopra qualcosa, e il giudice ne sia indotto a chiudere subito il processo, ma non per ciÃƒÂ² la veritÃƒÂ  si fa strada. ResterÃƒÂ  chiusa fra quattro mura, e ancora una volta giustizia non sarÃƒÂ  fatta...\nPresunto innocente non ha il piglio con cui Pakula affrontÃƒÂ² il caso Watergate, tre lustri fa, in Tutti gli uomini del presidente, ma l'amarezza con cui tocca le imperfezioni del sistema giudiziario americano e, alzando il tiro, il conflitto fra passione e ragione, nasce dalla stessa contemplazione del male che si annida dietro la facciata e sporca le coscienze. Con vent'anni di esperienza sulle spalle, Pakula fa d'altronde il suo mestiere di regista con esiti assolutamente onorevoli. Il film resta un film di genere, simile a molti altri thrillers giudiziari che hanno il loro nodo drammatico nelle udienze processuali, con la risaputa liturgia di domande, risposte, e obiezioni, ma lo si segue con attenzione per oltre due ore, partecipi dell'angoscia del protagonista e spinti alle piÃƒÂ¹ varie supposizioni su quanto ÃƒÂ¨ davvero successo in quella rete di menzogne e di ossessioni. La fotografia di Gordon Willis e la musica di John Williams arricchiscono la confezione, e gli attori hanno la loro parte di merito. Harrison Ford, sforzandosi d'essere credibile anche in ruoli diversi da quelli dei film d'avventura, ÃƒÂ¨ un interprete persuasivo (qui le sue corde sono l'imbarazzo e la passivitÃƒÂ ), la Barbara di Bonnie Bedelia regge con decoro una parte difficile, Brian Dennehy ÃƒÂ¨ la massiccia, efficace presenza di sempre, e Greta Scacchi, all'esordio in un film hollywoodiano, dÃƒÂ  calore ai flash-back. Applausi piÃƒÂ¹ intensi merita a parer nostro Raul Dulia, l'avvocato difensore che sarÃƒÂ  il protagonista del film tratto dal nuovo romanzo di Turow.\nDa Il Messaggero, 26 ottobre 1990 \n\n\n.::.Dati DvD.::.\n\nFormato DvD....: DvD5:\nLingue..............: Italiano \nLingue sub.......: nessuno\nCompressione...: non conosciuta\nProgramma usato: CloneDVD2\nMenu (si/no)....:  no\nExtra (si/no).....: no\n\n\n\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:f48e61bee7cb95b610a7af9fff8655760c07d027","amp;dn":"Presunto+Innocente+%5BDvD5+ita%5D%5BTntvillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f48e61bee7cb95b610a7af9fff8655760c07d027","infoHashBuffer":{"type":"Buffer","data":[244,142,97,190,231,203,149,182,16,167,175,159,255,134,85,118,12,7,208,39]},"announce":[],"urlList":[]}}