{"title":"Patrick White - Nobel Prize in Literature, 1973 (15 books)","uid":12007823,"size":21730103,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f54d9cc6a4bbee46a1d6c647df15a4b6f0e0fec7&amp;dn=Patrick+White+-+Nobel+Prize+in+Literature%2C+1973+%2815+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"workerbee","files":30,"time":1433987759,"description":"\nPATRICK WHITE (1912-1990) was an English-born Australian novelist, poet and playwright who, in 1973, was the first (and so far only) Australian to win the Nobel Prize in Literature &quot;for an epic and psychological narrative art which has introduced a new continent into literature.&quot;\n\nThe author of more than a dozen novels, White was the first writer with Australian roots to be widely read abroad and was vastly more popular in the United States and England than among his countrymen.  His fiction employs humour, florid prose, shifting narrative vantage points and a stream of consciousness technique.  In his often unflattering examination of Australia and its people and history, White addressed something far more universal: modern man's loneliness, isolation and emptiness.  He used mystical symbolism and a hypnotic style to convey the suffering of his characters, and various critics compared him to Joyce, Lawrence, Hemingway and Melville. \n\nWhite's earliest notable work is THE AUNT'S STORY (1948), a portrayal imbued with remarkable feeling of a lonely, unmarried, Australian woman's life during experiences that extend also to Europe and America.  THE TREE OF MAN (1955), an epically broad and psychologically discerning account of a part of Australian social development in the form of two people's long life together, and struggle against outward and inward difficulties, secured his international literary reputation.\n\nAnother aspect of Australia is revealed in VOSS (1957), in which a fanatical explorer in the country's interior meets his fate: an intensive character study against the background of the fascinating Australian wilds.  RIDERS IN THE CHARIOT (1961) is a sacrificial drama, tense, yet with an everyday setting, in the midst of current Australian reality.  From contrasting viewpoints, THE SOLID MANDALA (1966) gives a double portrait of two brothers, in which the sterilely rational brother is set against the fertilely intuitive one, who is almost a fool in the eyes of the world.\n\nTHE VIVISECTOR (1970) is the imaginary biography of an artist, in which a whole life is disclosed in a relentless scrutiny of motives and springs of action: an artist's untiring battle to express the utmost while sacrificing both himself and his fellow-beings in the attempt.  THE EYE OF THE STORM (1973) places an old, dying woman in the centre of a narrative which revolves round, and encloses, the whole of her environment, past and present, until we have come to share an entire life panorama, in which everyone is on a decisive dramatic footing with the old lady.  THE TWYBORN AFFAIR (1979) charts the transmigration of a soul through three different identities and was shortlisted for the Booker Prize, but White requested that it be removed to make way for the work of younger and more deserving writers.\n\nIn 1981, White published an autobiography, FLAWS IN THE GLASS, which explored issues about which he had publicly said little, such as his homosexuality, and his refusal to accept the Nobel Prize personally.\n\n\nThis torrent includes all but one of White's novels and novellas, plus his autobiography and two collections of short stories.  The following books are in ePUB format unless otherwise indicated:\n\n\n                                    == Novels ==\n\n* THE AUNT'S STORY (Vintage, 1994)\n\n* THE EYE OF THE STORM (Vintage, 1995)\n\n* A FRINGE OF LEAVES (Vintage, 1997)\n\n* THE HANGING GARDEN (Picador, 2012).  With an Afterword by David Marr.\n\n* HAPPY VALLEY (Text Publishing, 2012)\n\n* MEMOIRS OF MANY IN ONE (Viking, 1986) -- PDF\n\n* RIDERS IN THE CHARIOT (Vintage, 1996)\n\n* THE SOLID MANDALA (Vintage, 1995)\n\n* THE TREE OF MAN (Vintage, 1994)\n\n* THE TWYBORN AFFAIR (Vintage, 1995)\n\n* THE VIVISECTOR (Penguin Classics, 2008).  With an Introduction by J. M. Coetzee.\n\n* VOSS (Vintage, 1994)\n\n\n                                 == Short Stories ==\n\n* CHOICES &amp; CHANCES: Three Short Stories (Amazon, 2012)\n\n* THE COCKATOOS: Stories (Viking, 1975) -- PDF\n\n\n                                 == Autobiography ==\n\n* FLAWS IN THE GLASS: A Self-Portrait (Viking, 1982) -- PDF\n\n_____________________________________________________________________________\n\n\n&gt;&gt; CONTACT ME\nYou may reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account):\n           &lt;a href=&quot;\nhttps://pirates-forum.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://pirates-forum.org/User-workerbee&lt;/a&gt;  \n\n&gt;&gt; PLEASE HELP TO SEED!\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","torrent":{"xt":"urn:btih:f54d9cc6a4bbee46a1d6c647df15a4b6f0e0fec7","amp;dn":"Patrick+White+-+Nobel+Prize+in+Literature%2C+1973+%2815+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f54d9cc6a4bbee46a1d6c647df15a4b6f0e0fec7","infoHashBuffer":{"type":"Buffer","data":[245,77,156,198,164,187,238,70,161,214,198,71,223,21,164,182,240,224,254,199]},"announce":[],"urlList":[]}}