{"title":"J. L. Mackie Evil and Omnipotence.pdf","uid":8890258,"size":1447483,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f5e66987285119415ebe3e4401243dd924500a2d&amp;dn=J.+L.+Mackie+Evil+and+Omnipotence.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1378563893,"description":"The traditional arguments for the existence of God have been fairly thoroughly criticised by philosophers. But the theologian can, if he wishes, accept this criticism. He can admit that no rational proof of God's existence is possible. And he can still retain all that is essential to his position, by holding that God's existence is known in some other, non-rational way. I think, however, that a more telling criticism can be made by way of the traditional problem of evil. Here it can be shown, not that religious beliefs lack rational support, but that they are positively irrational, that the several parts of the essential theological doctrine are inconsistent with one another, so that the theologian can maintain his position as a whole only by a much more extreme rejection of reason than in the former case. He must now be prepared to believe, not merely what cannot be proved, but what can be disproved from other beliefs that he also holds.\n\nThe problem of evil, in the sense in which I shall be using the phrase, is a problem only for someone who believes that there is a God who is both omnipotent and wholly good. And it is a logical problem, the problem of clarifying and reconciling a number of beliefs: it is not a scientific problem that might be solved by further observations, or a practical problem that might be solved by a decision or an action. These points are obvious; I mention them only because they are sometimes ignored by theologians, who sometimes parry a statement of the problem with such remarks as &quot;Well, can you solve the problem yourself?&quot; or &quot;This is a mystery which may be revealed to us later&quot; or &quot;Evil is something to be faced and overcome, not to be merely discussed&quot;.\n\nIn its simplest form the problem is this: God is omnipotent; God is wholly good; and yet evil exists. There seems to be some contradiction between these three propositions, so that if any two of them were true the third would be false. But at the same time all three are essential parts of most theological positions: the theologian, it seems, at once must adhere and cannot consistently adhere to all three. (The problem does not arise only for theists, but I shall discuss it in the form in which it presents itself for ordinary theism.)\n\nHowever, the contradiction does not arise immediately; to show it we need some additional premises, or perhaps some [201] quasi-logical rules connecting the terms 'good', 'evil', and 'omnipotent'. These additional principles are that good is opposed to evil, in such a way that a good thing always eliminates evil as far as it can, and that there are no limits to what an omnipotent thing can do. From these it follows that a good omnipotent thing eliminates evil completely, and then the propositions that a good omnipotent thing exists, and that evil exists, are incompatible.","torrent":{"xt":"urn:btih:f5e66987285119415ebe3e4401243dd924500a2d","amp;dn":"J.+L.+Mackie+Evil+and+Omnipotence.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5e66987285119415ebe3e4401243dd924500a2d","infoHashBuffer":{"type":"Buffer","data":[245,230,105,135,40,81,25,65,94,190,62,68,1,36,61,217,36,80,10,45]},"announce":[],"urlList":[]}}