{"title":"The Color of Food (2015).epub Gooner","uid":12765077,"size":17508012,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f643924520c35418780af8f42591dba932244cef&amp;dn=The+Color+of+Food+%282015%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1447591604,"description":"The Color of Food - Stories of Race, Resilience and Farming (2015).epub Gooner\r\n\r\nPublisher: New Society Publishers (May 5, 2015)\r\nLanguage: English\r\nISBN-10: 0865717893\r\nISBN-13: 978-0865717893\r\n\r\nImagine the typical American farmer. Many people visualize sun-roughened skin, faded overalls, and calloused hands—hands that are usually white. While there's no doubt the growing trend of organic farming and homesteading is changing how the farmer is portrayed in mainstream media, farmers of color are still largely left out of the picture.\r\n\r\nThe Color of Food seeks to rectify this. By recognizing the critical issues that lie at the intersection of race and food, this stunning collection of portraits and stories challenges the status quo of agrarian identity. Author, photographer, and biracial farmer Natasha Bowens's quest to explore her own roots in the soil leads her to unearth a larger story, weaving together the seemingly forgotten history of agriculture for people of color, the issues they face today, and the culture and resilience they bring to food and farming.\r\n\r\nThe Color of Food teaches us that the food and farm movement is about more than buying local and protecting our soil. It is about preserving culture and community, digging deeply into the places we've overlooked, and honoring those who have come before us. Blending storytelling, photography, oral history, and unique insight, these pages remind us that true food sovereignty means a place at the table for everyone.\r\n\r\nNatasha Bowens is an author, farmer, and creator of the multimedia project The Color of Food. Her advocacy focuses on food sovereignty and social issues","torrent":{"xt":"urn:btih:f643924520c35418780af8f42591dba932244cef","amp;dn":"The+Color+of+Food+%282015%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f643924520c35418780af8f42591dba932244cef","infoHashBuffer":{"type":"Buffer","data":[246,67,146,69,32,195,84,24,120,10,248,244,37,145,219,169,50,36,76,239]},"announce":[],"urlList":[]}}