{"title":"Democracy Now - 16 may 2011","uid":6397586,"size":428621250,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:f6ea7b3915665fbc866f35a9db6c0eea272ec2e5&amp;dn=Democracy+Now+-+16+may+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1305563233,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for May 16, 2011\n\n- Israeli Troops Kill 13 Pro-Palestinian Protesters In Multiple Border Confrontations\n- Egypt Security Forces Crackdown On Pro-Palestine Protesters At Israel Embassy, Hundreds Injured\n- International Criminal Court Issues Arrest Warrant For Muammar Gaddafi, Son and Intelligence Chief\n- United Arab Emirates Hires Blackwater Founder To Build Mercenary Army\n- Head Of International Monetary Fund Arrested On Sex Crime Charges\n- Japan Expands Exclusion Zone Around Damaged Nuclear Plant, Greenpeace Calls For Radiation Investigation\n- Saudi Diplomat Assassinated In Pakistan\n- Guatemala: Dozens Found Decapitated In Historic Drug-Related Mass Killing\n- Michel Martelly Sworn In As Haiti's President\n- Key Mississippi Floodgate Opened Up As Waters Rise, Tens Of Thousands Threatened\n- Israeli Forces Seriously Injure American Student Filming Non-Violent Protest\n\n\nSpecial reports\n\n- &quot;Sing Your Song&quot;: Harry Belafonte on Art &amp; Politics, Civil Rights &amp; His Critique of President Obama\n\nLegendary musician, actor, activist and humanitarian Harry Belafonte joins us for the hour to talk about his battle against racism, his mentor Paul Robeson, the power of music to push for political change, his close relationship with the Rev. Dr. Martin Luther King, Jr., and the U.S. role in Haiti. A new documentary chronicles his life called, &quot;Sing Your Song.&quot; The son of Jamaican immigrants, Belafonte grew up on the streets of Harlem and Jamaica. In the 1950s, he spearheaded the calypso craze and became the first artist in recording history with a million-selling album. He was also the first African-American musician to win an Emmy. Along with his rise to worldwide stardom, Belafonte became deeply involved in the civil rights movement. One of Dr. King's closest confidants, he helped organize the march on Washington in 1963. &quot;Going into the South of the United States, listening to the voices of rural black America, listening to the voices of those who sang out against the Ku Klux Klan and out against segregation, and women, who were the most oppressed of all, rising to the occasion to protest against their conditions, became the arena where my first songs were to emerge,&quot; Belafonte tells Democracy Now!\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:f6ea7b3915665fbc866f35a9db6c0eea272ec2e5","amp;dn":"Democracy+Now+-+16+may+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6ea7b3915665fbc866f35a9db6c0eea272ec2e5","infoHashBuffer":{"type":"Buffer","data":[246,234,123,57,21,102,95,188,134,111,53,169,219,108,14,234,39,46,194,229]},"announce":[],"urlList":[]}}