{"title":"Espier Launcher By Palash","uid":8799633,"size":29682348,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:f74f5accee65028f50222ab20bac534e87689160&amp;dn=Espier+Launcher+By+Palash&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Palash995","files":49,"time":1376165224,"description":"Espier Launcher V3.2\n\nDescription\nSUMMARY\n=========\nEspier Launcher V3.2 is the refactored and optimized version of the best and the most popular iOS-style home app (Espier Launcher 3.0) for Android devices. In this version, we totally refactored and optimized the Espier Launcher V3.0 in order to resolve the unstable issues, lags, and big memory usage. If you use Espier Launcher 3.2 along with Espier Screen Locker and Espier Notifications plugin, and other latest Espier apps (browser, clock, reminders, and so on), your Android device will have a totally new look!\n\nMAIN FEATURES\n==============\n1. A perfect combination of classical iOS-style and the modern Android features:\n* Perfect implementation of iOS home screen effects and functions.\n* Flawless widget support; You can have multiple widget pages (up to eight).\n* Complete shortcuts management.\n2. Dozens switches or options, which help the launcher matches your Android device perfectly:\n* Use widget pages or not.\n* Show all widgets in one wiget page or use multiple widget pages.\n* Show widget pages along with icon pages or show the widget pages separately.\n* Powerful customization of icon layout; You can customize the icon size, icon layout (columns and rows), the size of icon title, and the color of the title.\n3. Unique multi-language support; Dozens languages supported, and more and more.\n4. AppHub folder reminds you the update of your apps in time.\n5. The visual effects when you scroll the widget pages. \n6. Other features or enhancements:\n* Enhanced icon design; you can apply one design to a specific category of icons, not only one icon.\n* No limitation for the number of icons in a folder.\n* Locking icons, not only hiding them.\n* Dozens of themes (more and more) available to decorate your home screen.\n* Dozens of plugins (more and more) available to extend the functions; Badge icons if you use Espier Notifications plugin.\n* You can get your favorite wallpapers and icons from our online gallery easily.\n\nIMPORTANT NOTES\n===================\n1. The basic functions of this app are FREE and this app does not contain any third-party ads. However.\n* In order to remove AppHub floder, you need to pay 1,000 Espier Coins to get an extra license.\n* In order to save the pictures from Online Gallery, you need to subscribe this function (500 Espier Coins for 30 days).\n2. Espier Coin is a virtual currency, and 1,000 Espier Coins are equal to USD5.00. However, if you keep visiting Espier Mobile Portal from Espier Launcher, you will gain some GIFT coins. If you file valid bugs in our bug management system (http://bugzilla.espier.org), you may gain some VOLUNTEER coins. As a result, you might be able to buy the licenses without any real payment! For more information about the Espier Coins, please refer to http://www.espier.org/en/developers/blog/espier-micro-portal-peronal-center-released/\n3. Other network resources:\n* Please visit http://m.espier.org/en/apps/launcher/ to get usage instructions and tips.\n* Please visit http://3g.espier.mobi/en/sns/app-community?pack_name=mobi.espier.launcher to communicate with the developer. \n* Please join the Espier-Apps Google Groups (https://groups.google.com/forum/#!forum/espier-apps) for easy communication with the developer and other users of Espier apps.","torrent":{"xt":"urn:btih:f74f5accee65028f50222ab20bac534e87689160","amp;dn":"Espier+Launcher+By+Palash","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f74f5accee65028f50222ab20bac534e87689160","infoHashBuffer":{"type":"Buffer","data":[247,79,90,204,238,101,2,143,80,34,42,178,11,172,83,78,135,104,145,96]},"announce":[],"urlList":[]}}