{"title":"Valentine - DVDR PAL","uid":7976844,"size":5375688704,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:f78bd891739c8227ffef418ea21fac66861f6c2b&amp;dn=Valentine+-+DVDR+PAL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gunnsalius","files":-1,"time":1357023015,"description":"www.imdb.com/title/tt0242998/\n\n Valentine's Day 1988: At the school dance, geeky Jeremy Melton bravely faces one rejection after the other when asking four popular girls to dance with him. A fifth girl, plump and insecure, agrees, but they end up making out under the bleachers. When a group of school bullies catches them, the girl claims that Jeremy attacked her. This causes them to strip off his clothes and beat him up in front of the entire school. Flash forward to 2001. We meet the five girls who were in that school gym: Kate, Paige, Shelly, Lily and the formerly plump Dorothy. They are all in their 20's now and trying to sort out their love lives, which is appropriate, since Valentine's Day is coming up. After a disastrous date with a loser, one of the girls, a pre-med student, is murdered by a Cherub-mask wearing killer who sent her a death threat in the form of a Valentine card prior to the attack. After the four remaining girls are reunited at her funeral, they all start receiving threatening cards and messages. At first they don't know who would want to hurt them, but eventually they figure that maybe Jeremy is responsible. Police records show that Jeremy has completely disappeared, so no one knows what he looks like. Could the formerly nerdish Jeremy have had plastic surgery and turned into one of the girls' handsome boyfriends? Who ever it is, the lone survivor has to put a stop to this spurned individual's murder spree before she, too, becomes a valentine to die for.\n\nAudio: English, German, Spanish.\nSubs.: English, German, Spanish, Swedish, Norwegian, Danish, Finnish, Portuguese, \n       Hebrew, Finnish, Polish, Greek, Czech, Turkish, Hungarian, Icelandic, Croatian\n       French, Italian.\n\nPlease seed after downloading...","torrent":{"xt":"urn:btih:f78bd891739c8227ffef418ea21fac66861f6c2b","amp;dn":"Valentine+-+DVDR+PAL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f78bd891739c8227ffef418ea21fac66861f6c2b","infoHashBuffer":{"type":"Buffer","data":[247,139,216,145,115,156,130,39,255,239,65,142,162,31,172,102,134,31,108,43]},"announce":[],"urlList":[]}}