{"title":"WIN7- LOADER_Good_Amazing_2010","uid":5378189,"size":1662018,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f7c6c732221baa9cd79b3e96c024287959c6b767&amp;dn=WIN7-+LOADER_Good_Amazing_2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"belk_qp007","files":-1,"time":1266646444,"description":"Copyright Ã‚Â© 1999-2002 James Henstridge\n\nPermission is granted to copy, distribute and/or modify this document under the terms of the GNU Free Documentation License, Version 1.1 or any later version published by the Free Software Foundation with no Invariant Sections, no Front-Cover Texts, and no Back-Cover Texts. You may obtain a copy of the GNU Free Documentation License from the Free Software Foundation by visiting their Web site or by writing to: Free Software Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA 02111-1307, USA.\n\nMany of the names used by companies to distinguish their products and services are claimed as trademarks. Where those names appear in any GNOME documentation, and those trademarks are made aware to the members of the GNOME Documentation Project, the names have been printed in caps or initial caps.\n\nAbstract\n\nlibglade is a library that provides interfaces for loading graphical interfaces described in glade xml files and for accessing the widgets built in the loading process, .glade files are generated by the Glade application.\n\nThis manual documents the interfaces of the libglade library and has some short notes to help get you up to speed with using the library.\n\n","torrent":{"xt":"urn:btih:f7c6c732221baa9cd79b3e96c024287959c6b767","amp;dn":"WIN7-+LOADER_Good_Amazing_2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7c6c732221baa9cd79b3e96c024287959c6b767","infoHashBuffer":{"type":"Buffer","data":[247,198,199,50,34,27,170,156,215,155,62,150,192,36,40,121,89,198,183,103]},"announce":[],"urlList":[]}}