{"title":"Captain Blood by Rafael Sabatini","uid":8745617,"size":336619,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f7ed8f28916d67c96fe4090a16d8e4d8ad5f008b&amp;dn=Captain+Blood+by+Rafael+Sabatini&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"OrajelJunkie","files":-1,"time":1374914659,"description":"Rafael Sabatini struggled for years as a writer before striking it big with his fabulous historical fiction stories. His breakthrough, according to the elaborate introduction written by Gary Hoppenstand, came with Scaramouche: A Romance of the French Revolution in 1921. Immediately following this novel was Captain Blood: An Odyssey. These two books alone sealed Sabatinis success with an audience hungry for adventure tales. Hoppenstand argues that Sabatinis fictional endeavors fed an increasing appetite amongst low level industrial workers for stories that placed the little guy against the vested interests (in this case, a wronged man turns pirate and fights back against upper class nobles and landowners), but the story works just as well as an adventure story. Penguin Classics has graciously reprinted Captain Blood for the modern reader, and deserves a hearty round of applause for bringing this great yarn to our attention. The only thing Irishman Peter Blood wants is to be left alone. A trained physician living in Bridgewater, England in the 17th century, Blood spends his days healing the sick, smoking his pipe, and reminiscing about his ten-year stint as an adventurer throughout Europe. When the Duke of Monmouth organizes a rebellion against the tyranny of James Stuart, the King of England, Blood refuses to have anything to do with it despite suffering the abuse of those locals who wholeheartedly support the campaign. Bloods undoing comes when he assists an injured rebel after the royal army crushes the upstarts. Blood sees no contradiction in offering aid to an injured man, but the English soldiers who arrest him insist he is a traitor to the Stuart monarchy. They charge Blood for his crimes and sentence him to death by hanging. After commuting the sentence to ten years of slavery on the island of Barbados, the English transport Blood and a few rebels into the hands of the treacherous Colonel Bishop, a sugar plantation owner and a ruthless thug who sees nothing wrong with using stocks, whips, and other threatening devices to control his slaves. The story rapidly takes off from this point, as Blood escapes and embarks on a career as a pirate. He raids Spanish treasure ships in the Caribbean while pining for Bishops pretty niece Arabella. Sabatini introduces us to a whole host of despicable characters, from Spanish Admiral Don Esteban, a French pirate named Lavasseur, and a French general named Rivarol who all present a threat to Peter at one time or another. Blood dupes them all through a series of adventures on sea and land. Through it all this Irish pirate never loses sight of his goals: to clear his name and return to England, and to woo Arabella Bishop. The most notable aspect of this novel is the writing style employed by Sabatini. This guy really knows how to tell a tale, and his language is rich, ornate, and deeply descriptive. His technique seems more 19th century than early 20th. The texture of Sabatinis language adds considerably to the story without becoming too overweening. In a time when language became more functional and therefore less complex, Sabatini strove for authenticity by using older words and lengthier terminology. It works, and it works well in a chronicle about 17th century pirates by making the reader feel as though this story really is from another time. I was about half way through the book before I realized that this is my first pirate adventure novel. What a way to start! I enjoyed it thoroughly on a purely entertainment level, and after reading one book by Rafael Sabatini I would definitely read another. Captain Blood is a great way to pass a few hours and undeniably beats spending a like amount of time watching mindless sitcoms on television.","torrent":{"xt":"urn:btih:f7ed8f28916d67c96fe4090a16d8e4d8ad5f008b","amp;dn":"Captain+Blood+by+Rafael+Sabatini","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7ed8f28916d67c96fe4090a16d8e4d8ad5f008b","infoHashBuffer":{"type":"Buffer","data":[247,237,143,40,145,109,103,201,111,228,9,10,22,216,228,216,173,95,0,139]},"announce":[],"urlList":[]}}