{"title":"Advanced Instant Messengers Password Recovery v3.62 incl.patch G","uid":4353941,"size":1252027,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f843ac81c390c70f4a2472a27b0373247744296b&amp;dn=Advanced+Instant+Messengers+Password+Recovery+v3.62+incl.patch+G&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jsph69","files":1,"time":1219315456,"description":"Advanced Instant Messengers Password Recovery v3.62\nAdvanced Instant Messengers Password Recovery instantly retrieves the login and password information protecting user accounts in various instant messengers. Currently supporting over 70 different instant messengers, Advanced Instant Messengers Password Recovery is undoubtedly the most universal product in its class. If there is more than one account in the system, Advanced Instant Messengers Password Recovery recovers all passwords.\n\nInstant IM Account Transfer\nA few modern instant messengers, such as ICQ version 6 and higher, Yahoo! IM version 7.5 and up, and all versions of Skype, never store password information anywhere. Instead, they perform a one-way transformation of a password, creating a secure hash that is used to authenticate users with IM servers.\n\nInstead of performing lengthy attacks on these passwords, Advanced Instant Messengers Password Recovery offers an ability to back up and restore such passwords, effectively allowing transferring IM accounts and settings from one PC to another without knowing the original password.\n\nSupported Instant Messengers\nICQ and ICQLite, AOL Instant Messenger and AIM Triton, AIM Pro, Yahoo! Messenger, Excite Messenger, MSN Messenger, Windows Live Messenger, Microsoft Office Communicator 2005, Google Talk, Trillian, Odigo, AT&amp;T IM Anywhere, T-Online Messenger, Match Messenger, Praize IM, ScreenFIRE, ACD Express Comunicator, Imici Messenger, Prodigy IM, PowWow Messenger, Jabber IM, Kellster IM, PalTalk, Indiatimes messenger, Miranda, Tiscali, Ya.com Messenger, Rediff Bol, Sify Buzz, Devil, Tencent QQ, QQ (Africa Version), &amp;RQ, Ipswitch Instant Messenger, Eighth Wonder Catax, Simple Instant Messenger, Vista IM, GAIM, Global-IM, Psi Jabber client, Messenger2, Picasa Hello, iWon, Blowsearch, MessageMate, Meca Messenger, Qnext, Bubbler (Five Across), InterComm IM (Five Across), Easy Message, QIP, Gizmo, MySpace IM, Exodus, Gadu-Gadu, Mail.Ru Agent, ScatterChat, Just Another Jabber Client, Maple Messenger, Pandion, IMVITE Messenger, Oyco Messenger, Imeem, IMVU, Gajim.\n\n\ncopy aimpr_v3.62_GEGTER_inline_patch.exe  IN THE APP FOLDER e Run patch","torrent":{"xt":"urn:btih:f843ac81c390c70f4a2472a27b0373247744296b","amp;dn":"Advanced+Instant+Messengers+Password+Recovery+v3.62+incl.patch+G","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f843ac81c390c70f4a2472a27b0373247744296b","infoHashBuffer":{"type":"Buffer","data":[248,67,172,129,195,144,199,15,74,36,114,162,123,3,115,36,119,68,41,107]},"announce":[],"urlList":[]}}