{"title":"Anders Johnson - Garpar, gipskatter och svartskallar","uid":6880658,"size":100790256,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f851a918df70d0836d65aa744425cdccfe7683d9&amp;dn=Anders+Johnson+-+Garpar%2C+gipskatter+och+svartskallar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"kjhgviyvoiyoi","files":-1,"time":1323641335,"description":"Invandrare har under alla epoker sedan medeltiden, i alla delar av landet och i praktiskt taget alla branscher haft en stor betydelse for Sveriges ekonomiska utveckling.\n\nI Garpar, gipskatter och svartskallar presenteras en rad spannande manniskor: handelsman fran tyska Hansan, smeder fran Vallonien, brittiska ingenjorer och manga andra invandrare som har gjort viktiga insatser i Sverige. Vi moter ocksa manga valkanda svenska foretag som har byggts upp av invandrare, till exempel Bonniers och Gleerups, Cloetta och Marabou, Expressen och Goteborgs-Posten, Felix och Findus, Hoganas och Perstorp, Handelsbanken och Sparbanken.\n\nNaringslivets utveckling star i fokus. Boken handlar framfor allt om entreprenorer, foretagsledare, uppfinnare, konstruktorer, experter och yrkesarbetare. Dartill ges en del exempel pa framstaende invandrare inom andra samhallsomraden, till exempel konstnarer och vetenskapsman.\n\nAnders Johnson ar forfattare med inriktning pa svensk naringslivshistoria. ar 2008 gav han ut den uppmarksammade och prisbelonta boken Fanga platsen. Guide till Sveriges ekonomiska historia (SNS Forlag).\n\n&quot;Nar Sverigedemokraterna klar sig i knatofs och talar om det svenska kulturarvet kanns det bra att kunna lagga en bok pa kaffebordet som vidgar vyerna.&quot;\nEva-Lena Ahlqvist, Dagens Industri \n\nUpplasare: Jens Jakobson\n","torrent":{"xt":"urn:btih:f851a918df70d0836d65aa744425cdccfe7683d9","amp;dn":"Anders+Johnson+-+Garpar%2C+gipskatter+och+svartskallar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f851a918df70d0836d65aa744425cdccfe7683d9","infoHashBuffer":{"type":"Buffer","data":[248,81,169,24,223,112,208,131,109,101,170,116,68,37,205,204,254,118,131,217]},"announce":[],"urlList":[]}}