{"title":"Simon Clark 4 books","uid":9194131,"size":1323475,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f92a82adf37fd8f1c4096e722ba039754a3b91f4&amp;dn=Simon+Clark+4+books&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":4,"time":1384450782,"description":"Darkness Demands by Simon Clark\nWhen writer John Newton receives a mysterious note containing the bizarre request that he should leave a bar of chocolate on one of the gravestones in the local churchyard, he doesn't take much notice. But, as he is about to discover, the consequences of not complying with the anonymous demand can be truly appalling. A newcomer to the picturesque Yorkshire village of Skelbrooke, John comes to realize that its inhabitants harbour a terrifying secret. And as the demands escalate in intensity, so John must face his worst nightmare come true. With this, his eighth nerve-shattering novel of supernatural suspense, Simon Clark triumphantly confirms his reputation as &quot;one of the most exciting British horror writers around.&quot;\n\nThe Tower by Simon Clark\nA haunted mansion not only contains the ghosts of the past, but can reach into the future to predict how its current occupants will die, infecting the entire town with its madness.\n\nLondon Under Midnight by Simon Clark \nA novel of vampiric terror from one of the masters of the genre Vampyr Sharkz ? ?They?re coming to get you?. The graffiti spread through London that summer like wildfire. Its population carried on with life as usual in one of the richest cities on the planet. But beneath the surface there is change. Men and women are going missing without trace. What has the old African preacher seen emerging from undergrowth near the river? Is this the essence of evil encountered long ago? Ben Ashton is an investigative writer. When he's commissioned to find out who is responsible for the Vampyr Sharkz graffiti he thinks his luck has changed for the better. Little does he guess how wrong he is?\n\nNailed by the Heart by Simon Clark \nThe Stainforth family--Chris, Ruth and their young son, David--move into the ancient sea-fort in a nice little coastal town to begin a new life, to start fresh. At the time it seems like the perfect place to do it, so quiet, so secluded. But they have no way of knowing that they've moved into what was once a sacred site of an old religion. And that the old god is not dead--only waiting. Already the god's dark power has begun to spread, changing and polluting all that it touches. A hideous evil pervades the small town. Soon the dead no longer stay dead. When the power awakens the rotting crew of a ship that sank decades earlier, a nightmare of bloodshed and violence begins for the Stainforths, a nightmare that can end only with the ultimate sacrifice--death.\n\nDarker by Simon Clark \nWriter Richard Young is looking forward to a week at home with his wife and their little daughter. He thinks it's going to be a pleasant time of barbecues and lazy summer days.\nIt isn't.\nBecause the stranger who arrives at their home, begging to be driven to the nearest police station, is being hunted. Hunted by something that cannot be seen, cannot be heard -- yet which has the power to move across the land and crushing flat everything in its path. Stalking -- and killing -- remorselessly.\nWithin minutes, Richard Young, his family, and the stranger are being pursued relentlessly -- and running for their lives..\n","torrent":{"xt":"urn:btih:f92a82adf37fd8f1c4096e722ba039754a3b91f4","amp;dn":"Simon+Clark+4+books","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f92a82adf37fd8f1c4096e722ba039754a3b91f4","infoHashBuffer":{"type":"Buffer","data":[249,42,130,173,243,127,216,241,196,9,110,114,43,160,57,117,74,59,145,244]},"announce":[],"urlList":[]}}