{"title":"Bellydance Arabic Rhythms and Combinations with Tamra","uid":8321936,"size":1252808751,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:f9558330842a97dc1339f2d0cfb591f31d63af27&amp;dn=Bellydance+Arabic+Rhythms+and+Combinations+with+Tamra&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sara_melika","files":2,"time":1364695131,"description":"Arabic Rhythms with Tamra-Henna Over two hours of outstanding instruction! Rhythm ~ the foundation of Middle Eastern music. As well as express the emotion of the melody and lyrics, a belly dancer must be on the beat and respond to the many rhythm changes that add depth and texture to Egyptian music. Tamra-henna and Amir Sofi on tabla teach you everything you need to understand Egyptian rhythms so your Raks Sharqi performances will beautifully interpret the subtle complexities of this wonderful music! Tamra-henna and Amir begin by explaining and demonstrating the elements of Egyptian rhythms ~ Dum - tec - ka! ~ and the structure and timing of these popular Egyptian rhythms: The 4 Beat Rhythms: ~ Maqsoum ~ Masmoudi Sagheer (Beledi) ~ Wahda The 2 Beat Rhythms: ~ Ayub ~ Malfoof And so you don't miss a beat, diagrams that illustrate each rhythm appear on the screen while Amir plays! Because it's not enough to recognize the rhythms, Tamra-henna discusses the kinds of music in which each rhythm is found, and how you can use them in your performance. She then teaches several combinations that reflect the structure of each rhythm. The combinations will help you develop a deeper understanding of Egyptian rhythms. Plus, they're fun new moves to use in your dancing! Finally, you are treated to a beautiful costumed performance by Tamra-henna! ","torrent":{"xt":"urn:btih:f9558330842a97dc1339f2d0cfb591f31d63af27","amp;dn":"Bellydance+Arabic+Rhythms+and+Combinations+with+Tamra","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9558330842a97dc1339f2d0cfb591f31d63af27","infoHashBuffer":{"type":"Buffer","data":[249,85,131,48,132,42,151,220,19,57,242,208,207,181,145,243,29,99,175,39]},"announce":[],"urlList":[]}}