{"title":"Rush.For.Glory-FASiSO","uid":9832341,"size":900077103,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f96bf865e84e3ce1cc3fdd5c931bccd7ac6bbb20&amp;dn=Rush.For.Glory-FASiSO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Taker009","files":-1,"time":1395861291,"description":" Rush.For.Glory-FASiSO\n\n                   Rush For Glory (c) Immanitas Entertainment\n\n  Date ..........: 2014-03-26                      18 x 50.00 :......... Files\n  Language ......: English                                  - :.... Protection\n\n               Physical [ ] :......  Source  ......: [+] Digital\n             Unmodified [+] :......  Image  .......: [+] Crack added\n                Windows [+] :......  System  ......: [ ] Macintosh\n\n  Rush for Glory is a strategic game in the tower defense genre. The player\n  should defend his people against aliens. He should prevent aliens from\n  getting access to the base. The player can do this by the weapons he has at\n  his command. Towers and power attacks are the player's weapons. By using\n  towers and upgrading them, the player can keep his base safe.\n\n  By killing enemies the player gains gold and experience. Using his resources\n  (Gold and experience), he should decide the tower he has in mind, and locate\n  it in an appropriate place. Each tower has its own especial ability which\n  serves for an especial purpose. The playerÃ†s situation through the game\n  guides him to make the right decision while choosing the type of the tower\n  and its location.\n\n  This game has 10 levels. Each level has a different atmosphere and provides\n  a wide variety of visual experience for gamers. The atmosphere of the game\n  begins in a village and extends to urban margins and ends in a completely\n  different world in the aliens' base.\n\n  'Rush for Glory' has new and different items which are called power attacks.\n  These new items have especial and strong abilities which make this game more\n  absorbing. The player should use power attacks and towers simultaneously to\n  be successful in the game. Another point about RfG is the great variety of\n  enemy units. Each unit has its especial feature and behavior which force the\n  player to use a distinct strategy in order to face and defeat it. 5 power\n  attacks and 5 towers with 30 different aggressive modes in facing a huge\n  variety of enemies and levels with different atmospheres try to make RfG a\n  different and fun experience for users.\n\n  Features:\n  ~~~~~~~~~\n  - 10 different amazing colorful levels.\n  - 5 towers with 3 different upgrade states and 3 special abilities.\n  - 5 power attacks. Dead rain, trap, slower, golden tower...\n  - More than 30 enemy types with especial behavior.\n  - Attackers, healers, supporters, turbo types...\n  - Game speed controller to make game speed slow and fast.\n  - Additional 10 simple mini game through the levels.\n  - General upgrade panel contain more that 40 options.\n  - Additional cinematic cameras.\n\n  \n  - UnRAR\n  - Burn/mount image with your favorite software\n  - Install game\n  - Use crack from FASiSO directory","torrent":{"xt":"urn:btih:f96bf865e84e3ce1cc3fdd5c931bccd7ac6bbb20","amp;dn":"Rush.For.Glory-FASiSO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f96bf865e84e3ce1cc3fdd5c931bccd7ac6bbb20","infoHashBuffer":{"type":"Buffer","data":[249,107,248,101,232,78,60,225,204,63,221,92,147,27,204,215,172,107,187,32]},"announce":[],"urlList":[]}}