{"title":"Lincoln's Final Hours: Conspiracy, Terror, and the Assassination","uid":12818580,"size":4748454,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fa55676c9035b2817dba24064e01feb44fb09891&amp;dn=Lincoln%27s+Final+Hours%3A+Conspiracy%2C+Terror%2C+and+the+Assassination&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TopShelfBook","files":3,"time":1448264739,"description":"Lincoln's Final Hours: Conspiracy, Terror, and the Assassination of America's Greatest President | EPUB\r\n\r\nWhen John Wilkes Booth fired his derringer point-blank into President Abraham Lincoln's head, he set in motion a series of dramatic consequences that would upend the lives of ordinary Washingtonians and Americans alike. In a split second, the story of a nation was changed. During the hours that followed, America's future would hinge on what happened in a cramped back bedroom at Petersen's Boardinghouse, directly across the street from Ford's Theatre. There, a twenty-three-year-old surgeon―fresh out of medical school―struggled to keep the president alive while Mary Todd Lincoln moaned at her husband's bedside.\r\n\r\nIn Lincoln's Final Hours, author Kathryn Canavan takes a magnifying glass to the last moments of the president's life and to the impact his assassination had on a country still reeling from a bloody civil war. With vivid, thoroughly researched prose and a reporter's eye for detail, this fast-paced account not only furnishes a glimpse into John Wilkes Booth's personal and political motivations but also illuminates the stories of ordinary people whose lives were changed forever by the assassination.\r\n\r\nWhile countless works on the Lincoln assassination exist, Lincoln's Final Hours moves beyond the well-known traditional accounts, offering readers a front-row seat to the drama and horror of Lincoln's death by putting them in the shoes of the audience in Ford's Theatre that dreadful evening. Through her careful narration of the twists of fate that placed the president in harm's way, of the plotting conversations Booth had with his accomplices, and of the immediate aftermath of the assassination, Canavan illustrates how the experiences of a single night changed the course of history.\r\n\r\n**PLEASE SEED**","torrent":{"xt":"urn:btih:fa55676c9035b2817dba24064e01feb44fb09891","amp;dn":"Lincoln%27s+Final+Hours%3A+Conspiracy%2C+Terror%2C+and+the+Assassination","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa55676c9035b2817dba24064e01feb44fb09891","infoHashBuffer":{"type":"Buffer","data":[250,85,103,108,144,53,178,129,125,186,36,6,78,1,254,180,79,176,152,145]},"announce":[],"urlList":[]}}