{"title":"Rockabilly Riot, Vol. 1 - A Tribute to Sun Records","uid":9321357,"size":86435030,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:fa90f27692313394c72fb6be37f8edd03344e08c&amp;dn=Rockabilly+Riot%2C+Vol.+1+-+A+Tribute+to+Sun+Records&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Noshock","files":-1,"time":1386557822,"description":"\n\nThe concept is stated in the title and the execution is about what you'd expect from one of the most popular rockabilly revivalists in contemporary music. It's not much of a stretch for Stray Cat Brian Setzer to take a break from writing his own rockabilly tunes that often sound like classic Sun material anyway, but by narrowing his focus roughly from 1954 to early 1957 and sticking with music produced by the king of country music record labels, he scores credibility points. The 23-track set is peppered with obvious choices like Carl Perkins' &quot;Blue Suede Shoes&quot; and &quot;Boppin' the Blues&quot; and Johnny Cash's &quot;Get Rhythm,&quot; but dominated by more obscure fare from lesser-known acts such as Kenny Parchman, Ernie Barton, and Tommy Blake. Setzer even tracked down Jumpin' Gene Simmons to finish off &quot;Peroxide Blonde in a Hopped Up Model Ford&quot; when part of the original master copy was found to have been erased. Elvis is represented only by &quot;Just Because,&quot; a brief nod to the King that also illustrates how many other acts had produced music nearly as vital from the same little room in Memphis. Setzer even calls in the Jordanaires to provide background vocals, bringing even more authenticity to this project. These versions are refreshingly stripped down, with standup bass, skeletal drums, acoustic piano, and occasional sax providing all the instrumental excitement. Even Setzer's fiery guitar solos are lean, mean, and never dominate the songs. He's in terrific form throughout; clearly his heart is in it and it sounds like he's having a blast. Whether listeners need covers that stick so closely to the originals, if with slightly fuller sound, when the real McCoys are easily available is something listeners will have to decide for themselves. Regardless, this is a rollicking, ballad-free, nonstop hour of classic rockabilly that shows how much great music emerged from such a short period, and from only one record label. Setzer fans will be thrilled and those first hearing these songs will want to go back to explore the genre's rich history firsthand.\n\nReview by Hal Horowitz  ","torrent":{"xt":"urn:btih:fa90f27692313394c72fb6be37f8edd03344e08c","amp;dn":"Rockabilly+Riot%2C+Vol.+1+-+A+Tribute+to+Sun+Records","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa90f27692313394c72fb6be37f8edd03344e08c","infoHashBuffer":{"type":"Buffer","data":[250,144,242,118,146,49,51,148,199,47,182,190,55,248,237,208,51,68,224,140]},"announce":[],"urlList":[]}}