{"title":"Harlow Giles Unger - The Last Founding Father [64] Unabridged","uid":9911186,"size":360366763,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:fae4516ce67ec0c04a934250dd5e4b99fcaeff38&amp;dn=Harlow+Giles+Unger+-+The+Last+Founding+Father+%5B64%5D+Unabridged&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"rambam1776","files":-1,"time":1396900159,"description":"Harlow Giles Unger - The Last Founding Father: James Monroe and a Nation's Call to Greatness\n\n64 kbps, Unabridged, Audible Rip, Narrated by: Michael McConnohie\n &lt;a href=&quot;\nhttp://www.audible.com/pd/Bios-Memoirs/The-Last-Founding-Father-Audiobook/B0030E6HQY&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.audible.com/pd/Bios-Memoirs/The-Last-Founding-Father-Audiobook/B0030E6HQY&lt;/a&gt;\n\nOverview\nIn This Gripping Biography, award-winning author Harlow Giles Unger reveals the epic story of James Monroe (1758-1831)-the last of America's Founding Fathers-who transformed a small, fragile nation beset by enemies into a powerful empire stretching &quot;from sea to shining sea.&quot;\n\nEmerging from the battlefields of the Revolutionary War a decorated soldier, Monroe went on to serve America as its first full-time politician-a member of Congress, minister to France and Britain, governor of Virginia, secretary of state, secretary of war, and, finally, fifth president of the United States. Monroe took command of a nation nearly bankrupt, its people divided, its borders under attack, and its capital in ashes after the British invasion in the War of 1812. During two formative terms he rebuilt national defenses, expanded the military, extended national boundaries, and startled the world by proclaiming the landmark Monroe Doctrine, closing the Americas to foreign incursions and colonization. His leadership ushered in an &quot;Era of Good Feelings&quot; never seen before or since in American history. A superb read based on stellar scholarship, The Last Founding Father sheds light not only on the remarkable life of Monroe, but on a key chapter in the story of America. The result is an action-filled history in the grand tradition.\n\nLibrary Journal\nIn this well-written biography, Unger (Lafayette) presents the fifth president as a man of independence and initiative rather than merely a disciple of Jefferson, Madison, and John Quincy Adams. In this respect, he follows Harry Ammon's assessment in James Monroe: The Quest for National Identity. Unger shows that as a diplomat, Monroe went beyond his ministerial instructions to negotiate treaties and the Louisiana Purchase, that as governor of Virginia he effectively used pronouncements to build public support for his policies, and that as President, he used his diplomatic, cabinet, and military experience to proclaim what became known as the Monroe Doctrine. The author's praise for Monroe should have been balanced by some questions about Monroe's ambition (and possible vanity). For example, during the War of 1812, how far did Monroe undermine Secretary of War John Armstrong so that he could take over the post himself? VERDICT Like Gary Hart's James Monroe, in the Times Books series of short presidential biographies, Unger's work will appeal to a more popular audience, especially those who enjoy presidential history or studying the Founding Fathers. Historians and history students should read as well but will still rely on Ammon.\n\nKirkus Reviews\nCogent reexamination of a relatively neglected American icon. James Monroe (1758-1831) was a major guiding force in the territorial expansion of the country, argues historian Unger (America's Second Revolution: How George Washington Defeated Patrick Henry and Saved the Nation, 2007, etc.). Monroe was a key negotiator of the 1803 Louisiana Purchase, which effectively doubled the nation's territory overnight. More importantly, as the nation's fifth president he kept the country safe from outside attack via the Monroe Doctrine, an 1823 policy that warned European governments that colonization or interference with U.S. states would be viewed as an act of war. As a result, pioneers felt safe enough to trek westward and settle in faraway lands. Less prominent than some of the other Founding Fathers, he was nonetheless present at many major historical events in the revolutionary struggle. As a student in Virginia, he was inspired by Patrick Henry's &quot;give me liberty, or give me death&quot; speech at Richmond in 1775. A soldier under General Washington, he holds the flag in Emanuel Gottlieb Leutze's famous 1851 painting, Washington Crossing the Delaware. Monroe was also Secretary of State and Secretary of War during the War of 1812, the first true military challenge to the nascent United States. Unger ably explains how these experiences later informed Monroe's pragmatic and confident leadership style. The author's treatment of Monroe's relationship with wife Elizabeth is somewhat less interesting and invites unfavorable comparison to David McCullough's excellent John Adams (2001), which used John's correspondence with Abigail in effective and revelatory ways. Still, Unger makes a solid and cohesiveargument for Monroe's importance in the early years of the United States, even if he goes too far in his enthusiasm by calling predecessors Adams, Madison and Jefferson &quot;mere caretaker presidents.&quot;A worthy attempt to rescue Monroe from obscurity for a mainstream audience.","torrent":{"xt":"urn:btih:fae4516ce67ec0c04a934250dd5e4b99fcaeff38","amp;dn":"Harlow+Giles+Unger+-+The+Last+Founding+Father+%5B64%5D+Unabridged","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fae4516ce67ec0c04a934250dd5e4b99fcaeff38","infoHashBuffer":{"type":"Buffer","data":[250,228,81,108,230,126,192,192,74,147,66,80,221,94,75,153,252,174,255,56]},"announce":[],"urlList":[]}}