{"title":"First Blood - US 1st Armored division in Tunisia -Gillono- [Non-","uid":8972173,"size":23752759,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fb0881e14f273b2f4eec35c52b8a33401dad8a45&amp;dn=First+Blood+-+US+1st+Armored+division+in+Tunisia+-Gillono-+%5BNon-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"K-Slender","files":3,"time":1380352524,"description":"Publisher: The Oliver Publishing Group; First Edition edition (2010)\nISBN-10: 0980659310\nISBN-13: 978-0980659313\n\nFirst Blood: US 1st Armored Division in Tunisia; Under the Gun 2, The Oliver Publishing Group/Firefly Collection. By: Claude Gillono with Leife Hulbert. Soft-covers, A-4 size, 34 pages. Contains 52 B&amp;W photos, six pages of color plates (including covers), one page of monochrome plates, two maps and one organization chart. ISBN 978-0-9806593-1-3. Rommels veteran Panzer-Armee Afrika fought their first major engagement with the as-yet-untried US Army in Tunisia in February of 1943. Using unimaginative tactics and suffering from an inordinately convoluted command structure, two entire US tank battalions were nearly completely wiped-out in the combat. These engagements were lumped together and are better-known as the Battle of Kasserine Pass. Luckily for the Allied cause, Rommel was unable to follow-up what has been termed his last victory, as he lacked to assets to penetrate into the rear of the Allied line. The debacle set the stage for George Patton to take command of the US II Corps when its commander, Maj.Gen. Fredendall was sacked, thereby helping to seal the fate of the Axis in North Africa. All of this and more is touched upon in the authors very concise and informative text. In typical fashion, the German Propaganda-Korps was almost immediately on the spot, recording the destruction of nearly 100 US medium tanks for home consumption in German mass media. It would appear that German troops were also allowed more latitude regarding individual ownership of cameras, so there are photos included apparently from un-official sources. Thus, there are a number of images that survive of this German drawing of First Blood from US forces. The author (a modeler himself and frequent visitor to ML) and his cohort (with many assists) have done a fine job of procuring images from several sources for the perusal of modelers. A small number have been seen before, but usually spread out amongst several different books. This book takes and combines them with a number of fresh images, often including several depicting a single AFV from multiple angles. In many cases, each image takes up an entire half of a page, and in some cases, an image fills an entire page. In all cases, small details either regarding fittings or markings can be more easily detected by the sharp-eyed reader. And, if not, the excellent captions will nudge the reader in the right direction. Overall, reproduction of the photos is very well-done, although the quality of some of the originals may have been less than optimum. Accompanying the archival images are several pages of color art work, which I presume have originated from the talented hands of Mr. Oliver, the publisher. The color plates are presented on the front and back covers and in a four-page center section. Most show individual AFVs and are limited to US types only. Seven Shermans and four half-tracks are depicted in that fashion, with a further two M3 light tanks, two half-tracks and four M3 medium tanks catered to. Full-color charts detail the regimental, battalion and company markings used by the American 1st and 13th Armored Regiments. This is followed with a single page of monochrome plates that provide information on markings for more Shermans, as well as showing details of their peculiar fittings. All plates are accompanied by comments which range from simple descriptions of what unit the AFV belonged to, to some that are rather more extensive. Other graphics include a map of the overall theater, accompanied by an insert showing smaller details. Another map, prepared by the US Army after the battle, shows the location of all the battlefield wrecks from both sides. In addition, notes were made regarding the orientation of the US and Axis forces, plus details regarding types of penetration, etc. Another page is devoted to an organization chart for the US 1st Armored Division from the highest level, down to individual light and medium tank platoons. In short, armed with this book and your choice of kit or kits, marking a properly-configured US AFV as seen during February of 1943 in Tunisia will be considerably eased. This book will prove especially useful when, as I hope (and assume), Bison Decals comes along with companion water-slide decal sheets. Frank V. De Sisto ","torrent":{"xt":"urn:btih:fb0881e14f273b2f4eec35c52b8a33401dad8a45","amp;dn":"First+Blood+-+US+1st+Armored+division+in+Tunisia+-Gillono-+%5BNon-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb0881e14f273b2f4eec35c52b8a33401dad8a45","infoHashBuffer":{"type":"Buffer","data":[251,8,129,225,79,39,59,47,78,236,53,197,43,138,51,64,29,173,138,69]},"announce":[],"urlList":[]}}