{"title":"Comedy - Frantic Times- The Radio Shows (boot to the head)","uid":4319886,"size":693064853,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:fb180519e90580697ec54772d49c25167232b679&amp;dn=Comedy+-+Frantic+Times-+The+Radio+Shows+%28boot+to+the+head%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"rambam1776","files":128,"time":1217371579,"description":"I finally got an invitation to join Demonoid, where my Google searches for torrents I cannot find here keep showing great stuff. I spent all last week grabbing comedy albums which I am now going to upload here. Other than going to the trouble of fixing tags and getting artwork and details, these torrents are as the original posters seeded them. I am not endorsing or recommending all of these. In fact, I think some of them suck. However, there is a major lack of well seeded comedy torrents here, and I hope to encourage more people to post new ones. Also, who says *MY* taste matches somebody elses? The reviews are from ALLMUSIC or from AMAZON. As usual, much thanks to the OPs who put these out and about.\n\nRambam1776\n\n\n\nTHE FRANTICS ? RADIO SHOWS\n\nThe Frantics is a Canadian comedy troupe consisting of Paul Chato, Rick Green, Dan Redican and Peter Wildman.\nThe group formed in the late 1970s. In 1981, they were given a weekly radio slot on the CBC Radio show Variety Tonight, then hosted by Vicki Gabereau. In the summer of 1982 they were the summer replacement for the Royal Canadian Air Farce. They got their own permanent time slot in the fall of 1983. Between 1981 and 1984, their show, Frantic Times, ran for 113 episodes. Each episode regularly featured a female &quot;special guest&quot;: in the earlier episodes this was Carolyn Scott; later it was Mag Ruffman. Sound effects formed an important part of the show and were generally provided by Cathy Perry, longtime CBC sound technician and later a producer at CBC.\nThe album Frantic Times was released in 1984 and collected the best sketches and songs from the radio show. In 2003, Deep Shag Records reissued the album with a new cover and three previously unreleased selections.\nIn 1986, they moved to television, producing a CBC series called Four on the Floor, which lasted only one season.\nA couple of short radio series followed, including Fran of the Fundy (a three-part spoof of Anne of Green Gables) in 1987, and the eight-part The Frantics Look at History in 1988.\nThe Frantics were noted for off-the-wall humour, with some skits and novelty songs reminiscent of The Goon Show and Monty Python?s Flying Circus. They satirized everything from suicide hotlines to current ads to Tom Swift science fiction. They were particularly known for the recurring character Mr. Canoehead, a crime fighter with a full-sized aluminum canoe welded to his head by lightning (battle cry: &quot;Taste gunwales!&quot;), and for the catch phrase ?Boot to the head!? which is also the title of their most famous song.\nSome of The Frantics? radio sketches were also aired in the United States on the Dr. Demento show, as were later Canadian comedy acts such as The Arrogant Worms and The Vestibules.\nIn 2004 the troupe reformed, returning to stage with a mix of new and old material which was released on CD in the form of the Official Bootleg CD: Live at the Tim Sims Playhouse. Following the success of their Older But Wider stage tour in Ontario, The Frantics filmed a comedy special for the Canadian Comedy Network/CTV in 2005 entitled The Frantics Reunion Special, which aired on January 28, 2006. They also appeared at the 2005 Winnipeg Comedy Festival, which was broadcast on the CBC Festival of Funny radio show. That marked their first ever on-air reunion since 1988. They also appeared in the Gala of the festival, which aired on CBC television in March 2006.\nRecent engagements include live performances at the Jane Mallett Theatre in Toronto (St. Lawrence Centre for the Arts), featuring a mix of new and revived material.\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Frantics_%28comedy%29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Frantics_%28comedy%29&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:fb180519e90580697ec54772d49c25167232b679","amp;dn":"Comedy+-+Frantic+Times-+The+Radio+Shows+%28boot+to+the+head%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb180519e90580697ec54772d49c25167232b679","infoHashBuffer":{"type":"Buffer","data":[251,24,5,25,233,5,128,105,126,197,71,114,212,156,37,22,114,50,182,121]},"announce":[],"urlList":[]}}