{"title":"[REQ] Roughing It 2002 NTSC DVD5 VIDEO TS greenbud1969","uid":11082644,"size":4509231104,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fb6f8421a0ce24b181fd4df61d15d993cacbbfb9&amp;dn=%5BREQ%5D+Roughing+It+2002+NTSC+DVD5+VIDEO+TS+greenbud1969&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"greenbud1969","files":-1,"time":1411426555,"description":"[REQ] Hallmark Mark Twains Roughing It 2002 NTSC DVD5 VIDEO TS greenbud1969\n\n\nIMDb Link: http://www.imdb.com/title/tt0290280/\n\n\nCast\n\nAdam Arkin\nRobin Dunne\nEric Roberts\nNed Beatty\nJames Garner\n\n\nSynopsis\n\nWhen I was younger I could remember anything, whether it happened or not.&quot;- Mark Twain\n\nEven success hasn't made Samuel Clemens (Oscar nominee, Emmy and Golden Globe winner James Garner, Breathing Lessons) a happy man. Instead of devoting his talent to &quot;serious matters&quot; he's wasted them on yarns- as Mark Twain, a mere humorist. Now, asked to speak to Bryn Mawr's graduating class of 1891, he's filled with dread. His wife Lucy (Golden Globe winner Jill Eikenberry, L.A. Law) has faith in him- as a loving husband, a devoted father, and an extraordinary writer.\n\nHe needn't have worried. In front of an enraptured crowd, the masterful story teller unfolds the tale of a polite greenhorn (Robin Dunne, The Circle, as a young Sam) from the East initiated into the rough and tumble society of the raw Western frontier.\n\nFeaturing an all star cast including Emmy nominee Adam Arkin (Northern Exposure), Oscar and Golden Globe nominee Eric Roberts (The Odyssey), Charles Martin Smith (P.T. Barnam), and Oscar, Emmy and Golden Globe nominee Ned Beatty (Gulliver's Travels), Roughing It is the heartwarming, thrilling, and somewhat truish story of how a man named Samuel Clemens became known to the world as Mark Twain.\n\n\nYear.............: 2002\nRuntime..........: 185 Minutes\nAudio............: English AC3 2.0\nSubtitles........: None\nVideo Format.....: NTSC\nAspect Ratio.....: 4:3 720x480\nFile Size........: 4.19 GB\n\nall extras included...\neverything Completely Untouched...\n\n\nGREETZ\n\n\nBlackjesus, Hive-CM8, ViP3R, THC, SANTi, CRYS, AQOS, EVO, playXD, SuperNova, MiLLENiUM, MAJESTiC, FUM, AFG and respect to all pirate groups and encoders past and present. Sharing is caring.\n\n\nALSO IF YOU HAVE ANY REQUESTS DON'T HESITATE TO ASK. I MIGHT HAVE WHAT YOUR LOOKING FOR. YOU NEVER KNOW. IT NEVER HURTS TO ASK. EMAIL ME AT greenbud1969 AT hotmail dot com OR LEAVE REQUESTS IN COMMENTS.","torrent":{"xt":"urn:btih:fb6f8421a0ce24b181fd4df61d15d993cacbbfb9","amp;dn":"%5BREQ%5D+Roughing+It+2002+NTSC+DVD5+VIDEO+TS+greenbud1969","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb6f8421a0ce24b181fd4df61d15d993cacbbfb9","infoHashBuffer":{"type":"Buffer","data":[251,111,132,33,160,206,36,177,129,253,77,246,29,21,217,147,202,203,191,185]},"announce":[],"urlList":[]}}