{"title":"Wireless Reconnaissance in Penetration Testing","uid":8455573,"size":14259308,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fbb3fcbc6c1a4990cc59aaa5d0dc0395ec07ab08&amp;dn=Wireless+Reconnaissance+in+Penetration+Testing&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"d347hBy73","files":-1,"time":1368057858,"description":"Wireless Reconnaissance in Penetration Testing\n\nBook Details:\n\nPages: 226 pages\nPublisher: Syngress (October 2012)\nLanguage: English\nISBN-10: 1597497312\nISBN-13: 978-1597497312\nFormat: PDF\n\nBook Description:\n\nIn many penetration tests, there is a lot of useful information to be gathered from the radios used by organizations. These radios can include two-way radios used by guards, wireless headsets, cordless phones and wireless cameras. Wireless Reconnaissance in Penetration Testing describes the many ways that a penetration tester can gather and apply the information available from radio traffic. Stopping attacks means thinking like an attacker, and understanding all the ways that attackers gather information, or in industry terms profile, specific targets. With information from what equipment to use and how to find frequency information, to tips for reducing radio information leakage, to actual case studies describing how this information can be used to attack computer systems, this book is the go-to resource for penetration testing and radio profiling.\n\nAuthor Matthew Neely is a respected and well-known expert and speaker on radio reconnaissance and penetration testing\nIncludes real-world case studies of actual penetration tests using radio profiling\nCovers data leakage, frequency, attacks, and information gathering\n\nTable of Contents\nChapter 1. Why Radio Profiling?\nChapter 2. Basic Radio Theory and Introduction to Radio Systems\nChapter 3. Targets (Wireless Headsets, Guard Radios, Wireless Cameras, etc.)\nChapter 4. Offsite Profiling\nChapter 5. Offsite Profiling Case Study\nChapter 6. Onsite Profiling\nChapter 7. Onsite Profiling Case Study\nChapter 8. How to Use the Information You Gather\nChapter 9. Basic Overview of Equipment and How It Works\nChapter 10. Case Study to Pull It All Together\nChapter 11. New Technology and the Future of Radios in Penetration Testing\n\n","torrent":{"xt":"urn:btih:fbb3fcbc6c1a4990cc59aaa5d0dc0395ec07ab08","amp;dn":"Wireless+Reconnaissance+in+Penetration+Testing","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fbb3fcbc6c1a4990cc59aaa5d0dc0395ec07ab08","infoHashBuffer":{"type":"Buffer","data":[251,179,252,188,108,26,73,144,204,89,170,165,208,220,3,149,236,7,171,8]},"announce":[],"urlList":[]}}