{"title":"Chapter 27/ Capitulo 27 +Legenda em Potugues","uid":4470678,"size":1172993023,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fbe36f453c0fb0624b0a02ee67526cb6e75a5f99&amp;dn=Chapter+27%2F+Capitulo+27+%2BLegenda+em+Potugues&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"shigueo","files":3,"time":1225118667,"description":"Chapter 27 is an independent film depicting the murder of John Lennon by Mark David Chapman, starring Jared Leto and Lindsay Lohan. It was written and directed by J. P. Schaefer. The film premiered at the Sundance Film Festival in January 2007 and the Berlin Film Festival in February. It received mostly negative reviews, although it did receive positive notices in Salon, The Hollywood Reporter, and Entertainment Weekly.\n\nThe film initially failed to land a U.S. distributor, but was picked up for theatrical distribution in Europe, Asia, and South America. The film was leaked onto the internet on March 23, 2007. The film saw US theatrical release in March 2008 and won the Debut Feature Prize award for Schaefer at the Zurich Film Festival[3]. In Entertainment Weekly&amp;#039;s 2008 Spring movie preview for Chapter 27, the movie was finally listed for release on March 28, 2008. [4] However, the movie&amp;#039;s release was limited. The film was rated R for language and some sexual content\n\n\n\nChapter 27 ÃƒÂ© um filme canadense independente de 2007 do gÃƒÂªnero Drama, escrito e dirigido por J. P. Schaefer. Conta os trÃƒÂªs dias que Mark David Chapman esperou por John Lenonn, atÃƒÂ© assassinÃƒÂ¡-lo com tiros de revÃƒÂ³lver em frente ao EdifÃƒÂ­cio Dakota em Nova Iorque, residÃƒÂªncia do cantor. O filme foi lanÃƒÂ§ado em Janeiro de 2007 no Festival de Sundance e em fevereiro, no Festival de Berlim. Jared Leto engordou bastante para fazer o papel de Mark Chapman. JÃƒÂ¡ Lindsay Lohan concordou em participar dada a sua amizade com Sean Lennon, embora este nÃƒÂ£o tenha gostado da idÃƒÂ©ia","torrent":{"xt":"urn:btih:fbe36f453c0fb0624b0a02ee67526cb6e75a5f99","amp;dn":"Chapter+27%2F+Capitulo+27+%2BLegenda+em+Potugues","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fbe36f453c0fb0624b0a02ee67526cb6e75a5f99","infoHashBuffer":{"type":"Buffer","data":[251,227,111,69,60,15,176,98,75,10,2,238,103,82,108,182,231,90,95,153]},"announce":[],"urlList":[]}}