{"title":"Comrades of War - Hassel Sven","uid":8743822,"size":621469,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fc3167995ed8ef8968d0019626c89fc60efc1545&amp;dn=Comrades+of+War+-+Hassel+Sven&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Enkhsaikhan","files":-1,"time":1374866282,"description":"Hassel said that he was born as Sven Pedersen at Frederiksborg, Zealand, Denmark, and later adopted his mother's maiden name, Hassel. At the age of 14 he joined the merchant navy as a cabin boy and worked on ships until his military service in 1936. In 1937, to escape the Great Depression, the unemployed Hassel moved to Germany to join the army. In an interview in 1990, he said, &quot;Germany happened to be closer than England, I went to a Wehrmacht recruiting office to enlist, but it wasn't as easy as I had thought. Only German citizens could serve. After six months of trying to join up, the Seventh Cavalry Regiment finally accepted me on the condition that I became a naturalized German.&quot;\nHassel served with the 2nd Panzer Division stationed at Eisenach and in 1939 was a tank driver during the invasion of Poland.[citation needed] A year later he attempted to escape. He served with the 2nd Cavalry Regiment and later the 11th and 27th Panzer Regiments (6th Panzer Division) on all fronts except North Africa and was wounded several times. Eventually he reached the rank of lieutenant and received an Iron Cross 1st and 2nd class. He surrendered to Soviet troops in Berlin in 1945 and spent the following years in various POW camps. He began to write his first book, Legion of the Damned while he was interned.\nHe was released in 1949 and was planning to join the French Foreign Legion when he met Dorthe Jensen, whom he married in 1951. He went to work in a car factory, but his wife encouraged him to continue to write about his experiences. Legion of the Damned was published in 1953. In 1957 Hassel suffered from an attack of a sickness caught during the war and was paralyzed for almost two years. After recovery, he began to write more books. In 1964 he moved to Barcelona, Spain, where he lived until his death. In total he published 14 novels which have been translated into 18 languages. In 1987 his book Wheels of Terror was made into a film titled The Misfit Brigade.","torrent":{"xt":"urn:btih:fc3167995ed8ef8968d0019626c89fc60efc1545","amp;dn":"Comrades+of+War+-+Hassel+Sven","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc3167995ed8ef8968d0019626c89fc60efc1545","infoHashBuffer":{"type":"Buffer","data":[252,49,103,153,94,216,239,137,104,208,1,150,38,200,159,198,14,252,21,69]},"announce":[],"urlList":[]}}