{"title":"The Health Wyze Report - Episode 29","uid":8296334,"size":32843421,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:fc379b88ccb6fe736fb09fc6a106d582b7102df6&amp;dn=The+Health+Wyze+Report+-+Episode+29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mandalasarah","files":-1,"time":1364151856,"description":"The Omega Connection\n\nIn this audio show, we discuss what happens when a pharmaceutical company decides to improve a vitamin.  We expose most of the survivalist food packages for being fraudulent, and discuss the importance of proteins in a true survival situation.  We talk about how pet foods often contain vegetables and grains, and we warn pet owners about irradiated pet treats.  We talk about how U.S. media companies have been attacked by the Chinese government, and what the U.S. government is really doing behind the scenes.\n\nWe discuss the new trend of foolishly using krill oil for omega-3 supplementation, and how it is being shamelessly advocated by Dr. Joseph Mercola.  We warn listeners about shellfish, and we explain why flax seed oil is the only safe way to obtain omega balance.  We talk about rancid oils and Johanna Budwig's research concerning how these oils prevent the cells from getting oxygen, which ironically includes most omega supplements.  We discuss the upcoming U.S. socialized health care system and its sneak provision that is designed to eliminate private insurance companies.  We then mention some disturbing behaviors from Alex Jones, which cause us to doubt that he is still trustworthy.\n\n\nFor more information, or to browse the complete audio archive, then visit us at: http://healthwyze.org","torrent":{"xt":"urn:btih:fc379b88ccb6fe736fb09fc6a106d582b7102df6","amp;dn":"The+Health+Wyze+Report+-+Episode+29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc379b88ccb6fe736fb09fc6a106d582b7102df6","infoHashBuffer":{"type":"Buffer","data":[252,55,155,136,204,182,254,115,111,176,159,198,161,6,213,130,183,16,45,246]},"announce":[],"urlList":[]}}