{"title":"Dragon Age: Origins &amp; DLC &amp; Soundtrack (Multilanguage)","uid":10165902,"size":22231543204,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:fc3a1395c2d21980c34e8f727bb08f91b7840a95&amp;dn=Dragon+Age%3A+Origins+%26amp%3B+DLC+%26amp%3B+Soundtrack+%28Multilanguage%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"duchos","files":95,"time":1400344573,"description":"From BioWare, the makers of Mass Effect, Star Wars: Knights of the Old Republic, and Baldur's Gate comes Dragon Age: Origins. An epic tale of violence, lust, and betrayal, Dragon Age: Origins is a single player role-playing game (RPG) set in a fantasy game environment, and featuring three playable character classes, accessible in the form of three races. In addition, the game features extreme character customization, a new game engine, party-based gameplay utilizing non-player characters and a built-in personal history system for each hero character rooted in a variety of possible origin stories.\n\nStory:\nIn Dragon Age: Origins the survival of humanity rests in the hands of those chosen by fate. You are a Grey Warden, one of the last of an ancient order of guardians who have defended the lands on the continent of Thedas throughout the centuries. Betrayed by a trusted general in a critical battle, you must hunt down the traitor and bring him to justice. As you fight your way towards the final confrontation with an evil nemesis, you will face monstrous foes and engage in epic quests to unite the disparate peoples of a world at war. A romance with a seductive shapeshifter may hold the key to victory, or she may be a dangerous diversion from the heart of your mission. To be a leader, you must make ruthless decisions and be willing to sacrifice your friends and loved ones for the greater good.\n\nGameplay:\nDragon Age: Origins is a 3D oriented RPG based in a dark, heroic, fantasy realm where moral choices have a lasting impression on the people you meet, the members of your own party and the world around you. The inclusion of subtitle &quot;Origins&quot; in the game's title refers to the six unique origin stories available to new heroes as a new game begins. Each of these has an impact on the player's motivations and his or her experience, and renders a unique prelude, path, and possible ending(s) to the game. There are many different endings to the game based on the origin story of the character and the choices you make as you play through the game. The game features three character classes--warrior, mage, and rogue--and three races of being--Human, Elf or Dwarf--that can assume these classes. Although most game elements, such as weapons, magic, etc., are available to any character, each class and race has different strengths, abilities and affinities which lend themselves to better utilizing different elements.\n\nDragon Age: Origins is a single player game based on party-based gameplay and combat where the player can join, control and quest with up to three non-player characters (NPCs). Players can also quest alone if they so choose, but with the chance of survival are slim. Convincing NPCs to join you, and treating them well may be necessary depending on the varying sentiments between the player and the NPC, or between the NPC's in the party based on the chosen history written into the origin story accepted at the beginning of the game. This uncertainty allows for a variety of possible dynamics within the party ranging from open hostility, all the way to romance. The game progresses in real-time via a pause-and-play tactical combat system that allows the player to check inventory levels, equip a character, etc. in a slight vacuum. Additional features found in the game include: a combination of a standard loot system and a currency system based on gold silver and copper; advanced character customization functionality; the use of poison, traps and herbalism; dual-wielding skills; and &quot;spell combos,&quot; which allow players to chain together different spells to create a unique effects.\n\n\nSystem Requirements:\n\nOs - Windows XP with SP3 / Vista with SP1 / 7 / 8\nCPU - Intel Core 2 1.4Ghz or Intel Core 2 Quad 2.4Ghz\nRAM - 4 GB\nHDD - 20GB +\nVideo - NVIDIA 8800GTS 512 MB / ATI 3850 512 MB\n\n\nInstalling add-ons:\n\n1. Run daupdater.exe is in the main game directory\n2. Choose a DLC that you want to install.\n3. Click &quot;Install&quot; and wait while.\n4. Now run decrypt_all_update6 and wait for end.\n5. Go to My Documents/BioWare/Dragon Age/Settings and edit addins.xml file.\n6. Search RequiresAuthorization=&quot;1&quot; and change all &quot;1&quot; to &quot;0&quot;\n7. Play :)\n\n\nInfo:\nDragon Age: Origins is a Multilanguage version. All the DLC are included separately. Decrypter added.","torrent":{"xt":"urn:btih:fc3a1395c2d21980c34e8f727bb08f91b7840a95","amp;dn":"Dragon+Age%3A+Origins+%26amp%3B+DLC+%26amp%3B+Soundtrack+%28Multilanguage%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc3a1395c2d21980c34e8f727bb08f91b7840a95","infoHashBuffer":{"type":"Buffer","data":[252,58,19,149,194,210,25,128,195,78,143,114,123,176,143,145,183,132,10,149]},"announce":[],"urlList":[]}}