{"title":"20th Century Masters - The Best of Joan Armatrading","uid":6787732,"size":368743962,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:fd47eded5e06f154d7521f904634fa4de4260ce3&amp;dn=20th+Century+Masters+-+The+Best+of+Joan+Armatrading&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cdda-flac","files":-1,"time":1320158931,"description":"\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/61xiHskJK1L.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/61xiHskJK1L.jpg&lt;/a&gt;\n\n\nTitle: 20th Century Masters - The Millennium Collection: The Best of Joan Armatrading\nArtist: Joan Armatrading\nAudio CD (February 13, 2006)\nOriginal Release Date: August 29, 2000\nNumber of Discs: 1\nGenre: Folk/Rock\nFormat: Free Lossless Audio Codec\n\n\nTrack Listing:\n\n01. Drop the Pilot\n02. Me Myself I\n03. Down to Zero\n04. I'm Lucky\n05. (I Love It When You) Call Me Names \n06. The Weakness in Me\n07. Rosie\n08. All the Way from America\n09. Show Some Emotion\n10. Cool Blue Stole My Heart\n11. Willow\n12. Love and Affection\n\n\nAllmusic Review:\nThe Joan Armatrading entry in Universal's discount-priced compilation series 20th Century Masters -- The Millennium Collection is a reduction of the 1996 Greatest Hits set, containing 12 of its predecessor's 19 tracks. Concentrating on the 1975-1983 period of the singer/songwriter's career and culling tracks from six of her 13 studio albums for A&amp;M Records (plus one song from an EP), the retrospective is faced with the challenge of integrating Armatrading's stylistic shifts during the period. Her '70s albums, produced by Gus Dudgeon and Glyn Johns, were folk-pop efforts that brought her a fervent cult following, but in the '80s she turned to more rock-oriented producers Richard Gottehrer and Steve Lillywhite, and made records that reflected the influence of new wave music. Compilation producer Mike Ragogna deals with this by sequencing the material in roughly reverse chronological order, so that it begins with the hard-rocking numbers &quot;Drop the Pilot&quot; and &quot;Me Myself I&quot; and ends with the folkie ballads like &quot;Willow&quot; and &quot;Love and Affection.&quot; In either style, Armatrading proves to be a versatile alto singer and an original, affecting songwriter, equally accomplished at sensitive tales of romantic conflict like &quot;The Weakness in Me&quot; and tongue-in-cheek satires like &quot;I Love It When You Call Me Names,&quot; which starts out sounding like a first-person account of female masochism, only to turn out to be the ardent plea of a &quot;short, short man&quot; to his favorite dominatrix. (&quot;It's their way of loving, not mine,&quot; the songwriter finally pipes up.) Although it contains some of Armatrading's best-known songs, the album is only a sampler. It may serve as a modestly priced way for neophytes to get a sense of her work, but those who are already fans will find it an inadequate summing up of her recording career.","torrent":{"xt":"urn:btih:fd47eded5e06f154d7521f904634fa4de4260ce3","amp;dn":"20th+Century+Masters+-+The+Best+of+Joan+Armatrading","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd47eded5e06f154d7521f904634fa4de4260ce3","infoHashBuffer":{"type":"Buffer","data":[253,71,237,237,94,6,241,84,215,82,31,144,70,52,250,77,228,38,12,227]},"announce":[],"urlList":[]}}