{"title":"Active UNDELETE 7.0.047","uid":4162707,"size":9478989,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:fdbca8012dd4c7afb005fa091f21197beb2b05b9&amp;dn=Active+UNDELETE+7.0.047&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ProjectMimic","files":6,"time":1209451160,"description":"Active @ UNDELETE - Data Recovery is a powerful data recovery software that helps you to recover deleted files, lost and formatted data from hard drives, floppy disks, basic and dynamic volumes, hardware or software RAID.\nSoftware supports: NTFS, FAT32, FAT16, NTFS5, NTFS+.EFS file systems and works under all Windows family operating systems: Windows 95, Windows 98, Windows Me, Windows nt, Windows 2000, Windows 2003 server, Windows xp and Windows vista.\nBesides hard disk drives program supports recovery from removable devices like Secure Digital, Compact Flash, SmartMedia, SONY Memory Stick, ZIP drives, USB Hard drives etc...\n\nActive @ UNDELETE Professional &amp; Enterprise installation packages contain a cd/dvd ISO image that you can burn to get a bootable CD or DVD with a lightweight version of Windows vista (c) running in ram (WinPE 2.0).\nIt is the only way to recover your data in the case that your system is not bootable and you cannot attach the damaged Hard Disk Drive to another computer. After booting from the CD/DVD you will see a Windows environment with Networking, so you can either just recover your data (copy files to a usb drive or Network drive).\nMany other useful utilities are included besides data recovery utilities: Web Browser, File Manager (similar to Window Explorer), Terminal Client, Partition Manager, Notepad, Task Manager, Command Prompt, Network Drive Mapper, etc...\n\nActive @ UNDELETE Enterprise Edition has advanced capabilities to access and perform data recovery on remote machines, as well as supports data recovery from RAID: Spanned, Mirrored (Raid-1), Stripped (Raid-0) and Raid-5 Volumes.","torrent":{"xt":"urn:btih:fdbca8012dd4c7afb005fa091f21197beb2b05b9","amp;dn":"Active+UNDELETE+7.0.047","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fdbca8012dd4c7afb005fa091f21197beb2b05b9","infoHashBuffer":{"type":"Buffer","data":[253,188,168,1,45,212,199,175,176,5,250,9,31,33,25,123,235,43,5,185]},"announce":[],"urlList":[]}}