{"title":"Southern Hospitality ( NEW 2014 SKOW FOR GIRLFRIENDS FILMS ) [ D","uid":11194004,"size":1193028853,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:fe1dcce185bfa85202dcad825b53c08556f7d53f&amp;dn=Southern+Hospitality+%28+NEW+2014+SKOW+FOR+GIRLFRIENDS+FILMS+%29+%5B+D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TechLatina","files":-1,"time":1413052015,"description":"Southern Hospitality ( NEW 2014 SKOW FOR GIRLFRIENDS FILMS ) [ DVD RIP ALL 4 SPLIT SCENES ]\n\n\n\n\nCAST\nDillion Harper, Ash Hollywood, Darla Crane, Alex Chance\n\n\n\nDESCRIPTION\nJon Ho is married to three brides -- Small, Medium and Large. On the night of his third wedding, Medium, his second wife, starts getting jealous. As this is happening, a criminal family of moonshiners known as the Fuggs -- made up of Mama Fugg, her three sons, Teeny, Tiny and Mighty -- on the run from the law, make their way onto Jon Jo's thirty acres of woodlands to set up camp and hide from capture. Medium catches sight of Tiny, bathing outside and masturbates to him. As she does, she is caught by out with a log. Medium and Tiny then go on the run, fall in love, and hide in the woods, hoping to escape both their families so they can elope. Meanwhile, Large and Small go out trying to find Medium. They argue and split up to cover more ground. Small runs afoul of Teeny and Mighty and they take her virginity (Jon Jo and Small still having not consummated their wedding night). Large attempts to save Small, but has to make a deal with Mama Fugg in order to do so by having sex with her. Large and Small go back to the house. Jon Jo finds out that Small has been deflowered and goes after the Fuggs himself. He gets caught by them and forced to make a deal. If he wants to live, he had to let the Fuggs live on his land, keep them safe from cops, and help them make moonshine. Seeing a financial opportunity (as well as a way from getting himself killed), Jon Jo agrees. And they drink moonshine to celebrate the arrangement. Jon Jo winds up getting so drunk that he proposes to Mama Fugg in a fit of inebriated madness. At the wedding, Small shoots Teeny and Mighty dead and Tiny shoots Mama Fugg as well. Large, Small and Medium all leave Jon Jo. Medium and Tony Fugg get married to each other and Large and Small begin a relationship of their own.\n\n &lt;a href=&quot;\nhttp://bayimg.com/LabbOaAga&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/LabbOaAga&lt;/a&gt;","torrent":{"xt":"urn:btih:fe1dcce185bfa85202dcad825b53c08556f7d53f","amp;dn":"Southern+Hospitality+%28+NEW+2014+SKOW+FOR+GIRLFRIENDS+FILMS+%29+%5B+D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe1dcce185bfa85202dcad825b53c08556f7d53f","infoHashBuffer":{"type":"Buffer","data":[254,29,204,225,133,191,168,82,2,220,173,130,91,83,192,133,86,247,213,63]},"announce":[],"urlList":[]}}