{"title":"Russian Short Stories &amp; Magic Tales (Penguin Classics)","uid":11101324,"size":5877026,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fe584a730e86f5b7856cec98274625d60252b388&amp;dn=Russian+Short+Stories+%26amp%3B+Magic+Tales+%28Penguin+Classics%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"workerbee","files":-1,"time":1411674035,"description":"\n* RUSSIAN MAGIC TALES FROM PUSHKIN TO PLOTONOV (Penguin Classics, 2012).  Edited by Robert Chandler.  448 pp. -- ePUB + MOBI\n\n* RUSSIAN SHORT STORIES FROM PUSHKIN TO BUIDA (Penguin Classics, 2005).  Edited by Robert Chandler.  656 pp. -- ePUB + MOBI\n\n\nTwo anthologies edited by the poet and translator Robert Chandler:\n\nRUSSIAN SHORT STORIES covers two centuries of Russian literary tradition, from the early nineteenth century to the collapse of the Soviet Union and beyond, and includes not only well-known classics but also modern masterpieces -- many of them previously censored.  It features an introduction to the history of the Russian short story, prefaces to the individual writers, chronology, explanatory notes, and suggestions for further reading.\n\nIn RUSSIAN MAGIC TALES, young women go on long and perilous quests, wicked stepmothers turn children into geese, and tsars ask dangerous riddles, with help or hindrance from magical dolls, cannibal witches, talking skulls, stolen wives, and brothers disguised as wise birds.  Some of the stories here were collected by folklorists during the last two centuries, while the others are reworkings of oral tales by four of the greatest writers in Russian literature: Nadezhda Teffi, Pavel Bazhov, Andrey Platonov, and Alexander Pushkin, author of Eugene Onegin, the classic Russian novel in verse.  Among the many classic stories included here are the tales of Baba Yaga, Vasilisa the Beautiful, Father Frost, and the Frog Princess.\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                                       &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n","torrent":{"xt":"urn:btih:fe584a730e86f5b7856cec98274625d60252b388","amp;dn":"Russian+Short+Stories+%26amp%3B+Magic+Tales+%28Penguin+Classics%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe584a730e86f5b7856cec98274625d60252b388","infoHashBuffer":{"type":"Buffer","data":[254,88,74,115,14,134,245,183,133,108,236,152,39,70,37,214,2,82,179,136]},"announce":[],"urlList":[]}}