{"title":"Formula 17","uid":3875215,"size":630687744,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:fe94c14fac9b3215cc77b425f19eb052473857ff&amp;dn=Formula+17&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pure260231","files":1,"time":1194310391,"description":"FORMULA 17 (17 Sui De Tian Kong) \n\nAspect ratio: 1.85:1\n\nSound format: Dolby Digital\n\nEvents conspire to frustrate the budding romance between a naive country boy (Tony Yang) searching for love in Taipei, and a local stud (Duncan Chow) notorious for his sexual conquests.\n\nA smash hit in its native Taiwan, this breezy romantic comedy was the inaugural production of Three Dots Entertainment, an independent studio committed to the production of commercial genre movies, and was directed by first-timer Chen Yin-jung (aka DJ Chen), a 23 year old graduate of Yuan Ze University. To her credit, Chen tackles the film&amp;#039;s subject matter head-on and refuses to cut away when the two guys at the center of Rady Fu&amp;#039;s old-fashioned screenplay finally - inevitably - get it on. Yang and Chow maintain a respectful distance from one another at first, each afraid to make that crucial leap of faith, until Yang finally turns up on Chow&amp;#039;s doorstep and sighs: &quot;Let&amp;#039;s stop pretending, it&amp;#039;s tiring&quot;, leading to the film&amp;#039;s central sex scene, a tasteful affair with lots of kissing and fumbling and raunchy good intentions. Much of the running time, however, is given over to various comic interludes involving Yang&amp;#039;s newfound friends (Jin Qin, Dada Ji and Jimmy Yang), a trio of outrageous queens who insist on making a melodrama out of the tiniest crisis. Unfortunately, the comedy is forced and unfunny and a little too excessive at times, but the central love story yields its fair share of tender rewards.\n\nAs a vehicle for its ultra-sexy leading men, FORMULA 17 is hard to beat: Yang and Chow (the latter billed simply as &amp;#039;Duncan&amp;#039;) achieved teen idol status in popular Taiwanese TV dramas, where they both played wholly conventional roles. Here, Yang is a childlike innocent searching for True Love, and Chow is a beautiful playboy whose reputation belies his own desperate search for emotional fulfilment. Standout scenes include a comic episode in which Jin and co. set up Yang with a hunky prostitute (Yang Zhi-long) who turns up at Our Hero&amp;#039;s apartment posing as a plumber, in a scenario lifted wholesale from countless porn videos; and an early sequence in which Yang and Chow bump into one another while standing at a busy crossroads, where their hesitant overtures are kindled by an elderly gent standing alongside them, who despairs of their reluctance to acknowledge a mutual attraction (this scene has a *very* gay conclusion!). Chen allows the pace to slacken during dialogue exchanges (the bulk of the movie!), which takes some of the fizz out of proceedings, but the film has a virtuous heart and builds to a joyous conclusion which - along with the cute guys and up-front sexuality - probably bolstered its commercial fortunes at the Taiwanese box-office. Production-wise, Chen makes the most of her limited resources, and she&amp;#039;s well-served by Chen Huei-sheng&amp;#039;s imaginative cinematography, and Zack Gu&amp;#039;s designer-label art direction/costume design (leading to the movie&amp;#039;s biggest laugh, when Yang pronounces &amp;#039;Gucci&amp;#039; as &amp;#039;juicy&amp;#039;!).","torrent":{"xt":"urn:btih:fe94c14fac9b3215cc77b425f19eb052473857ff","amp;dn":"Formula+17","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe94c14fac9b3215cc77b425f19eb052473857ff","infoHashBuffer":{"type":"Buffer","data":[254,148,193,79,172,155,50,21,204,119,180,37,241,158,176,82,71,56,87,255]},"announce":[],"urlList":[]}}