{"title":"Stiletto Dance [2001] Eric Roberts","uid":6766225,"size":733313692,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:febf05f826b9f98cb0b1b4cb8c029073a49a55ea&amp;dn=Stiletto+Dance+%5B2001%5D+Eric+Roberts&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ThorntonWilde","files":-1,"time":1319395711,"description":" &lt;a href=&quot;http://bayimg.com/iAkpgaAdj&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/iAkpgaAdj&lt;/a&gt;\n\nStiletto Dance (TV 2001) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0287730/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0287730/&lt;/a&gt;\n\nStiletto Dance is about A cop named Kit Adrian (Roberts) who infiltrates the Russian mob, only to be swept up in a deadly love triangle with Lena (Lucie Laurier) and his partner.\n\n  Eric Roberts  ...  Kit Adrian  \n  Romano Orzari  ...  Jay Flowers  \n  Shawn Doyle  ...  Anton Seaberg  \n  Brett Porter  ...  Rolfe  \n  Lucie Laurier  ...  Lena  \n  Yaphet Kotto  ...  Captain Rick Sands  \n  Peter Batakliev  ...  Binky Zotov  \n  Louis Ferreira  ...  James Launcher (as Justin Louis)  \n  Mark Camacho  ...  Rick Tucci  \n  Stephanie Biddle  ...  Daria  \n\nThe movie is a lot of fun. It has everything: pervasive swearing, brutal Russian mob violence and a cool performance from the master of Ham: Eric Roberts! Yaphet Kotto makes an appearance as the chief of police. His role is made up of exposition, but he puts in his usual professionalism. \n\nEric Roberts tears a page out of the William Friedkin manual in this tale of two undercover cops police monitoring a multi-million dollar nuclear arms deal among the Russian mob and other criminal organizations.\n\nFans of Friedkin's To Live and Die in L.A. will find some resonance here. That film was based on a novel by Gerald Petievich, about determined but rule-breaking Treasury agents out to topple a counterfeiter with the artist's touch. Stiletto Dance is about two undercover cops who also bend the rules, one also dominating the other, and whose fates are somewhat similar to the two guys in the Friedkin film, though the milieu is different.\n\nStiletto Dance is a Canadian film pretending to take place in America (you see the occasional American flag outside houses), but it feels like a straight to video film: i.e., shaky but predictable plot, but lots of sex and violence. Eric Roberts is Kit Adrian. It kind of spoils the plot surprise to say that he is in fact an undercover cop, but he starts out as a jail bird who ends up with a buddy (fellow cop Jay Flowers, played by Romano Orzari) working for Russian mobster Anton Seaberg (Shawn Doyle, one of those good movie villains, whose running gag is that he hates getting blood on his expensive suits). After a series of &quot;tests,&quot; Kit and Jay prove their worth to Anton, while Anton's enforcer Rolfe (Brett Porter), who wields a ghastly and rather huge knife that puts you in mind of something a Norse giant might carry, remains suspicious. He has cause. Kit soon starts an affair with Rolfe's wife, Lena (Lucie Laurier). Lena is the film's Mia Wallace. You're not meant to mess with her, but of course Kit does. This being a Canadian movie meant for HBO, there are good sex scenes between her and Roberts, scenes unashamed of female nudity. In their off hours, Anton and his two new employees spend their time at one of those fun-looking discos you only see in movies, filled with transvestites, models, dominatrixes, and gun-wielding Ruskies.\n ","torrent":{"xt":"urn:btih:febf05f826b9f98cb0b1b4cb8c029073a49a55ea","amp;dn":"Stiletto+Dance+%5B2001%5D+Eric+Roberts","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"febf05f826b9f98cb0b1b4cb8c029073a49a55ea","infoHashBuffer":{"type":"Buffer","data":[254,191,5,248,38,185,249,140,176,177,180,203,140,2,144,115,164,154,85,234]},"announce":[],"urlList":[]}}