{"title":"Carol Berg - Rai-Kirah Trilogy","uid":6315150,"size":4995089,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ff4b501b56e1986fe57d31dfacdc0e060202ff13&amp;dn=Carol+Berg+-+Rai-Kirah+Trilogy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"requiem_for_a_devil","files":3,"time":1302680409,"description":"Transformation\nSeyonne is a man waiting to die. He has been a slave for sixteen years, almost half his life, and has lost everything of meaning to him: his dignity, the people and homeland he loves, and the Warden\\\\\\'s power he used to defend an unsuspecting world from the ravages of demons. Seyonne has made peace with his fate.  With strict self-discipline he forces himself to exist only in the present moment and to avoid the pain of hope or caring about anyone. But from the moment he is sold to the arrogant, careless Prince Aleksander, the heir to the Derzhi Empire, Seyonne\\\\\\'s uneasy peace begins to crumble. And when he discovers a demon lurking in the Derzhi court, he must find hope and strength in a most unlikely place... \n\nRevelation\nTwo years after his battle with the Lord of Demons, Seyonne is tired, troubled, angry, and frustrated. As Ezzaria\\\\\\'s only remaining Warden, he carries the entire burden of the worsening demon war on his shoulders. But a demon encounter unlike any in Ezzarian memory leads Seyonne to question everything he has ever believed. And his search for a demon-possessed child becomes the search for his own soul and the soul of his people. \n\nRestoration\nIn the Third Book of the Rai-kirah, Seyonne is besieged by doubt, madness, and visions that insist that he will destroy the world. Even his steadfast hope, that somehow Prince Aleksander is destined for greatness, seems doomed. For a royal murder sends Aleksander on the run as the Derzhi Empire crumbles around him. Faith, friendship, gods and demons drive sorcerer and prince to the final battle of the demon war--each man facing an opponent he could never have imagined.\n\n3 PDF files converted from .lit format\t\n\nRe-uploaded, and reformatted. Still not perfect, but if you want perfect, buy the actual book xD","torrent":{"xt":"urn:btih:ff4b501b56e1986fe57d31dfacdc0e060202ff13","amp;dn":"Carol+Berg+-+Rai-Kirah+Trilogy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff4b501b56e1986fe57d31dfacdc0e060202ff13","infoHashBuffer":{"type":"Buffer","data":[255,75,80,27,86,225,152,111,229,125,49,223,172,220,14,6,2,2,255,19]},"announce":[],"urlList":[]}}